{
  "datasource": {
    "key": "about",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "intro": "From full-stack engineers and heavy-lifting technologists to expert product strategists and heavyweight project directors: we only hire senior, talented team players with impressive talent.",
          "body": "But with high standards come hard choices. And in assembling the ideal team for our forward-thinking technology company, we've learnt a few things:\n\n* The best talent doesn't always live within an hour of central London\n* The brightest people aren't necessarily in it for the 9 to 5\n* Inspiration can strike at any time – we need the tools to record and deploy when it does\n\nHence a [radical way of working for DADI](../how-we-work/): a flexible attitude and unique approach to recruitment that make us quite the draw for smart people (even if we say so ourselves).",
          "environment": "To attract the best people we have to be flexible – and trust our people to work however suits them.\n\n**We think it makes DADI a pretty special place to work.**",
          "quote": "“We don't do 'hack' or 'innovation' days because everyday, engineers get to personally innovate.\n\nWe don't piggy-back off old technology or patch and hack our way to delivering something we aren't proud of.\n\nWe research and experiment with bleeding edge technologies and collaborate to build out the perfect set of platform services.\n\nWe peer review and share vital engineering knowledge, encouraging each other to step up and embrace the most challenging of technical tasks.\n\nAll of those things are awesome.”",
          "principals": "## Principles\n\n**Work asynchronously.** Individual team members more or less works at their own pace, with collaboration and agreement being handled by asynchronous mechanisms.\n\n**No 9 to 5.** Get the job done on time (and don't upset the client) and you can work the hours you want.\n\n**Work at your own pace.** We handle things like collaboration and sign off through the best tools for the job, all in support of asynchronous working.\n\n**Minimal meetings.** Unless we really need to powwow in person, we keep in touch using cloud-based tools like Slack (much more efficient, believe us).\n\n**Work where you want.** Yes, be diligent, stick to deadlines and do great work. But where and how you do it is up to you.",
          "perks": "## Perks\n\n* A job that works around your life (not the other way round)\n* Work with some of the most talented people in the world\n* No need to commute\n* No need to be tied to a desk\n* Plenty of excuses to meet up with the rest of the team\n* Work on things you'll love\n* Get paid for giving a shit"
        },
        {
          "lang": "de",
          "intro": "Von Full-Stack Entwicklern und schwerst arbeitenden Technologen zu Experten der Produkstrategie und Projektleitern, die echt Schwergewichte sind: Wir beschäftigen nur ranghohe, talentierte Teamplayer mit außergewöhnlichem Talent.",
          "body": "Allerdings kommt mit hohem Standard auch eine harte Auswahl. Wir haben einige Dinge gelernt, während wir das ideale Team für unsere zukunftsfähge Technologiefirma zusammengestellt haben:\n\n* Die größten Talente leben nicht unbedingt eine Stunde vom Londoner Zentrum weg\n* Die cleversten Menschen wollen nicht unbedingt von 9 bis 5 arbeiten\n* Inspiration kann einen jederzeit treffen - wir brauchen die Tools um diese aufzunehmen und umzusetzen, wenn sie auftritt\n\nDeshalb [eine radikale Weise um für DADI zu arbeiten(../how-we-work/): Eine flexible Einstellung und eine einzigartige Herangehensweise an das Recruitment, das uns großartige Talente beschert (selbst wenn wir das von uns selbst behaupten).",
          "environment": "Um die besten Menschen anzuziehen, müssen wir flexibel sein - und darauf vertrauen, dass unsere Leute arbeiten, wann es ihnen passt.\n\n**Wir denken, dass dies DADI zu einem sehr außergewöhnlichen Arbeitsplatz macht.**",
          "quote": "“Wir führen keine 'Hack' oder 'Innovations-' Tage durch, weil bei uns die Entwickler jeden Tag persönlich Neuerungen einbringen können.\n\nWir nehmen keine alte Technologie Huckepack oder patchen und hacken auf unsere Weise, um etwas zu entwickeln, worauf wir nicht stolz sind.\n\nWir forschen und experimentieren mit der aktuellsten Technologie und arbeiten eng zusammen, um die perfekte Zusammenstellung von Plattform Services zu entwickeln.\n\nWir unterziehen uns einem Peer Review Verfahren und tauschen essentielle Entwicklungserkenntnisse aus, was uns gegenseitig ermutigt, aufzustehen und die herausfordernsten technischen Aufgaben anzugehen.\n\nAll diese Dinge sind wunderbar”",
          "principals": "## Prinzipien\n\n**Asynchron Arbeiten.** Die einzelnen Teammitglieder arbeiten mehr oder weniger in ihrer eigenen Geschwindigkeit, in Zusammenarbeit und Zustimmung, durch asynchrone Mechanismen behandelt zu werden.\n\n**Kein 9 bis 5.** Erledige den Job rechtzeitig (und verärgere den Kunden nicht), dann kannst Du arbeiten, wann du möchtest.\n\n**Arbeite nach deiner eigenen Geschwindigkeit.** Zusammenarbeit und Genehmigungen werden bei uns durch die besten Tools für diesen Job erledigt, um die Asynchronität des Arbeitens zu gewährleisten.\n\n**Meetings auf dem Minimum.** Wenn wir nicht gerade unbedingt Kriegsrat halten müssen, halten wir uns durch cloud-based Tools wie Slack auf dem Laufenden (das ist wesentlich effizienter, das kannst Du uns glauben).\n\n**Arbeiten von wo Du willst.** Ja, sei gewissenhaft, halte die Deadlines ein und mache einen guten Job. Aber wo und wie Du das tust, ist Dir überlassen.",
          "perks": "## Vorteile\n\n* Ein Job, der sich deinem Leben anpasst (Nicht anders herum)\n* Arbeite mit einigen der talentiertesten Menschen der Welt\n* Pendeln nicht nötig\n* Du bist nicht an einen Schreibtisch gebunden\n* Zahlreiche Ausreden, um den Rest des Teams zu treffen\n* Arbeite an den Dingen, die Du liebst\n* Werde bezahlt dafür, dass Du dich ein Dreck scheren kannst"
        },
        {
          "lang": "jp",
          "intro": "フルスタックエンジニアや力仕事の技術者からプロダクト戦略家のエキスパートや重量級プロジェクトディレクターまで、素晴らしい才能を持ったシニアレベルで能力のあるチームプレイヤーだけを採用します。",
          "body": "それでも高い基準には厳しい選択があります。私たちのような先進的な考えのテクノロジー企業にとって理想のチームを組み立てるために、私たちはいくつかのことを学びました。\n\n最高の才能はロンドンの中心から1時間以内に住んでいるとは限りません。\n\n聡明な人が9時から5時まで詰めている必要はありません。\n\nインスピレーションはいつ来るか分かりません。それが来たときに記録し展開するツールが私たちには必要です。\n\nそこでDADIの急進的なやり方は次のようなものです。すなわち柔軟な態度と採用のためのユニークなアプローチ。これにより素晴らしい才能の方 (私たち自身がそうだとしても) を引き寄せることができるのです。",
          "environment": "最高の人たちを惹きつけるためには、私たちが柔軟でなければなりません。働きながらも自身に合うように従業員に任せます。\n\nこれでDADIがとても素敵な働き場所になると考えています。",
          "quote": "「私たちに『ハック』デーや『イノベーション』デーはありません。なぜなら毎日エンジニアは個人的にイノベーションを起こしているからです。\n\n私たちは、誇りに思っていないものを提供するために古いテクノロジー乗っかったり、私たちのやり方にパッチを当てたりハックしたりすることはしません。\n\n最先端技術の研究と検証を行い、協力して完璧なプラットフォームサービスを構築します。\n\n私たちは同等の立場で技術的な知識を検討して共有し、互いに励ましてステップアップし、最も挑戦的な技術的任務を受け入れます。\n\nぜんぶ素晴らしいことです。」",
          "principals": "## 指針\n\n非同期で仕事します。個々のチームメンバーは、おおよそ自分のペースで仕事します。コラボレーションと合意は非同期メカニズムによって取り扱われます。\n\n9時から5時までではありません。仕事を時間通りに(クライアントを動揺させないで) 済ませて、望む時間に就くことができます。\n\n自分のペースで働きます。コラボレーションやサインオフのようなことは、非同期作業をサポートする最良のツールを使って処理します。\n\n会議は最小限です。直接の会議を開く必要が本当にないかぎり、Slackのようなクラウドベースのツール (より一層効率的なのです。信じてください。) を使用して連絡します。\n\n働きたいところで働きます。そう。勤勉で、締め切りを守り、素晴らしい仕事をしてください。どこでどのように行うのかはあなたの自由です。",
          "perks": "## 特典\n\n* あなたの人生に合わせて働く仕事 (逆ではない)\n* 世界で最も有能な人たちと仕事をする\n* 通勤の必要はありません\n* 机に縛られる必要はありません\n* チームの人と会うための山のような口実\n* 愛することに取り組む\n* 興味あることで報酬を得る"
        },
        {
          "lang": "fr",
          "intro": "Des ingénieurs et des technologues de configuration aux stratèges de produits experts et aux directeurs des gros projets : nous n'embauchons que des joueurs talentueux et qualifiés avec des talents impressionnants.",
          "body": "Mais les standards élevés comportent des choix difficiles. Et pendant que nous rassemblions l'équipe idéale pour notre société technologique axée sur l'avenir, nous avons appris quelques éléments:\n\n* Les meilleurs talents ne vivent pas toujours à moins d'une heure du centre de Londres\n* Les personnes les plus brillantes ne sont pas nécessairement là de 9 à 17 heures\n* L'inspiration peut venir à tout moment – nous avons besoin des outils pour enregistrer et déployer quand elle le fait\n\nD'où une façon radicale de travailler pour DADI : une attitude souple et une approche unique du recrutement qui nous permettent d'obtenir un talent formidable (même si nous le disons nous-mêmes).",
          "environment": "Pour attirer les meilleures personnes, nous devons être flexibles – et faire confiance à nos gens pour travailler de la façon qui leur convient.\n\n**Nous pensons que ça fait de DADI un endroit assez spécial pour travailler.**",
          "quote": "“Nous ne faisons pas de jours d'« innovation » parce que tous les jours, les ingénieurs innovent personnellement.\n\nNous ne tirons pas profit des anciennes technologies ou ne nous taillons pas un chemin pour livrer quelque chose dont nous ne sommes pas fiers.\n\nNous recherchons et expérimentons des technologies de pointe et collaborons pour développer l'ensemble parfait de services de plate-forme.\n\nNous évaluons de façon réciproque et partageons des connaissances en ingénierie vitales, nous encourageons mutuellement à intensifier et à adopter les tâches techniques les plus difficiles.\n\nToutes ces choses sont géniales.”",
          "principals": "## Principes\n\nTravaillez de manière asynchrone. Les membres individuels de l'équipe travaillent plus ou moins à leur propre rythme, la collaboration et l'accord étant gérés par des mécanismes asynchrones.\n\nNon de 9 h à 17 h. Finissez le travail à temps (et ne fâchez pas le client) et vous pouvez travailler les heures que vous souhaitez.\n\nTravaillez à votre rythme. Nous gérons des choses comme la collaboration et nous nous engageons sur les meilleurs outils pour le travail, tout en faveur du travail asynchrone.\n\nRéunions minimales. À moins que nous ayons vraiment envie de persévérer en personne, nous restons en contact en utilisant des outils basés sur le cloud comme Slack (beaucoup plus efficaces, croyez-nous).\n\nTravaillez où vous voulez. Oui, soyez diligent, respectez les délais et faites un excellent travail. Mais où et comment vous le faites dépend de vous. ",
          "perks": "## Avantages\n\n* Un travail qui fonctionne autour de votre vie (non le contraire)\n* Travaillez avec certaines des personnes les plus talentueuses du monde\n* Il n'est pas nécessaire de se déplacer\n* Il n'est pas nécessaire d'être attaché à un bureau\n* Beaucoup d'excuses pour rencontrer le reste de l'équipe\n* Travaillez sur des choses que vous aimerez\nRecevez des paiements pour vous en foutre"
        },
        {
          "lang": "es",
          "intro": "Desde los ingenieros \"full-stack\" hasta los tecnólogos de levantamiento pesado y los estrategas de productos expertos y directores de proyectos de peso pesado: solo contratamos a jugadores experimentados y talentosos con talento impresionante.",
          "body": "Pero los altos estándares llevan aparejadas opciones difíciles. Y al reunir el equipo ideal para nuestra empresa de tecnología avanzada, hemos aprendido algunas cosas:\n\n* El mejor talento no siempre vive a una hora del centro de Londres\n* Las personas más brillantes no están ahí necesariamente de 9 a 5\n* La inspiración puede llegar en cualquier momento: necesitamos las herramientas para grabar y desplegar cuando lo hace\n\nPor lo tanto, una forma radical de trabajar para DADI: una actitud flexible y un enfoque único de contratación que nos hacen destacar en el gran talento (aunque lo digamos nosotros mismos).",
          "environment": "Atraer a las mejores personas tenemos para que sean flexibles, y confiar en que nuestra gente trabaje de la forma que les convenga.\n\n**Creemos que eso hace que DADI sea un lugar muy especial para trabajar.**",
          "quote": "“No hacemos días de \"trucos\" o \"innovación\" porque todos los días, los ingenieros innovan personalmente.\n\nNo nos ahorramos la vieja tecnología o los parches o hacemos las cosas a las apuradas para entregar algo de lo que no estamos orgullosos.\n\nInvestigamos y experimentamos con tecnologías de vanguardia y colaboramos para crear el conjunto perfecto de servicios de plataforma.\n\nExaminamos y compartimos conocimientos vitales de ingeniería, animándonos unos a otros a intensificar y aceptar las tareas técnicas más difíciles.\n\nTodas esas cosas son impresionantes.”",
          "principals": "## Principios\n\nTrabaje de manera asincrónica: los miembros de cada equipo trabajan más o menos a su propio ritmo, con la colaboración y el acuerdo gestionados por mecanismos asíncronos.\n\nNo de 9 a 5. Termine el trabajo a tiempo (y no moleste al cliente) y podrá trabajar las horas que desee.\n\nTrabaje a su propio ritmo. Manejamos cosas como la colaboración y firmamos a través de las mejores herramientas para el trabajo, todo en apoyo del trabajo asíncrono.\n\nReuniones mínimas. A menos que realmente necesitemos reunirnos en persona, nos mantenemos en contacto utilizando herramientas basadas en la nube como Slack (mucho más eficiente, créanos).\n\nTrabaje donde quiera. Sí, sea diligente, cíñase a los plazos y haga un gran trabajo. Pero dónde y cómo lo hace depende de usted.",
          "perks": "## Beneficios\n\n* Un trabajo que se desarrolla en torno a su vida (no al revés)\n* Trabaje con algunas de las personas más talentosas del mundo\n* No es necesario viajar\n* No es necesario estar pegado a un escritorio\n* Un montón de excusas para reunirse con el resto del equipo\n* Trabaje en cosas que le encantarán\nReciba pagos por dar una mierda"
        },
        {
          "lang": "ru",
          "intro": "От \"full-stack\" инженеров и тяжеловесных технологов до экспертов-стратегов по продуктам и тяжеловесных руководителей проектов: мы нанимаем только опытных и талантливых командных игроков с впечатляющими способностями.",
          "body": "Но с высокими стандартами приходит тяжелый выбор. И в процессе формирования идеальной команды для нашей компании прогрессивных технологий мы узнали несколько фактов:\n\n* Лучшие таланты не всегда живут в часе езды от центра Лондона\n* Способные люди не всегда предпочитают работу с 9 до 5\n* Вдохновение может нагрянуть в любое время, и нам нужны инструменты, чтобы зафиксировать его и воплотить в жизнь, когда оно появится\n\nСледовательно, главный принцип работы в DADI: гибкость и уникальный подход к занятости, которые делают нас довольно привлекательными для больших талантов (несмотря на то, что это мы так утверждаем).",
          "environment": "Чтобы привлекать лучших, нам нужно быть гибкими и доверять нашим людям в том, как им комфортнее работать.\n\n**Мы считаем, что это делает DADI довольно особенным местом для работы.**",
          "quote": "“У нас нет специальных \"хакерских\" или \"инновационных\" дней, потому что каждый день у наших инженеров есть возможность лично внедрять инновации.\n\nМы не выезжаем за счет старых технологий и патчей, предлагая нечто, чем не особо гордимся.\n\nМы проводим исследования и экспериментируем с передовыми технологиями, совместно работая над созданием идеального набора услуг платформы.\n\nМы оцениваем работу друг друга и делимся жизненно важными инженерными знаниями, поощряя друг друга в том, чтобы браться даже за самые сложные технические задачи.\n\nВсе это потрясающе”",
          "principals": "## Принципы\n\nРаботайте в асинхронном режиме. Отдельные члены команды в большей или меньшей мере работают с своем собственном темпе, а вопросы совместной работы и согласования решаются с помощью механизмов для асинхронной работы.\n\nНикаких с 9 до 5. Выполняйте работу вовремя (и не расстраивайте клиента), и можете работать в любое время.\n\nРаботайте в своем собственном темпе. Мы решаем такие вопросы, как совместная работа и согласования, с помощью лучших рабочих инструментов для поддержки асинхронного режима работы.\n\nМинимум встреч. Если нам действительно совсем не обязательно проводить совещание с глазу на глаз, мы поддерживаем связь с помощью таких облачных инструментов, как Slack (поверьте, так гораздо эффективнее).\n\nРаботайте, где хотите. Да, будьте исполнительны, придерживайтесь сроков и делайте работу хорошо. Но где и как вы это делаете, решаете вы.",
          "perks": "## Преимущества\n\n* Работа, сосредоточенная вокруг вашей жизни (а не наоборот)\n* Работайте с одними из самых талантливых людей в мире\n* Нет необходимости ездить на работу\n* Нет необходимости быть привязанным к рабочему столу\n* Множество оправданий для встречи с остальными членами команды\n* Работайте над тем, что любите\n* Получайте зарплату за то, что вам не все равно"
        },
        {
          "lang": "pt",
          "intro": "Desde engenheiros full-stack e tecnologistas pesos-pesados até grandes estrategas de produto e directores de produto sénior: só recrutamos indivíduos altamente experientes e com um talento incrível. Mas com os padrões altos vêm escolhas difíceis.",
          "body": "E no que toca a montar a equipa ideal para a nossa empresa de tecnologia vanguardista, aprendemos algumas coisas:\n\n* O melhor talento nem sempre se encontra a uma hora de distância de Londres\n* As pessoas mais brilhantes não estão necessariamente interessadas em trabalhar das 9 às 5\n* A inspiração aparece a qualquer hora — precisamos das ferramentas para a captar e accionar nessas altura\n\nDaí a forma radical da DADI: uma atitude flexível e uma abordagem única ao recrutamento que faz de nós um íman de grande talento (mesmo que sejamos nós a dizê-lo).",
          "environment": "Para atrair os melhores, temos de ser flexíveis - e confiar que as nossas pessoas trabalham da forma como mais lhes convém.\n\n**Achamos que isto faz da DADI um sítio muito especial para se trabalhar.**",
          "quote": "“Nós não fazemos dias de 'hack' ou de 'inovação', porque todos os dias os nossos engenheiros têm a oportunidade de inovar.\n\nNão nos apoiamos em tecnologia obsoleta ou colamos coisas com fita-cola para tentar entregar algo de que não nos orgulhamos.\n\nInvestigamos e experimentamos com tecnologia de ponta e colaboramos para construir a melhor plataforma de serviços.\n\nRevemos o trabalho uns dos outros e partilhamos conhecimento de engenharia essencial, encorajando os nossos colegas a levantarem o braço e abraçarem um novo desafio técnico, por mais desafiante que seja.\n\nTodas estas coisas são brutais.",
          "principals": "## Princípios\n\nTrabalhar assincronamente. Os membros da equipa trabalham mais ou menos no seu próprio ritmo, com a colaboração e planeamento tendo lugar através de mecanismos assíncronos.\n\nNada de 9 às 5. Faz o trabalho a horas (sem chatear o cliente) e trabalha as horas que quiseres.\n\nTrabalha ao teu próprio ritmo. Nós abordamos coisas como colaboração e aprovação através das melhores ferramentas do mercado, tudo em suporte do trabalho assíncrono.\n\nReuniões mínimas. A menos que queiramos dar duas de treta pessoalmente, comunicamos usando ferramentas Cloud como o Slack (muito mais eficiente, acredita em nós).\n\nTrabalha onde quiseres. Sim, sê diligente, respeita os prazos e produz coisas fantásticas. Mas onde o fazes só a ti diz respeito.",
          "perks": "## Benefícios\n\n* Um trabalho que se molda à tua vida (e não o contrário)\n*Trabalha com algumas das pessoas mais talentosas do mundo\n* Não há viagens de/para o escritório\n*Não tens de estar preso a uma secretária\n* Imensas desculpas para te encontrares com o resto da equipa\n* Trabalha em coisas de que gostas\n* És pago para te importares."
        },
        {
          "lang": "zh_hant",
          "intro": "從全端工程師、大數據深度學習演算 (heavy-lfiting) 技術專家到專門產品策略師和重量級專案管理師：我們只雇用經歷豐富、擁有驚艷才華的團隊成員。",
          "body": "但高標準也帶來了選擇困難。在為我們具前瞻性的科技公司尋找理想的工作團隊過程中，我們學到幾項事情：\n\n* 最好的人才不一定只住在離倫敦中心一小時內的距離\n* 最有能力的人才不一定只能朝九晚五\n* I隨時都可能啟發靈感——因此我們需要能隨時記錄與部署的工具\n\n因此為 DADI 工作的革新方式就是為我們吸引絕佳人才的優勢：對人才招募彈性靈活的態度及獨特的招募機制（即使是我們自己這麼說）。",
          "environment": "為了吸引最好的人才，我們必須得靈活彈性——以及相信我們工作夥伴認為適合他們的工作方式。\n\n**我們認為這讓 DADI 成為一個十分特別的工作地方。**",
          "quote": "「我們不舉行所謂的『駭客』或『創新』日，因為工程師們本身在每天都得各自創新。\n\n我們也不執著於舊科技或者透過臨時處理和走捷徑來傳遞我們不覺得值得驕傲的事。\n\n我們一直以來都以極先端的技術來研究及實驗，並且互相協同合作來購艦出最完美的平台服務組合。\n\n我們採用同儕審查並彼此分享重要工程知識，互相鼓勵以加強實力來接受最具挑戰性的高技術任務。\n\n這些所有堅持都很有意義 。」",
          "principals": "## 原則\n\n獨立地異步工作。每位團隊成員或多或少都能依自己的步調來工作，同時共同協作和協議項目也採用異步機制來處理。\n\n不用朝九晚五。只要能及時完成工作（並且不要激怒客戶），你就能隨意決定你的個人工作時間。\n\n以你自己的步調工作。我們透過最棒的工具來處理像是需要協作和批准的事項來全面支援異步工作。\n\n極簡化的會議。除非我們真的非常需要親自會面商談，否則我們通常都使用像 Slack 的雲端工具來保持溝通（相信我們，這真的更有效率多了）。\n\n在任何你想要的地方工作。是的，只要你保持勤奮、遵守工作期限、然後維持出色工作表現，工作地點與方式全都決定於你。",
          "perks": "## 額外津貼\n\n* 一個能為享受工作與人生的全方位職業（而非讓工作限制了生活）\n* 與來自全世界出色的人才一起工作\n* 無需通勤\n* 無需被限制在辦公室裡\n* 有很多理由能和其他團隊成員見面\n* 為你將會愛上的事物工作\n* 接受挑戰來獲得報酬"
        }
      ]
    }
  }
}