{
  "datasource": {
    "key": "faq",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "body": "## About DADI\n\n### 1\\. What does \"DADI\" mean?\n\nDADI is an acronym for Decentralised Architecture for a Democratic Internet.\n\n### 2\\. There are a lot of platform choices. Why choose DADI?\n\nDADI does things differently. It is a web services framework with data at its heart, enabling the creation of real time, individually targeted experiences driven by machine learning. No other technology stack, framework or content management system provides this functionality.\n\nIt’s Open Source; and it powers some of the largest and most popular products on the Web.\n\nWith DADI you can easily create versatile, content centric products. To see why others have chosen DADI, check out our [success stories](/support/).\n\n### 3\\. How can I help and contribute to DADI?\n\nContributing guidelines for all of the apps in our stack can be found at the top level of their respective repositories in Git:\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### 4\\. Why does DADI have some features but not others?\n\nWe value innovation and stability. We are careful about sacrificing one for the other, so we work on balance. Because DADI is used widely in production, every single line of code that goes into DADI’s core is meticulously scrutinized. Most changes to core go through dozens, if not hundreds, of revisions before being included.\n\nWe’re also aware of the time great software design, development, translation, and testing takes. Because DADI is built around a microservices architecture, and because our focus is on keeping the core app set to essential functionality, encouraging contributed modules to extend it, our version release cycle happens a far greater pace than alternative solutions.\n\n### 5\\. When and how are new versions released?\n\nDADI’s release cycle schedule uses Semantic Versioning 2.0.0:\n\nGiven a version number MAJOR.MINOR.PATCH, increment the:\n\n*   MAJOR version when you make incompatible API changes,\n*   MINOR version when you add functionality in a backwards-compatible manner, and\n*   PATCH version when you make backwards-compatible bug fixes.\n\n_Additional labels for pre-release and build metadata are available as extensions to the MAJOR.MINOR.PATCH format._\n\n## Working with DADI\n\n### 1\\. Can I migrate a WordPress/Drupal/whatever site to DADI?\n\nYes. And given the development pace achievable with DADI, doing so does not usually represent a significant amount of work. Data mappings to import your content into DADI API will be required and your templates will need to be moved to DADI Web (which supports multiple template languages, meaning that you probably need to redevelop them). And that’s about it.\n\n_“Products built with DADI are delivered in days and weeks, not weeks and months.”_\n\n### 2\\. How can I use DADI in my mobile app?\n\nAt the heart of DADI is [API](/{params.lang}/platform/api), a high-performance RESTful API layer that is perfect for powering mobile applications. You can use with DADI Publish to provide a CMS for iOS/Android/Windows Phone. And when chained with DADI Predict and DADI Track, you can start to make real time content decisions based on data intelligence.\n\n### 3\\. Does DADI use any code conventions or styles?\n\nYes. Follow the DADI Coding Standards found within the Contributing Guidelines for each DADI app when submitting any code for inclusion in the DADI project.\n\nTo ensure consistency throughout the source code, keep these rules in mind as you are working:\n\n*   Please use _two-space indentation_, as used in Node.JS itself\n*   All features or bug fixes _must be tested_ by one or more tests. Browse our test suites for examples\n*   All public API methods _must be documented_ with [JSDoc](http://usejsdoc.org)\n\n### 4\\. May I change DADI’s core files to make changes to my site or application?\n\nWe strongly recommend that you don’t. Hacking the core means that you won’t be able to take advantage of DADI updates - including any security updates - without losing your changes. It also makes it much less likely that bugs you create will be fixed by the community. Instead, make use of the data sources, events and hooks framework within the individual DADI apps.\n\n### 5\\. Where can I get help working with DADI?\n\nReach out to us on our public Slack. Or drop us a line. The issue queue in Git for each of the apps in the DADI platform is how we bring issues to the community’s attention."
        },
        {
          "lang": "de",
          "body": "## Über DADI\n\n### 1\\. Was bedeutet \"DADI\"?\n\nDADI ist eine Abkürzung für Dezentralisierte Architektur für ein Demokratisches Internet.\n\n### 2\\. Es gibt eine große Auswahl an Plattformen. Warum sollte ich DADI nutzen?\n\nDADI macht einiges anders. Es ist ein Internetdienstleistungssystem mit Daten im Zentrum, das es erlaubt, in Echtzeit und individuell zugeschnittene Erfahrungen getrieben durch maschinelles Lernen zu erstellen. Kein anderes Technologiesystem, Framework oder Content Management System kann diese Funktionen anbieten.\n\nEs ist Open Source; und beinhaltet einige der größten und bekanntesten Produkte des Internets.\n\nMit DADI kannst Du einfach vielseitige und inhaltszentrierte Produkte erstellen. Um zu erfahren, warum andere DADI benutzen, wirf einen Blick in unsere [Erfolgsgeschichten](/support/).\n\n### 3\\. Wie kann ich helfen und etwas zu DADI beisteuern?\n\nRichtlinien zur Mitarbeit an all unseren Apps in unserem System kannst Du am oberen Ende ihres entsprechenden Ordners in Git finden:\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### 4\\. Warum hat DADI einige Features aber andere nicht?\n\nWir schätzen Innovation und Stabilität. Wir sind vorsichtig etwas für etwas anderes über Bord zu werden, deshalb arbeiten wir auf Balance. Weil DADI weitreichend in der Produktion eingesetzt wird, wird jede Zeile Code, die in DADIs Kern eingeht, akribisch geprüft. Die meisten Änderungen im Kern gehen durch Dutzende, wenn nicht sogar Hunderte, von Prüfungen, bevor sie eingefügt werden.\n\nWir sind uns auch bewusst, wieviel Zeit gutes Software Design, Entwicklung, Übersetzung und Testen benötigt. Weil DADI auf Microservice Architektur basiert und weil unser Fokus darauf liegt, der Kernapp eine essentielle Funktionalität zu gewährleisten, während neue Module diese erweitern sollen, sind die Zyklen der Versionsveröffentlichungen meist länger als bei alternativen Lösungen.\n\n### 5\\. Wann und wie werden neue Versionen veröffentlicht?\n\nDADIs Veröffentlichungszyklus folgt Semantic Versioning 2.0.0:\n\nEine gegebene Versionsnummer MAJOR.MINOR.PATCH erhöht sich: \n\n*   MAJOR Version wenn inkompatible API Veränderungen vorgenommen wurden,\n*   MMINOR Version wenn Funktionalität hinzugefügt wurde, die rückwärtskompatibler Art ist und\n*   PATCH Version wenn es rückwärtskompatible Bugfixes gibt.\n\n_Zusätzliche Bezeichnungen für pre-release und build metadata sind als Erweiterung zum MAJOR.MINOR.PATCH Format hinzugefügt. _\n\n## Arbeiten mit DADI\n\n### 1\\. Kann ich eine WordPress/Drupal/whatever Seite auf DADI umstellen?\n\nJa. Und wenn man die Entwicklungsgeschwindigkeiten bedenkt, die mit DADI möglich sind, kostet dieses gewöhnlich keinen großen Arbeitsaufwand. Es werden Data Mappings benötigt, um deinen Inhalt nach DADI API zu importieren und deine Vorlagen müssen zu DADI Web transferiert werden (welches verschiedene Vorlagensprachen unterstützt, was bedeutet, dass Du sie vermutlich neu entwickeln musst). Und das war auch schon alles.\n\n_“Produkte, die mit DADI erstellt wurde, werden innerhalb von Tagen und Wochen fertiggestellt, nicht innerhalb von Wochen und Monaten.”_\n\n### 2\\. Wie kann ich DADI als mobile App verwenden?\n\nDer Kern von DADI ist API, eine high-perfomance RESTful API Oberfläche, die perfekt ist, um mobile Anwendungen zu benutzen. Du kannst DADI Publish benutzen um ein CMS für iOS/Android/Windows Phone bereitzustellen. Und wenn es mit DADI Predict und DADI Track kombiniert wird, kannst du inhaltliche Entscheidungen in Echtzeit fällen, basierend auf Datenintelligenz.\n\n### 3\\. Nutzt DADI bestimmte Code Vereinbarungen oder Styles?\n\nJa. Folge den DADI Coding Standards, die Du innerhalb der Richtlinien zur Mitarbeit für jede DADI App findest, wenn Du einen Code einschickst, der in das DADI Projekt mit aufgenommen werden soll.\n\nUm Konsistenz innerhalb des Quellcodes zu wahren, behalte diese Regeln im Kopf, wenn Du daran arbeitest:\n\n* Bitte nutze zwei Leerzeichen als Einrückung, wie es in Node.JS verwendet wird.\n* Alle Features oder Bug Fixes müssen durch ein oder mehrere Tests getestet worden sein. Durchstöbere zum Beispiel unsere Test suites.\n Alle öffentlichen API Methoden müssen mit [JSDoc](http://usejsdoc.org) dokumentiert werden.\n\n### 4\\. Kann ich DADIs Kerndateien verändern um Veränderungen an meiner Seite oder Anwendung vorzunehmen?\n\nWir empfehlen dringend, dies nicht zu tun. Den Kern zu hacken bedeutet, dass Du nicht mehr in den Vorteil der DADI Updates - inklusive der Sicherheitsupdates - kommst, ohne dass deine Änderungen verloren gehen. Es wird dadurch auch weniger wahrscheinlich, dass die Bugs, die du kreierst, von der Community wieder gefixt werden. Stattdessen nutze die Datenquellen, Events und Hooks framework innerhalb der individuellen DADI Apps.\n\n### 5\\. Wo finde ich Hilfe um mit DADI zu arbeiten?\n\nKontaktiere uns in unserem öffentlichten Slack Chat. Oder hinterlasse uns ein paar Zeilen. Durch die Problemschlange in Git für jede der Apps in der DADI Plattform richten wir die Aufmerksamkeit der Community auf diese Probleme."
        },
        {
          "lang": "jp",
          "body": "## DADIについて\n\n### 「DADI」とは何ですか？\n\nDADIはDecentralised Architecture for a Democratic Internet (民主的インターネットの分散アーキテクチャー) の略称です。\n\n### プラットフォームの選択肢はたくさんあります。なぜDADIを選ぶのでしょうか？\n\nDADIは全く違うやり方を取ります。データを中心とするWebサービスフレームワークです。機械学習によるリアルタイムで個々に応じた体験を創出することを可能とします。このような機能を提供するテクノロジースタックやフレームワーク、コンテンツ管理システムは他にありません。\n\nオープンソースです。そしてWeb上の最も大きくて人気のあるプロダクトのいくつかを支えています。\n\nDADIによれば、多彩なコンテンツ中心のプロダクトを簡単に作成することができます。成功事例をチェックして、他の人がなぜDADIを選択したのかを見てみてください。\n\n### どうやってDADIに手伝いや貢献をすることができますか？\n\n私たちのスタックにある全てのアプリに対する貢献のガイドラインは、それぞれのGitレポジトリのトップレベルにあります。\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### なぜDADIは他が持っていない特徴を有しているのですか？\n\n私たちはイノベーションと安定性を大切にしています。その一方が他方を犠牲にすることに注意していますので、バランスに取り組んでいます。DADIは広く使われていますので、DADIのコアに入るコードの一行一行まで細心の注意を払って精査されています。コアへの変更は、何百とは言わないまでも何十もの改訂を経て採用されます。\n\n私たちはまた、優れた設計、開発、翻訳、テストにかかる時間を意識しています。DADIはマイクロサービスアーキテクチャーを中心に構築されていますし、私たちは、拡張は寄せられたモジュールで行うことを推奨し、コアアプリケーションは必須機能に絞ることに重点を置いていますので、私たちのバージョンリリースのサイクルは、他のソリューションに比べて遙かに早いペースとなっています。\n\n### 新バージョンはいつどのようにリリースされますか？\n\nDADIのリリースサイクルのスケジュールにはセマンティックバージョニング2.0.0を採用しています.\n\nバージョン番号がMAJOR.MINOR.PATCHであるとして、次のものがインクリメントされます：\n\n* 互換性のないAPIの変更を行う場合には、MAJORバージョン\n* 後方互換性のある機能を追加する場合には、MINORバージョン\n* 後方互換性のあるバグ修正を行う場合には、PATCHバージョン\n\nMAJOR.MINOR.PATCHの形式の拡張として、プリリリースのラベルやビルドのメタデータの追加が可能です。\n\n## DADIの利用\n\n### WordPress/Drupal/その他のサイトをDADIに移行できますか？\n\nはい。DADIで達成可能な開発ペースを考えれば、通常であれば大量の作業にはなりません。DADI APIにコンテンツをインポートするデータマッピングが必要になります。また、テンプレートはDADI Web (複数のテンプレート言語をサポートしていますので、おそらく再開発が必要です。) に移行する必要があります。ですがそれくらいです。\n「DADIで構築されたプロダクトは、数日から数週間で配信されます。数週間から数ヶ月ではありません。」\n\n### モバイルアプリでDADIを使うにはどのようにすればよいですか？\n\nDADIの中心には、モバイルアプリケーションに最適な高機能RESTful APIレイヤーがあります。DADI Publishを用いてiOS/Android/Windows PhoneのためのCMSを提供できます。また、DADI PredictとDADI Trackとを連携させた場合、データインテリジェンスに基づいてリアルタイムにコンテンツの決定を行うことを始めることができます。\n\n### DADIではコードの規約やスタイルを採用していますか？\n\nはい。DADIプロジェクトに組み入れるコードを投稿する場合には、各DADIアプリについての貢献ガイドラインの中にあるDADIコーディング基準に従ってください。\n\nソースコードを通じた整合性を確保するために、作業中には以下の規則を守ってください：\n\n* 2つのスペースインデントを使用してください。Node.JS自身で使われているのと同様です。\n* 全ての機能やバグ修正は、1つまたは複数のテストでテストする必要があります。例についてはテストスイートを参照ください。\n* 公開APIのメソッドはすべてJSDocでドキュメント化する必要があります。\n\n### 自分のサイトやアプリケーションのためにDADIのコアファイルを変更してもよいですか？\n\nそうしないことを強くお勧めします。コアをいじりますと、その変更を失うことなくDADIのアップデート (セキュリティアップデートを含みます。) を受ける利益を享受できません。また、あなたが作成したバグがコミュニティによって修正される可能性は非常に低くなります。その変わりとして、各DADIアプリの中で、データソースやイベント、フックのフレームワークをご利用ください。\n\n### DADIの利用についてどこでヘルプを受けられますか？\n\n私たちのパブリックSlackで私たちと接触してください。あるいは、私たちまでご連絡ください。DADIプラットフォームの各アプリのためのGitのIssueキューは、私たちが問題点をコミュニティの目にさらすやり方です。"
        },
        {
          "lang": "fr",
          "body": "## About DADI\n\n### Que signifie « DADI » ?\n\nDADI est l'acronyme d'architecture décentralisée pour un Internet démocratique\n\n### Il y a beaucoup de plate-formes disponibles. Pourquoi choisir DADI ?\n\nDADI fait les choses différemment. Il s'agit d'un cadre de services Web avec dont l'élément central sont les données, permettant la création d'expériences en temps réel, ciblées individuellement par l'apprentissage machine.\n\nAucun autre système de gestion de contenu, de structure ou de système de technologie ne fournit cette fonctionnalité.\n\nC'est à source ouverte ; et il gère certains des produits les plus grands et les plus populaires sur le Web.\n\nAvec DADI, vous pouvez facilement créer des produits polyvalents et axés sur le contenu. Pour voir pourquoi d'autres ont choisi DADI, consultez nos histoires de réussite.\n\n### Comment puis-je aider et contribuer à DADI ?\n\nLes directives de contribution pour toutes les applications de notre ensemble peuvent être trouvées au niveau supérieur de leurs dépôts respectifs dans Git :\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### Pourquoi DADI a-t-il certaines fonctionnalités mais pas d'autres ?\n\nNous apprécions l'innovation et la stabilité. Nous faisons attention à ne pas sacrifier l'un pour l'autre, donc nous travaillons dans l'ensemble. Comme DADI est largement utilisé dans la production, chaque ligne de code qui se trouve dans le noyau de DADI est minutieusement examinée. La plupart des changements dans la partie centrale passent par des dizaines, voire des centaines de commentaires avant d'être inclus.\n\nNous sommes également conscients du temps que prennent la conception, le développement, la traduction et les tests de bons logiciels. Comme DADI est construit autour d'une architecture de microservices, et comme notre objectif est de maintenir l'application centrale réglée à des fonctionnalités essentielles, en encourageant les modules apportés pour la prolonger, notre cycle de publication de versions évolue beaucoup plus rapidement que les solutions alternatives.\n\n### Quand et comment les nouvelles versions sont-elles publiées ?\n\nLe programme de cycle de publication de DADI utilise la version sémantique 2.0.0.\n\nÉtant donné un numéro de version MAJOR.MINOR.PATCH, incrémentez la/les :\n\n* Version MAJOR lorsque vous effectuez des modifications de l'API incompatibles\n* Version MINOR lorsque vous ajoutez des fonctionnalités de manière rétrocompatible et\n* Version PATCH lorsque vous créez des corrections de bogues rétrocompatibles.\n\n_Étiquettes supplémentaires pour les métadonnées de pré-version et de construction sont disponibles en tant qu'extensions au format MAJOR.MINOR.PATCH._\n\n## Travailler avec DADI\n\n### Puis-je migrer un site WordPress/Drupal/n'importe quel site vers DADI ?\n\nOui. Et étant donné le rythme de développement réalisable avec DADI, ça ne représente généralement pas une quantité considérable de travail. Les mappages de données pour importer votre contenu dans l'API de DADI seront nécessaires et vos modèles devront être déplacés sur le Web de DADI (qui prend en charge plusieurs langues de modèles, ce qui signifie que vous devrez probablement les redévelopper). Et c'est à peu près tout.\n\n_Les produits fabriqués avec DADI sont livrés en des jours et des semaines, pas en des semaines et des mois._\n\n### Comment puis-je utiliser DADI dans mon application mobile?\n\nAu cœur de DADI est l'API, une couche API RESTful à haute performance qui est parfaite pour faire fonctionner les applications mobiles. Vous pouvez l'utiliser avec DADI Publish pour fournir un CMS pour iOS/Android/Windows Phone. Et lorsqu'elle est associé à DADI Predict et à DADI Track, vous pouvez commencer à prendre des décisions de contenu en temps réel basées sur l'intelligence des données.\n\n### DADI utilise-t-il des conventions ou des styles de code ?\n\nOui. Suivez les normes de codage de DADI trouvées dans les lignes directrices de contribution pour chaque application DADI lorsque vous soumettez tout code à inclure dans le projet DADI.\n\nPour assurer la cohérence dans tout le code source, gardez ces règles à l'esprit pendant que vous travaillez :\n\n* Utilisez l'indentation de deux espaces, tel qu'utilisée dans Node.JS lui-même\n* Toutes les fonctionnalités ou corrections de bogues doivent être vérifiées par un ou plusieurs tests. Parcourez nos ensembles de tests pour voir des exemples\n* Toutes les méthodes de l'API publique doivent être documentées avec JSDoc \n\n### Puis-je changer les fichiers principaux de DADI pour apporter des modifications à mon site ou à mon application ?\n\nNous vous recommandons vivement de ne pas le faire. Pirater la partie centrale signifie que vous ne pourrez pas profiter des mises à jour de DADI - y compris les mises à jour de sécurité - sans perdre vos modifications. Cela rend également beaucoup moins probable que les bogues que vous créez soient corrigés par la communauté. Au lieu de cela, utilisez le cadre des sources de données, des événements et des hooks dans les applications DADI individuelles.\n\n### Où puis-je obtenir de l'aide pour travailler avec DADI ?\n\nContactez-nous sur notre Slack public. Ou écrivez-nous. La file d'attente des problèmes dans Git pour chacune des applications dans la plate-forme DADI est la façon dont nous traitons les problèmes à l'attention de la communauté." 
        },
        {
          "lang": "es",
          "body": "## Acerca de DADI\n\n### ¿Qué significa \"DADI\"?\n\nDADI es un acrónimo de Arquitectura Descentralizada para un Internet Democrático.\n\n### Hay un montón de opciones de plataforma. ¿Por qué elegir DADI?\n\nDADI hace las cosas de manera diferente. Es un marco de servicios web con datos en su centro, que permite la creación de tiempo real, las experiencias individualmente dirigidas por el aprendizaje máquina.\n\nEs de código abierto; y ofrece su tecnología a algunos de los mejores y más populares productos de la web.\n\nCon DADI puede crear fácilmente productos versátiles y centrados en el contenido. Para ver por qué otros han elegido DADI, eche un vistazo a nuestras historias de éxito.\n\n### ¿Cómo puedo ayudar y contribuir a DADI?\n\nLas directrices que contribuyen a todas las aplicaciones de nuestro conjunto se pueden encontrar en el nivel superior de sus respectivos repositorios en Git:\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### ¿Por qué DADI tiene algunas características pero no otras?\n\nValoramos la innovación y la estabilidad. Prestamos atención a no sacrificar una por la otra, por lo que trabajamos en equilibrio. Dado que DADI se utiliza ampliamente en la producción, cada línea de código que entra en el núcleo de DADI se analiza meticulosamente. A través de docenas, si no cientos de revisiones antes de ser incluida.\n\nTambién somos conscientes del tiempo que lleva el gran diseño de software, desarrollo, traducción y pruebas. Debido a que DADI está construido alrededor de una arquitectura de microservicios, y debido a que nuestro enfoque es mantener el conjunto de aplicaciones básicas a una funcionalidad esencial, alentando los módulos aportados para extenderlo, nuestro ciclo de lanzamiento de versión ocurre a un ritmo mucho mayor que las soluciones alternativas.\n\n### ¿Cuándo y cómo se lanzan las nuevas versiones?\n\nEl programa del ciclo de lanzamiento de DADI utiliza Semantic Versioning 2.0.0:\nDado un número de versión MAJOR.MINOR.PATCH, incremente la:\n\n* Versión MAJOR cuando realiza cambios de API incompatibles,\n* Versión MINOR cuando añade funcionalidad de una manera compatible con versiones anteriores, y\n* Versión PATCH cuando haga correcciones de errores compatibles con versiones anteriores.\n\n_Las etiquetas adicionales para los metadatos de prelanzamiento y construcción están disponibles como extensiones del formato MAJOR.MINOR.PATCH._\n\n## Trabajar con DADI\n\n### ¿Puedo migrar de un sitio WordPress/Drupal/cualquiera a DADI?\n\nSí. Y dado el ritmo de desarrollo alcanzable con DADI, hacer esto no suele representar una cantidad significativa de trabajo. Los mapeados de datos para importar su contenido en la API DADI serán necesarios y sus plantillas tendrán que ser trasladadas a la Web DADI (que es compatible con múltiples lenguajes de plantilla, lo que significa que es probable que necesite volver a desarrollarlos). Y eso es todo.\n\n_Los productos construidos con DADI se entregan en días y semanas, no semanas y meses._\n\n### ¿Cómo puedo utilizar DADI en mi aplicación para móviles?\n\nEn el corazón de DADI está la API, una capa de alto rendimiento de API RESTful que es perfecta para hacer funcionar las aplicaciones móviles. Puede utilizar con DADI Publish para proporcionar un CMS para iOS/Android/Windows Phone. Y cuando está encadenado con DADI Predict y DADI Track, puede comenzar a tomar decisiones de contenido en tiempo real basadas en la inteligencia de datos.\n\n### ¿Utiliza DADI alguna convención o estilo de código?\n\nSí. Siga las normas de codificación de DADI que se encuentran dentro de las guías de contribución para cada aplicación DADI al enviar cualquier código para su inclusión en el proyecto DADI.\nPara garantizar la coherencia en todo el código fuente, tenga en cuenta estas reglas mientras trabaja:\n\n* Utilice la sangría de dos espacios, tal como se utiliza en el propio Node.JS \n* Todas las características o correcciones de errores se deben probar mediante una o más pruebas. Examine nuestros conjuntos de pruebas para ver ejemplos\n* Todos los métodos API públicos deben estar documentados con JSDoc\n\n### ¿Puedo cambiar los archivos principales de DADI para realizar cambios en mi sitio o aplicación?\n\nRecomendamos encarecidamente que no lo haga. Piratear el núcleo implica que no podrá aprovechar las actualizaciones de DADI, incluidas las actualizaciones de seguridad, sin perder sus cambios. También hace que sea mucho menos probable que los errores que cree sean corregidos por la comunidad. En su lugar, utilice el marco de fuentes de datos, eventos y hooks dentro de las aplicaciones DADI individuales.\n\n### ¿Dónde puedo obtener ayuda para trabajar con DADI?\n\nPóngase en contacto con nosotros en nuestro Slack público. O envíenos un mensaje. Dirigimos la atención de la comunidad en función de la cola de problemas en Git para cada una de las aplicaciones de la plataforma DADI."
        },
        {
          "lang": "es",
          "body": "## Acerca de DADI\n\n### ¿Qué significa \"DADI\"?\n\nDADI es un acrónimo de Arquitectura Descentralizada para un Internet Democrático.\n\n### Hay un montón de opciones de plataforma. ¿Por qué elegir DADI?\n\nDADI hace las cosas de manera diferente. Es un marco de servicios web con datos en su centro, que permite la creación de tiempo real, las experiencias individualmente dirigidas por el aprendizaje máquina.\n\nEs de código abierto; y ofrece su tecnología a algunos de los mejores y más populares productos de la web.\n\nCon DADI puede crear fácilmente productos versátiles y centrados en el contenido. Para ver por qué otros han elegido DADI, eche un vistazo a nuestras historias de éxito.\n\n### ¿Cómo puedo ayudar y contribuir a DADI?\n\nLas directrices que contribuyen a todas las aplicaciones de nuestro conjunto se pueden encontrar en el nivel superior de sus respectivos repositorios en Git:\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### ¿Por qué DADI tiene algunas características pero no otras?\n\nValoramos la innovación y la estabilidad. Prestamos atención a no sacrificar una por la otra, por lo que trabajamos en equilibrio. Dado que DADI se utiliza ampliamente en la producción, cada línea de código que entra en el núcleo de DADI se analiza meticulosamente. A través de docenas, si no cientos de revisiones antes de ser incluida.\n\nTambién somos conscientes del tiempo que lleva el gran diseño de software, desarrollo, traducción y pruebas. Debido a que DADI está construido alrededor de una arquitectura de microservicios, y debido a que nuestro enfoque es mantener el conjunto de aplicaciones básicas a una funcionalidad esencial, alentando los módulos aportados para extenderlo, nuestro ciclo de lanzamiento de versión ocurre a un ritmo mucho mayor que las soluciones alternativas.\n\n### ¿Cuándo y cómo se lanzan las nuevas versiones?\n\nEl programa del ciclo de lanzamiento de DADI utiliza Semantic Versioning 2.0.0:\nDado un número de versión MAJOR.MINOR.PATCH, incremente la:\n\n* Versión MAJOR cuando realiza cambios de API incompatibles,\n* Versión MINOR cuando añade funcionalidad de una manera compatible con versiones anteriores, y\n* Versión PATCH cuando haga correcciones de errores compatibles con versiones anteriores.\n\n_Las etiquetas adicionales para los metadatos de prelanzamiento y construcción están disponibles como extensiones del formato MAJOR.MINOR.PATCH._\n\n## Trabajar con DADI\n\n### ¿Puedo migrar de un sitio WordPress/Drupal/cualquiera a DADI?\n\nSí. Y dado el ritmo de desarrollo alcanzable con DADI, hacer esto no suele representar una cantidad significativa de trabajo. Los mapeados de datos para importar su contenido en la API DADI serán necesarios y sus plantillas tendrán que ser trasladadas a la Web DADI (que es compatible con múltiples lenguajes de plantilla, lo que significa que es probable que necesite volver a desarrollarlos). Y eso es todo.\n\n_Los productos construidos con DADI se entregan en días y semanas, no semanas y meses._\n\n### ¿Cómo puedo utilizar DADI en mi aplicación para móviles?\n\nEn el corazón de DADI está la API, una capa de alto rendimiento de API RESTful que es perfecta para hacer funcionar las aplicaciones móviles. Puede utilizar con DADI Publish para proporcionar un CMS para iOS/Android/Windows Phone. Y cuando está encadenado con DADI Predict y DADI Track, puede comenzar a tomar decisiones de contenido en tiempo real basadas en la inteligencia de datos.\n\n### ¿Utiliza DADI alguna convención o estilo de código?\n\nSí. Siga las normas de codificación de DADI que se encuentran dentro de las guías de contribución para cada aplicación DADI al enviar cualquier código para su inclusión en el proyecto DADI.\nPara garantizar la coherencia en todo el código fuente, tenga en cuenta estas reglas mientras trabaja:\n\n* Utilice la sangría de dos espacios, tal como se utiliza en el propio Node.JS \n* Todas las características o correcciones de errores se deben probar mediante una o más pruebas. Examine nuestros conjuntos de pruebas para ver ejemplos\n* Todos los métodos API públicos deben estar documentados con JSDoc\n\n### ¿Puedo cambiar los archivos principales de DADI para realizar cambios en mi sitio o aplicación?\n\nRecomendamos encarecidamente que no lo haga. Piratear el núcleo implica que no podrá aprovechar las actualizaciones de DADI, incluidas las actualizaciones de seguridad, sin perder sus cambios. También hace que sea mucho menos probable que los errores que cree sean corregidos por la comunidad. En su lugar, utilice el marco de fuentes de datos, eventos y hooks dentro de las aplicaciones DADI individuales.\n\n### ¿Dónde puedo obtener ayuda para trabajar con DADI?\n\nPóngase en contacto con nosotros en nuestro Slack público. O envíenos un mensaje. Dirigimos la atención de la comunidad en función de la cola de problemas en Git para cada una de las aplicaciones de la plataforma DADI."
        },
        {
          "lang": "ru",
          "body": "## О DADI\n\n### 1\\. Что значит \"DADI\"?\n\nDADI — это акроним Децентрализованной Архитектуры для Демократического Интернета (с англ. Decentralised Architecture for a Democratic Internet)\n\n### 2\\. Существует много разных платформ. Почему стоит выбрать DADI?\n\nDADI работает по-другому. Это фреймворк веб-сервисов, в основе которого лежат данные, позволяющие в режиме реального времени создавать индивидуально ориентированный опыт, управляемый с помощью машинного обучения. Ни один другой набор технологий, фреймворк или система управления контентом не обеспечивает такой функциональности.\n\nЭто платформа с открытым исходным кодом; и она обеспечивает работу одних из самых крупных и популярных продуктов в сети.\n\nС DADI вы можете с легкостью создавать универсальные, контент-ориентированные продукты. Чтобы узнать, почему другие выбрали DADI, прочтите наши истории успеха.\n\n### 3\\. Как я могу помочь и внести свой вклад в DADI?\n\nРекомендации для желающих нести свой вклад для всех наших приложений можно просмотреть на верхнем уровне их соответствующих репозиториев на Git:\n\n*   [DADI API](https://github.com/dadi/api/blob/master/CONTRIBUTING.md)\n*   [DADI Web](https://github.com/dadi/web/blob/master/CONTRIBUTING.md)\n*   [DADI CDN](https://github.com/dadi/cdn/blob/master/CONTRIBUTING.md)\n\n### 4\\. Почему у DADI есть одни функции, но нет других?\n\nМы ценим инновации и стабильность. Мы осторожно относимся к тому, чтобы жертвовать одним ради другого, поэтому мы работаем над соблюдением баланса. Так как DADI широко используется в производстве, каждая строка кода, которая входит в ядро DADI, тщательно изучается. Большинство изменений в ядре перед их включением проходят через десятки, если не сотни, ревизий.\n\nМы также знаем, сколько времени занимает качественная разработка программного обеспечения, производственные процессы, перевод и тестирование. Так как DADI построена на базе архитектуры микросервисов и мы ориентированы на то, чтобы основное приложение обладало необходимой функциональностью, а дополнительные модули расширяли ее, наш цикл релизов новых версий выполняется гораздо быстрее, чем при использовании альтернативных решений.\n\n### 5\\. Когда и как выпускаются новые версии?\n\nГрафик цикла релизов DADI использует систему нумерации версий Semantic Versioning 2.0.0:\n\nУчитывая номер версии MAJOR.MINOR.PATCH, следует увеличивать:\n\n*   MAJOR-версию, если вы вносите несовместимые изменения API,\n*   MINOR-версию, вы добавляете новый функционал, не нарушая обратной совместимости,\n*   PATCH-версию, если вы делаете обратно совместимые исправления.\n\n_Дополнительные обозначения для предрелизных и билд-метаданных возможны как дополнения к формату MAJOR.MINOR.PATCH._\n\n## Работа с DADI\n\n### 1\\. Могу ли я перенести сайт на WordPress/Drupal/другое на DADI?\n\nДа. И, учитывая скорость разработки, достигаемую с помощью DADI, на это не потребуется выполнение значительного объема работы. Потребуется мапирование для импорта вашего контента в API DADI, а также необходимо будет перенести ваши шаблоны в DADI Web (поддерживает несколько языков шаблонов, что означает, что вам, возможно, необходимо будет их обновить). Вот и все.\n\n_“С DADI на создание продуктов уходят не недели и месяцы, а недели и дни.”_\n\n### 2\\. Как можно использовать DADI в моем мобильном приложении?\n\nВ центре DADI лежит API, высокопроизводительный REST-слой API, идеально соответствующий требованиям для обеспечения работы мобильных приложений. Вы также можете воспользоваться DADI Publish для обеспечения CMS для систем iOS/Android/Windows Phone. А в связке с DADI Predict и DADI Track вы сможете принимать решения в режиме реального времени на основе анализа данных.\n\n### 3\\. DADI использует какие-либо условные обозначения, соглашения или стили в коде?\n\nДа. При отправке любого кода для включения в проект DADI придерживайтесь стандартов оформления кода DADI, информацию о которых можно найти в рекомендациях для желающих нести свой вклад для каждого приложения DADI.\n\nДля соблюдения последовательности в исходном коде при работе помните о следующих правилах:\n\n*   Пожалуйста, используйте отступ в два пробела, как в самом Node.JS\n*   Все функции и исправления ошибок должны быть протестированы один или более раз. Просмотрите наши тестовые наборы для примера\n*   Все общедоступные методы API должны быть задокументированы при помощи JSDoc\n\n### 4\\. Могу ли я изменить главные файлы DADI, чтобы внести изменения в мой сайт или приложение?\n\nМы настоятельно рекомендуем, чтобы вы этого не делали. Взлом ядра приведет к тому, что вы не сможете пользоваться преимуществами обновлений от DADI, включая любые обновления системы безопасности, без потери ваших изменений. Кроме того, это значительно снизит вероятность того, что ваши ошибки будут исправлены сообществом. Вместо этого используйте источники данных, события и крючки фреймворка в рамках отдельных приложений DADI.\n\n### 5\\. Где я могу получить помощь при работе с DADI?\n\nСвяжитесь с нами на Slack. Или напишите нам. Мы привлекаем внимание сообщества с помощью очереди задач на Git для каждого приложения."
        }
      ]
    }
  }
}