{
  "datasource": {
    "key": "how-we-work",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "intro": "At DADI+ we've ripped up everything we thought we knew about work and have started again, structuring the business around how we want to live.",
          "body": "My partners and I have been running businesses of various sizes for over fifteen years, from a two man operation to organisations with global scale and reach.\n\nDespite huge differences in scale and offering, the physical structures of work remained constant throughout. We had an office. We had a working day. We structured teams around disciplines. We had regular meetings. Basically everything that jumps to mind when you hear the word \"work\".\n\nThat's not to say that it wasn't fun. This is our office on the curtain road, in the early days of Airlock (look at the size of some of those monitors!) -\n\n![Our old office](/assets/how-we-work/airlock.jpg)\n\n...but we structured our lives around our work: pulling all nighters was common and interruptions to holiday a given.\n\nWhen we started DADI+ we decided to rip up everything we thought we knew about work. We started again from scratch, structuring everything around one core principle -\n\n**Work should fit around our lives, not the other way round.**\n\n## Dropping the office\n\nThe most obvious change for us was also the hardest: getting rid of our office.\n\nThere is an incredibly strong link between environment and work. If you spend your life \"leaving for work\", taking away a physical destination asks some serious questions about your definition and understanding of the very concept of work.\n\nWhich is of course exactly what we wanted to challenge.\n\nAt our last business we choose our offices based on finding the most equal commute for all of our staff. In practice this meant that the average trip into the office was a little over an hour. That's over a day a week spent commuting for every single person in the company: 300 hours a week lost to the underground and the pollution of central London.\n\nEven if you can't see the obvious human strain that this represents, consider it financially: 300 hours a week is time worth around £100,000 a month. That's not to say that this is time that would otherwise be worked, simply that the collective time lost to the commute can be staggering high.\n\nWe also noticed a trend that will be familiar to many: everyone wearing large headphones in an open plan office.\n\nTechnology started significantly and noticeably shifting the way that we work a decade or so ago. It is now common to use instant messaging to speak with the person two desks down from you, rather than actually talking to them. This along with the prevalence of headphones is a signifier of change in working practices; a move away from a traditional, synchronous method of work to one of asynchronicity.\n\nNot having a central office embraces this change. It enables us to work in entirely new ways, and has removed the traditional structures and politics that come with location-based working. For us, everything is asynchronous.\n\nThis change has also enabled us to think about hiring entirely differently. It is a false conceit to think that the best coders, designers and strategists live within an hour of central London. Not having an office means that we can look far and wide for the best possible talent.\n\nWe have team members who prefer a traditional working environment for whom we provide cover for the rental of a shared office space. We have team members who cafe hop. We have team members who have a home office (I'm sat in mine as I type). We have team members in London. We have team members outside of London. We have team members in different countries.\n\nAnd of course it is impossible to generalise about the time of day that we are at our most productive. A commute is an avoidable disruption, just like the time we choose to eat or whether or not we put on clothes. Giving individuals the freedom to organise their time according to their own productivity peaks and troughs avoids the breaking of a train of thought in order to jump on a train.\n\n### Extreme remoting\n\nThis is Jim -\n\n![Mr James Lambie](/assets/how-we-work/jim.jpg)\n\nHe's one of our Lead Developers. Tomorrow he leaves for the first day of a 15,000 mile - ! - bike ride that will take him all the way to New Zealand. He's starting in Brighton.\n\nWhile he'll be on the road for the majority of the time, he is staying on as part of our team, leading the development on some of our core underlying technologies. We like to think that he'll be cycling with one hand on the handlebars and one hand typing furiously on a laptop strapped to the side of his bike, but in reality he'll be contributing in fits and starts, working blocks of time from key cities en route, predominantly through the cold winter months.\n\nThis is an extreme example of what asynchronous working enables, but it proves the point. There is no way that this trip could have been accommodated at our last agency.\n\nYou can follow Jim's amazing journey on [agreatdistance.org](http://www.agreatdistance.org), which includes a wealth of data, from his current coordinates - useful if you want to wave him on! - to the distance he has travelled.\n\n## Meetings are still ███████ toxic\n\n37signals originated \"meetings are toxic\" in their book, [Getting Real](https://gettingreal.37signals.com/).\n\nMeetings are traditionally called when something needs hashing out. They tend to invite more people than necessary, reflect the hierarchy and politics within the organisation and usually last much longer than necessary.\n\nIn short, meetings kill productivity.\n\nIn technology it makes far more sense and is far more productive to just get on with it - to push a branch up, check out the diff, and then iterate on that diff rather than to assume that you're going to perfectly whiteboard a system architecture ahead of time.\n\nWhat is true of programming is true for every other aspect of business.\n\nEven if you take notes in a meeting, you can't capture everything. You make a judgement at a point in time as to what to write down. Then a week later you try to remember what wasn't written down as it becomes apparent that that portion of the discussion was more important.\n\nYou don't have this problem with chat transcripts. Forcing people to reduce their otherwise rambling thoughts into concrete sentences helps focus discussion.\n\nOf course we still have meetings at DADI+ from time to time, but they are the exception rather than the rule.\n\n### Rules to live by\n\n* Do not attend any meeting without an agenda\n* If a decision can be taken over phone or by chat, do so instead of arranging or attending a meeting\n* No meeting should be more than 30 minutes in length\n* Only the most important people should attend a meeting. Others can be informed by email\n* Never hold meetings to review output. Reviews should be handled offline first, with a meeting for discussion of the output only held where absolutely necessary\n\n## Working asynchronously\n\nA synchronous working style is one where some or all of the members of a team regularly stop what they’re doing, meet, discuss and agree on the next steps to take, before getting back to work implementing those steps. These synchronous \"join points\" are frequent, unavoidable, and built into the structure of the work.\n\nAn asynchronous working style is one where the entire team rarely, if ever, gets together for big agreements and discussions. Each individual team member more or less works on their own and at their own pace, with collaboration and agreement being handled by asynchronous mechanisms.\n\n![The future of work](/assets/how-we-work/working-asynchronously.png)\n\nAsynchronous working centres around shared artefacts, with each member of a team gradually accreting layers and complexity onto those artefacts. The most common example is commits to a source code repository. Another good example is online document sharing, with multiple editors and commenters. Team members usually have multiple related threads of work running simultaneously, so that if one is blocked on input from someone else, another thread can be picked up in order to maintain forward momentum.\n\nWorking asynchronously enables our team to be geographically distributed and to choose the hours that suit them the best.\n\nIn short it enables our team to put their lives first.\n\n## The right tools for the job\n\nOf course none of this would work without the right tools in support.\n\nAfter our staff, the most important aspect of how we work is the tools that we use on a daily basis. In the event that a particular tool doesn't work for us, we'll move on to something else. We think about this stuff frequently. Are we still working well together today, even though we are double the size we were six months ago?\n\nThe tools make the difference.\n\n### Slack\n\nSlack is probably most important tool in use at DADI+. It's a chat platform organised around public and private channels.\n\nSlack is asynchronous. Asynchronous communication means that I can step out for lunch and catch up on transcripts when I get back. It means that I can ask a colleague a question and not worry about bothering her, as she'll get back to me when she's available. Asynchronous communication means I can go to rural Somerset and work a normal day.\n\n![Slack](/assets/how-we-work/slack.png)\n\nFind out more: [slack.com](https://slack.com/)\n\n### Github\n\nGithub allows you to collaborate on anything. It's a version control system, but one that doesn't suck.\n\nWe predominantly use it for source code control, but are increasingly using it for everything else as well.\n\n![Github](/assets/how-we-work/github.png)\n\nLearn more: [github.com](https://github.com/)\n\n## The result of all this?\n\nWe are more productive than we ever have been. Startlingly so. And we are producing a standard of work way and above even our highest expectations. Change is good.\n\n## Join us\n\nInterested in shaking up your working life? We're hiring. [Find out more](/careers)."
        },
        {
          "lang": "de",
          "intro": "Alles was wir dachten über Arbeit zu wissen haben wir bei DADI über Bord geworfen und neu angefangen: Wir haben das Unternehmen so strukturiert, wie wir Leben möchten.",
          "body": "Meine Partner und ich haben seit 20 Jahren Unternehmen verschiedenster Größen geführt, von einer 2-Mann Firma bis hin zu Organisationen von weltweiter Reichweite.\n\nTrotz der großen Unterschiede bezüglich Größe und Angebote blieb die physikalische Struktur der Arbeit durchweg gleich. Wir hatten ein Büro. Wir hatten einen Arbeitstag. Wir haben unsere Teams nach Bereichen strukturiert. Wir hatten regelmäßige Meetings. Grundsätzlich alles, was Dir in den Sinn kommt, wenn Du an das Wort \"Arbeit\" denkst. \n\nAber das soll natürlich nicht bedeuten, dass wir keinen Spaß hatten. Dies ist unser Büro in der Curtain Road, in den Anfangstagen von Airlock (Schau Dir die Größe der Monitore an!) -\n\n![Our old office](/assets/how-we-work/airlock.jpg)\n\n… aber wir haben unsere Leben nach unserer Arbeit ausgerichtet: Nachtschichten waren Gang und Gäbe und Unterbrechungen des Urlaubs waren normal. \n\nAls wir DADI ins Leben gerufen, haben wir uns dafür entschieden, alles über Bord zu werden, was wir dachten über Arbeit zu wissen. Wir starteten von Grund auf neu, alles um ein Kernprinzip strukturiert: \n\n**Arbeit soll sich unserem Leben anpassen und nicht anders herum.**\n\n## Das Büro aufgeben\n\nDie offensichtlichste Änderung für uns war auch gleichzeitig die schwerste: Das Büro loswerden.\n\nEs gibt eine unglaublich starke Verbindung zwischen Umwelt und Arbeit. Wenn Du dein Leben damit verbringst \"zur Arbeit zu gehen\", bedeutet die Wegnahme des physischen Arbeitsplatzes das in Frage stellen der Definition und des Verständnisses von grundlegenden Konzepten der Arbeit. \n\nDies ist natürlich genau das, was wir erreichen wollten.\n\nIn unserem letzten Unternehmen suchten wir unsere Büros danach aus, eine ausgeglichene Pendelzeit für unsere Mitarbeiter zu ermöglichen. In der Praxis bedeutete dies, dass ein durchschnittlicher Weg ins Büro etwas mehr als eine Stunde dauerte. Das ist mehr als ein Tag pro Woche, der nur für das Pendeln von jeder Person in der Firma benötigt wird: 300 Stunden wöchentlichen gehen drauf für die U-Bahn und die Umweltverschmutzung in Londons Zentrum.\n\nSelbst wenn Du nicht die offensichtliche menschliche Belastung nachvollziehen kannst, die das bedeutet, schau dir die finanzielle Seite an: 300 Stunden pro Woche sind ungefähr £100.000 im Monat wert. Dies bedeutet nicht, dass dies Zeit ist, die unter anderen Umständen Arbeitszeit wäre, sondern nur, dass diese kollektive Zeit, die durch das Pendeln verloren geht, gigantisch hoch ist.\n\nAußerdem haben wir einen Trend festgestellt, der vielen bekannt vorkommen wird: Jeder trägt große Kopfhörer in einem Großraumbüro.\n\nTechnologie hat bereits vor einem Jahrzehnt die unsere Arbeitsweise verändert. Es ist inzwischen üblich einen Instant Messenger zu nutzen um mit der Person zu reden, die nur zwei Plätze weiter sitzt, statt richtig mit ihr zu reden. Zusammen mit der Verbreitung von Kopfhören ist dies ein Zeichen für eine Veränderung in Arbeitsabläufen; ein Schritt weg von traditionellen und synchronen Arbeitsmethoden hin zur Asynchronität.\n\nDie Abwesenheit eines zentralen Büros nimmt diese Veränderung auf. Dies erlaubt uns, auf neue Weise zu arbeiten und hat traditionelle Strukturen und Politik beseitigt, die mit einer ortsgebundenen Arbeit einhergeht. Für uns ist alles asynchron.\n\nDiese Veränderung hat uns auch zum Nachdenken darüber gebracht, dass wir anders Anstellen sollten. Es ist eine falsche Annahme, zu denken, dass die besten Coder, Designer und Strategen nur innerhalb von einer Stunde von Londons Zentrum entfernt leben. Kein Büro zu haben bedeutet auch, dass wir weiter entfernt nach den bestmöglichen Talenten Ausschau halten können. \n\nWir haben Teammitglieder, die eine traditionelle Arbeitsumgebung bevorzugen, für die wir die Miete eines gemeinschaftlichen Büroplatzen übernehmen. Wir haben Teammitglieder, die von einem Café zum Nächsten ziehen. Wir haben Teammitglieder, die ein Home Office haben (Ich sitze gerade in meinem, während ich das hier tippe). Wir haben Teammitglieder in London. Wir haben Teammitglieder in verschiedenen Bezirken - und verschiedenen Ländern. \n\nNatürlich ist es auch unmöglich zu generalisieren, zu welcher Tageszeit wir am produktivsten sind. Ein Arbeitsweg ist eine vermeidbare Unterbrechung, genauso wie wir die Zeit bestimmen, wann wir essen wollen oder ob wir überhaupt Kleidung anziehen. Den Menschen die Freiheit zu geben, ihre Zeit nach ihren eigenen Produktivitätshöhepunkten und -tiefpunkten zu organisieren, hilft dabei, das Unterbrechen von Gedankengängen zu vermeiden, um seine Bahn noch zu schaffen.\n\n## Extrem entfernt\n\nDas ist Jim:\n\n![Mr James Lambie](/assets/how-we-work/jim.jpg)\n\nEr ist einer unserer Technischen Leiter. 2014 begann er eine 15.000 Meilen Radtour von Brighton nach Neuseeland. \n\nEr war zwei Jahre lang unterwegs, aber er blieb ein Teil unseres Teams und führte die Entwicklung unserer Kerntechnologien. Wir stellen uns gerne vor, wie er Fahrrad fährt mit einer Hand am Lenker und mit der anderen tippt er wild auf einem Laptop herum, der an der Seite seines Fahrrads befestigt ist, aber in Wirklichkeit hat er sporadisch Arbeitsblöcke beigetragen in Zeiten, als er in größeren Städten entlang der Route verweilte.\n\nHier bringt er gerade den Release unseres Systems für Virgin zum Einsatz, auf einem Berg vor Teheran: \n\nUnd natürlich haben wir sein progressives Leben in Slack verfolgt: \n\nDies ist ein extremes Beispiel dafür, was asynchrones Arbeiten ermöglicht, aber es beschreibt es treffend. Es gäbe keine Möglichkeit für solch einen Trip in unserer alten Firma. \n\nDu kannst alles über Jims unglaubliche Reise auf [agreatdistance.org](http://www.agreatdistance.org/) nachlesen.\n\n## Meetings sind Gift\n\n37signals kreierten \"Meetings sind Gift\" in ihrem Buch, [Getting Real](https://gettingreal.37signals.com/).\n\nTraditionell werden Meetings einberufen, wenn etwas genau besprochen werden muss. Es werden meist mehr Leute eingeladen, als eigentlich nötig, sie reflektieren die Hierarchie und Politik im Unternehmen und für gewöhnlichen gehen sie länger als notwendig. \n\nIn Kürze, Meetings zerstören Produktivität.\n\nIn der Technologie ergibt es viel mehr Sinn und es ist auch viel produktiver, einfach weiterzumachen - den Zweig finden, die Schwierigkeit herausfinden, und dann die Schwierigkeit wiederholen anstatt anzunehmen, dass man die gesamte Systemarchitektur analysieren muss.\n\nWas für das Programmieren gilt, gilt auch für jeden anderen Bereich des Unternehmens. \n\nSelbst wenn Du Notizen in einem Meeting machst, kannst Du nicht alles aufnehmen. Du beurteilst in kürzester Zeit, was Du aufschreiben willst. Dann, eine Woche später, versuchst Du dich an die Teile des Meetings zu erinnern, die Du nicht aufgeschrieben hast, weil diese offensichtlich die Teile der Diskussion waren, die eher wichtig waren.\n\nDieses Problem hast Du nicht bei Chatprotokollen. Menschen zu zwingen, ihre anderweitig ausufernden Gedanken in konkrete Sätze zu packen, hilft dabei, die Diskussion zu fokussieren. \n\nNatürlich haben wir auch noch Meetings bei DADI von Zeit zu Zeit, aber sie sind eher die Ausnahme als die Regel. \"\n\n### Regeln, die Du einhalten solltest\n\n* Komme nicht ohne Agenda zum Meeting\n* Wenn eine Entscheidung per Telefon oder Chat gefällt werden kann, sollte lieber dies geschehen, als ein Meeting einzuberufen\n* Kein Meeting sollte länger als 30 Minuten sein\n* Nur die wichtigsten Personen sollen im Meeting anwesend sein. Die anderen können per Email informiert werden.\n* Niemals ein Meeting halten, um Leistung zu beurteilen. Beurteilungen sollten zuerst offline bearbeitet werden, ein Meeting zur Diskussion der Leistung sollte nur gehalten werden, wenn es wirklich nötig ist.\n\n## Asynchron Arbeiten\n\nEin synchroner Arbeitsstil ist ein Stil, bei dem alle oder einige Teammitglieder regelmäßig aufhören zu arbeiten, sich treffen, diskutieren und sich auf die nächsten Schritte einigen, bevor sie  zurück an ihre Arbeit gehen und diese Schritte umsetzen. Diese synchronen \"Verbindungspunkte\" sind häufig, unausweichlich und Teil der Arbeitsstruktur.\n\n![The future of work](/assets/how-we-work/working-asynchronously.png)\n\nEin asynchroner Arbeitsstil in ein Stil, bei dem das gesamte Team selten, wenn überhaupt, zusammenkommt und eine große Entscheidung fällt oder diskutiert. Jedes individuelle Teammitglied arbeitet mehr oder weniger auf sich allein gestellt und in der eigenen Geschwindigkeit, Zusammenarbeit und Zustimmung werden durch asynchrone Mechanismen bearbeitet. \n\nAsynchrone Arbeit zentriert sich auf gemeinsame Artefakte, bei denen jedes Mitglied des Teams Stück für Stück Ebenen und Komplexität hinzufügt. Das bekannteste Beispiel dafür ist die Mitarbeit an einem Quellcode Repository. Ein anderes gutes Beispiel ist das Teilen von Dokumenten online, bei denen verschiedene Benutzer mitarbeiten und kommentieren. Teammitglieder haben normalerweise verschiedene verbundene Arbeitsthemen, an denen sie gleichzeitig arbeiten: Wenn eines geblockt ist, weil jemand anderes daran arbeitet, kann ein anderes Themengebiet bearbeitet werden, um den Flow beizubehalten.\n\nAsynchrone Arbeit erlaubt unserem Team, geographisch verstreut zu sein und sich die Arbeitszeiten auszusuchen, die jedem am besten passen. \n\nKurz gesagt, es erlaubt unserem Team, ihr Leben an erster Stelle zu stellen.\n\n## Die richtigen Tools für den Job\n\nNatürlich würde das alles nicht funktionieren ohne die Unterstützung der richtigen Tools.\n\nNach unserer Belegschaft sind die Tools, die wir täglich nutzen, der wichtigste Aspekt unserer Arbeit. Falls mal ein bestimmtes Tool nicht für uns passt, wechseln wir auf ein anderes. Wir denken regelmäßig darüber nach. Arbeiten wir immernoch gut zusammen, obwohl wir schon doppelt so groß sind, als wir es noch vor sechs Monaten waren? \n\nDie Tools machen den Unterschied.\n\n### Slack\n\nSlack ist vermutlich das wichtigste Tool in Benutzung bei DADI. Es ist eine Chat Plattform, mit der man öffentlich oder auch privat chatten kann. \n\n![Slack](/assets/how-we-work/slack.png)\n\nSlack ist asynchron. Asynchrone Kommunikation bedeutet, dass ich Mittagspause machen kann und die Chatprotokolle später nachlesen kann. Das bedeutet, dass ich einem Kollegen eine Frage stellen kann und mich nicht darum scheren muss, ob ich sie störe, weil sie mir antworten wird, wenn sie verfügbar ist. Asynchrone Kommunikation bedeutet, dass ich tief in die Wälder von British Columbia gehen kann und einen normalen Arbeitstag haben kann. \n\nErfahre mehr: [slack.com](https://slack.com/)\n\n### Github\n\nGithub erlaubt es, bei allem zusammenzuarbeiten. Es ist ein Versionsverwaltungssystem , aber eines, das auch gut ist. \n\nWir nutzen es hauptsächlich zur Quellcodekontrolle, aber nutzen es auch immer häufiger für alles andere - einfaches Projektmanagement einbezogen.\n\n![Github](/assets/how-we-work/github.png)\n\nErfahre mehr: [github.com](https://github.com/)\n\n## Das Ergebnis des Ganzen?\n\nWir sind produktiver als wir es jemals waren. Erstaunlich, nicht wahr? Und wir kreieren einen Arbeitsstandard, der über unsere kühnsten Erwartungen hinausgeht. Veränderung ist gut. \n\n## Schließe dich uns an!\n\nBist Du interesiert, dein Arbeitsleben umzukrempeln? Wir stellen ein. [Erfahre mehr](/careers)."
        }
      ]
    }
  }
}