{
  "datasource": {
    "key": "how-we-work",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "intro": "At DADI+ we've ripped up everything we thought we knew about work and have started again, structuring the business around how we want to live.",
          "body": "My partners and I have been running businesses of various sizes for over fifteen years, from a two man operation to organisations with global scale and reach.\n\nDespite huge differences in scale and offering, the physical structures of work remained constant throughout. We had an office. We had a working day. We structured teams around disciplines. We had regular meetings. Basically everything that jumps to mind when you hear the word \"work\".\n\nThat's not to say that it wasn't fun. This is our office on the curtain road, in the early days of Airlock (look at the size of some of those monitors!) -\n\n![Our old office](/assets/how-we-work/airlock.jpg)\n\n...but we structured our lives around our work: pulling all nighters was common and interruptions to holiday a given.\n\nWhen we started DADI+ we decided to rip up everything we thought we knew about work. We started again from scratch, structuring everything around one core principle -\n\n**Work should fit around our lives, not the other way round.**\n\n## Dropping the office\n\nThe most obvious change for us was also the hardest: getting rid of our office.\n\nThere is an incredibly strong link between environment and work. If you spend your life \"leaving for work\", taking away a physical destination asks some serious questions about your definition and understanding of the very concept of work.\n\nWhich is of course exactly what we wanted to challenge.\n\nAt our last business we choose our offices based on finding the most equal commute for all of our staff. In practice this meant that the average trip into the office was a little over an hour. That's over a day a week spent commuting for every single person in the company: 300 hours a week lost to the underground and the pollution of central London.\n\nEven if you can't see the obvious human strain that this represents, consider it financially: 300 hours a week is time worth around £100,000 a month. That's not to say that this is time that would otherwise be worked, simply that the collective time lost to the commute can be staggering high.\n\nWe also noticed a trend that will be familiar to many: everyone wearing large headphones in an open plan office.\n\nTechnology started significantly and noticeably shifting the way that we work a decade or so ago. It is now common to use instant messaging to speak with the person two desks down from you, rather than actually talking to them. This along with the prevalence of headphones is a signifier of change in working practices; a move away from a traditional, synchronous method of work to one of asynchronicity.\n\nNot having a central office embraces this change. It enables us to work in entirely new ways, and has removed the traditional structures and politics that come with location-based working. For us, everything is asynchronous.\n\nThis change has also enabled us to think about hiring entirely differently. It is a false conceit to think that the best coders, designers and strategists live within an hour of central London. Not having an office means that we can look far and wide for the best possible talent.\n\nWe have team members who prefer a traditional working environment for whom we provide cover for the rental of a shared office space. We have team members who cafe hop. We have team members who have a home office (I'm sat in mine as I type). We have team members in London. We have team members outside of London. We have team members in different countries.\n\nAnd of course it is impossible to generalise about the time of day that we are at our most productive. A commute is an avoidable disruption, just like the time we choose to eat or whether or not we put on clothes. Giving individuals the freedom to organise their time according to their own productivity peaks and troughs avoids the breaking of a train of thought in order to jump on a train.\n\n### Extreme remoting\n\nThis is Jim -\n\n![Mr James Lambie](/assets/how-we-work/jim.jpg)\n\nHe's one of our Lead Developers. Tomorrow he leaves for the first day of a 15,000 mile - ! - bike ride that will take him all the way to New Zealand. He's starting in Brighton.\n\nWhile he'll be on the road for the majority of the time, he is staying on as part of our team, leading the development on some of our core underlying technologies. We like to think that he'll be cycling with one hand on the handlebars and one hand typing furiously on a laptop strapped to the side of his bike, but in reality he'll be contributing in fits and starts, working blocks of time from key cities en route, predominantly through the cold winter months.\n\nThis is an extreme example of what asynchronous working enables, but it proves the point. There is no way that this trip could have been accommodated at our last agency.\n\nYou can follow Jim's amazing journey on [agreatdistance.org](http://www.agreatdistance.org), which includes a wealth of data, from his current coordinates - useful if you want to wave him on! - to the distance he has travelled.\n\n## Meetings are still ███████ toxic\n\n37signals originated \"meetings are toxic\" in their book, [Getting Real](https://gettingreal.37signals.com/).\n\nMeetings are traditionally called when something needs hashing out. They tend to invite more people than necessary, reflect the hierarchy and politics within the organisation and usually last much longer than necessary.\n\nIn short, meetings kill productivity.\n\nIn technology it makes far more sense and is far more productive to just get on with it - to push a branch up, check out the diff, and then iterate on that diff rather than to assume that you're going to perfectly whiteboard a system architecture ahead of time.\n\nWhat is true of programming is true for every other aspect of business.\n\nEven if you take notes in a meeting, you can't capture everything. You make a judgement at a point in time as to what to write down. Then a week later you try to remember what wasn't written down as it becomes apparent that that portion of the discussion was more important.\n\nYou don't have this problem with chat transcripts. Forcing people to reduce their otherwise rambling thoughts into concrete sentences helps focus discussion.\n\nOf course we still have meetings at DADI+ from time to time, but they are the exception rather than the rule.\n\n### Rules to live by\n\n* Do not attend any meeting without an agenda\n* If a decision can be taken over phone or by chat, do so instead of arranging or attending a meeting\n* No meeting should be more than 30 minutes in length\n* Only the most important people should attend a meeting. Others can be informed by email\n* Never hold meetings to review output. Reviews should be handled offline first, with a meeting for discussion of the output only held where absolutely necessary\n\n## Working asynchronously\n\nA synchronous working style is one where some or all of the members of a team regularly stop what they’re doing, meet, discuss and agree on the next steps to take, before getting back to work implementing those steps. These synchronous \"join points\" are frequent, unavoidable, and built into the structure of the work.\n\nAn asynchronous working style is one where the entire team rarely, if ever, gets together for big agreements and discussions. Each individual team member more or less works on their own and at their own pace, with collaboration and agreement being handled by asynchronous mechanisms.\n\n![The future of work](/assets/how-we-work/working-asynchronously.png)\n\nAsynchronous working centres around shared artefacts, with each member of a team gradually accreting layers and complexity onto those artefacts. The most common example is commits to a source code repository. Another good example is online document sharing, with multiple editors and commenters. Team members usually have multiple related threads of work running simultaneously, so that if one is blocked on input from someone else, another thread can be picked up in order to maintain forward momentum.\n\nWorking asynchronously enables our team to be geographically distributed and to choose the hours that suit them the best.\n\nIn short it enables our team to put their lives first.\n\n## The right tools for the job\n\nOf course none of this would work without the right tools in support.\n\nAfter our staff, the most important aspect of how we work is the tools that we use on a daily basis. In the event that a particular tool doesn't work for us, we'll move on to something else. We think about this stuff frequently. Are we still working well together today, even though we are double the size we were six months ago?\n\nThe tools make the difference.\n\n### Slack\n\nSlack is probably most important tool in use at DADI+. It's a chat platform organised around public and private channels.\n\nSlack is asynchronous. Asynchronous communication means that I can step out for lunch and catch up on transcripts when I get back. It means that I can ask a colleague a question and not worry about bothering her, as she'll get back to me when she's available. Asynchronous communication means I can go to rural Somerset and work a normal day.\n\n![Slack](/assets/how-we-work/slack.png)\n\nFind out more: [slack.com](https://slack.com/)\n\n### Github\n\nGithub allows you to collaborate on anything. It's a version control system, but one that doesn't suck.\n\nWe predominantly use it for source code control, but are increasingly using it for everything else as well.\n\n![Github](/assets/how-we-work/github.png)\n\nLearn more: [github.com](https://github.com/)\n\n## The result of all this?\n\nWe are more productive than we ever have been. Startlingly so. And we are producing a standard of work way and above even our highest expectations. Change is good.\n\n## Join us\n\nInterested in shaking up your working life? We're hiring. [Find out more](/careers)."
        },
        {
          "lang": "de",
          "intro": "Alles was wir dachten über Arbeit zu wissen haben wir bei DADI über Bord geworfen und neu angefangen: Wir haben das Unternehmen so strukturiert, wie wir Leben möchten.",
          "body": "Meine Partner und ich haben seit 20 Jahren Unternehmen verschiedenster Größen geführt, von einer 2-Mann Firma bis hin zu Organisationen von weltweiter Reichweite.\n\nTrotz der großen Unterschiede bezüglich Größe und Angebote blieb die physikalische Struktur der Arbeit durchweg gleich. Wir hatten ein Büro. Wir hatten einen Arbeitstag. Wir haben unsere Teams nach Bereichen strukturiert. Wir hatten regelmäßige Meetings. Grundsätzlich alles, was Dir in den Sinn kommt, wenn Du an das Wort \"Arbeit\" denkst. \n\nAber das soll natürlich nicht bedeuten, dass wir keinen Spaß hatten. Dies ist unser Büro in der Curtain Road, in den Anfangstagen von Airlock (Schau Dir die Größe der Monitore an!) -\n\n![Our old office](/assets/how-we-work/airlock.jpg)\n\n… aber wir haben unsere Leben nach unserer Arbeit ausgerichtet: Nachtschichten waren Gang und Gäbe und Unterbrechungen des Urlaubs waren normal. \n\nAls wir DADI ins Leben gerufen, haben wir uns dafür entschieden, alles über Bord zu werden, was wir dachten über Arbeit zu wissen. Wir starteten von Grund auf neu, alles um ein Kernprinzip strukturiert: \n\n**Arbeit soll sich unserem Leben anpassen und nicht anders herum.**\n\n## Das Büro aufgeben\n\nDie offensichtlichste Änderung für uns war auch gleichzeitig die schwerste: Das Büro loswerden.\n\nEs gibt eine unglaublich starke Verbindung zwischen Umwelt und Arbeit. Wenn Du dein Leben damit verbringst \"zur Arbeit zu gehen\", bedeutet die Wegnahme des physischen Arbeitsplatzes das in Frage stellen der Definition und des Verständnisses von grundlegenden Konzepten der Arbeit. \n\nDies ist natürlich genau das, was wir erreichen wollten.\n\nIn unserem letzten Unternehmen suchten wir unsere Büros danach aus, eine ausgeglichene Pendelzeit für unsere Mitarbeiter zu ermöglichen. In der Praxis bedeutete dies, dass ein durchschnittlicher Weg ins Büro etwas mehr als eine Stunde dauerte. Das ist mehr als ein Tag pro Woche, der nur für das Pendeln von jeder Person in der Firma benötigt wird: 300 Stunden wöchentlichen gehen drauf für die U-Bahn und die Umweltverschmutzung in Londons Zentrum.\n\nSelbst wenn Du nicht die offensichtliche menschliche Belastung nachvollziehen kannst, die das bedeutet, schau dir die finanzielle Seite an: 300 Stunden pro Woche sind ungefähr £100.000 im Monat wert. Dies bedeutet nicht, dass dies Zeit ist, die unter anderen Umständen Arbeitszeit wäre, sondern nur, dass diese kollektive Zeit, die durch das Pendeln verloren geht, gigantisch hoch ist.\n\nAußerdem haben wir einen Trend festgestellt, der vielen bekannt vorkommen wird: Jeder trägt große Kopfhörer in einem Großraumbüro.\n\nTechnologie hat bereits vor einem Jahrzehnt die unsere Arbeitsweise verändert. Es ist inzwischen üblich einen Instant Messenger zu nutzen um mit der Person zu reden, die nur zwei Plätze weiter sitzt, statt richtig mit ihr zu reden. Zusammen mit der Verbreitung von Kopfhören ist dies ein Zeichen für eine Veränderung in Arbeitsabläufen; ein Schritt weg von traditionellen und synchronen Arbeitsmethoden hin zur Asynchronität.\n\nDie Abwesenheit eines zentralen Büros nimmt diese Veränderung auf. Dies erlaubt uns, auf neue Weise zu arbeiten und hat traditionelle Strukturen und Politik beseitigt, die mit einer ortsgebundenen Arbeit einhergeht. Für uns ist alles asynchron.\n\nDiese Veränderung hat uns auch zum Nachdenken darüber gebracht, dass wir anders Anstellen sollten. Es ist eine falsche Annahme, zu denken, dass die besten Coder, Designer und Strategen nur innerhalb von einer Stunde von Londons Zentrum entfernt leben. Kein Büro zu haben bedeutet auch, dass wir weiter entfernt nach den bestmöglichen Talenten Ausschau halten können. \n\nWir haben Teammitglieder, die eine traditionelle Arbeitsumgebung bevorzugen, für die wir die Miete eines gemeinschaftlichen Büroplatzen übernehmen. Wir haben Teammitglieder, die von einem Café zum Nächsten ziehen. Wir haben Teammitglieder, die ein Home Office haben (Ich sitze gerade in meinem, während ich das hier tippe). Wir haben Teammitglieder in London. Wir haben Teammitglieder in verschiedenen Bezirken - und verschiedenen Ländern. \n\nNatürlich ist es auch unmöglich zu generalisieren, zu welcher Tageszeit wir am produktivsten sind. Ein Arbeitsweg ist eine vermeidbare Unterbrechung, genauso wie wir die Zeit bestimmen, wann wir essen wollen oder ob wir überhaupt Kleidung anziehen. Den Menschen die Freiheit zu geben, ihre Zeit nach ihren eigenen Produktivitätshöhepunkten und -tiefpunkten zu organisieren, hilft dabei, das Unterbrechen von Gedankengängen zu vermeiden, um seine Bahn noch zu schaffen.\n\n## Extrem entfernt\n\nDas ist Jim:\n\n![Mr James Lambie](/assets/how-we-work/jim.jpg)\n\nEr ist einer unserer Technischen Leiter. 2014 begann er eine 15.000 Meilen Radtour von Brighton nach Neuseeland. \n\nEr war zwei Jahre lang unterwegs, aber er blieb ein Teil unseres Teams und führte die Entwicklung unserer Kerntechnologien. Wir stellen uns gerne vor, wie er Fahrrad fährt mit einer Hand am Lenker und mit der anderen tippt er wild auf einem Laptop herum, der an der Seite seines Fahrrads befestigt ist, aber in Wirklichkeit hat er sporadisch Arbeitsblöcke beigetragen in Zeiten, als er in größeren Städten entlang der Route verweilte.\n\nHier bringt er gerade den Release unseres Systems für Virgin zum Einsatz, auf einem Berg vor Teheran: \n\nUnd natürlich haben wir sein progressives Leben in Slack verfolgt: \n\nDies ist ein extremes Beispiel dafür, was asynchrones Arbeiten ermöglicht, aber es beschreibt es treffend. Es gäbe keine Möglichkeit für solch einen Trip in unserer alten Firma. \n\nDu kannst alles über Jims unglaubliche Reise auf [agreatdistance.org](http://www.agreatdistance.org/) nachlesen.\n\n## Meetings sind Gift\n\n37signals kreierten \"Meetings sind Gift\" in ihrem Buch, [Getting Real](https://gettingreal.37signals.com/).\n\nTraditionell werden Meetings einberufen, wenn etwas genau besprochen werden muss. Es werden meist mehr Leute eingeladen, als eigentlich nötig, sie reflektieren die Hierarchie und Politik im Unternehmen und für gewöhnlichen gehen sie länger als notwendig. \n\nIn Kürze, Meetings zerstören Produktivität.\n\nIn der Technologie ergibt es viel mehr Sinn und es ist auch viel produktiver, einfach weiterzumachen - den Zweig finden, die Schwierigkeit herausfinden, und dann die Schwierigkeit wiederholen anstatt anzunehmen, dass man die gesamte Systemarchitektur analysieren muss.\n\nWas für das Programmieren gilt, gilt auch für jeden anderen Bereich des Unternehmens. \n\nSelbst wenn Du Notizen in einem Meeting machst, kannst Du nicht alles aufnehmen. Du beurteilst in kürzester Zeit, was Du aufschreiben willst. Dann, eine Woche später, versuchst Du dich an die Teile des Meetings zu erinnern, die Du nicht aufgeschrieben hast, weil diese offensichtlich die Teile der Diskussion waren, die eher wichtig waren.\n\nDieses Problem hast Du nicht bei Chatprotokollen. Menschen zu zwingen, ihre anderweitig ausufernden Gedanken in konkrete Sätze zu packen, hilft dabei, die Diskussion zu fokussieren. \n\nNatürlich haben wir auch noch Meetings bei DADI von Zeit zu Zeit, aber sie sind eher die Ausnahme als die Regel. \"\n\n### Regeln, die Du einhalten solltest\n\n* Komme nicht ohne Agenda zum Meeting\n* Wenn eine Entscheidung per Telefon oder Chat gefällt werden kann, sollte lieber dies geschehen, als ein Meeting einzuberufen\n* Kein Meeting sollte länger als 30 Minuten sein\n* Nur die wichtigsten Personen sollen im Meeting anwesend sein. Die anderen können per Email informiert werden.\n* Niemals ein Meeting halten, um Leistung zu beurteilen. Beurteilungen sollten zuerst offline bearbeitet werden, ein Meeting zur Diskussion der Leistung sollte nur gehalten werden, wenn es wirklich nötig ist.\n\n## Asynchron Arbeiten\n\nEin synchroner Arbeitsstil ist ein Stil, bei dem alle oder einige Teammitglieder regelmäßig aufhören zu arbeiten, sich treffen, diskutieren und sich auf die nächsten Schritte einigen, bevor sie  zurück an ihre Arbeit gehen und diese Schritte umsetzen. Diese synchronen \"Verbindungspunkte\" sind häufig, unausweichlich und Teil der Arbeitsstruktur.\n\n![The future of work](/assets/how-we-work/working-asynchronously.png)\n\nEin asynchroner Arbeitsstil in ein Stil, bei dem das gesamte Team selten, wenn überhaupt, zusammenkommt und eine große Entscheidung fällt oder diskutiert. Jedes individuelle Teammitglied arbeitet mehr oder weniger auf sich allein gestellt und in der eigenen Geschwindigkeit, Zusammenarbeit und Zustimmung werden durch asynchrone Mechanismen bearbeitet. \n\nAsynchrone Arbeit zentriert sich auf gemeinsame Artefakte, bei denen jedes Mitglied des Teams Stück für Stück Ebenen und Komplexität hinzufügt. Das bekannteste Beispiel dafür ist die Mitarbeit an einem Quellcode Repository. Ein anderes gutes Beispiel ist das Teilen von Dokumenten online, bei denen verschiedene Benutzer mitarbeiten und kommentieren. Teammitglieder haben normalerweise verschiedene verbundene Arbeitsthemen, an denen sie gleichzeitig arbeiten: Wenn eines geblockt ist, weil jemand anderes daran arbeitet, kann ein anderes Themengebiet bearbeitet werden, um den Flow beizubehalten.\n\nAsynchrone Arbeit erlaubt unserem Team, geographisch verstreut zu sein und sich die Arbeitszeiten auszusuchen, die jedem am besten passen. \n\nKurz gesagt, es erlaubt unserem Team, ihr Leben an erster Stelle zu stellen.\n\n## Die richtigen Tools für den Job\n\nNatürlich würde das alles nicht funktionieren ohne die Unterstützung der richtigen Tools.\n\nNach unserer Belegschaft sind die Tools, die wir täglich nutzen, der wichtigste Aspekt unserer Arbeit. Falls mal ein bestimmtes Tool nicht für uns passt, wechseln wir auf ein anderes. Wir denken regelmäßig darüber nach. Arbeiten wir immernoch gut zusammen, obwohl wir schon doppelt so groß sind, als wir es noch vor sechs Monaten waren? \n\nDie Tools machen den Unterschied.\n\n### Slack\n\nSlack ist vermutlich das wichtigste Tool in Benutzung bei DADI. Es ist eine Chat Plattform, mit der man öffentlich oder auch privat chatten kann. \n\n![Slack](/assets/how-we-work/slack.png)\n\nSlack ist asynchron. Asynchrone Kommunikation bedeutet, dass ich Mittagspause machen kann und die Chatprotokolle später nachlesen kann. Das bedeutet, dass ich einem Kollegen eine Frage stellen kann und mich nicht darum scheren muss, ob ich sie störe, weil sie mir antworten wird, wenn sie verfügbar ist. Asynchrone Kommunikation bedeutet, dass ich tief in die Wälder von British Columbia gehen kann und einen normalen Arbeitstag haben kann. \n\nErfahre mehr: [slack.com](https://slack.com/)\n\n### Github\n\nGithub erlaubt es, bei allem zusammenzuarbeiten. Es ist ein Versionsverwaltungssystem , aber eines, das auch gut ist. \n\nWir nutzen es hauptsächlich zur Quellcodekontrolle, aber nutzen es auch immer häufiger für alles andere - einfaches Projektmanagement einbezogen.\n\n![Github](/assets/how-we-work/github.png)\n\nErfahre mehr: [github.com](https://github.com/)\n\n## Das Ergebnis des Ganzen?\n\nWir sind produktiver als wir es jemals waren. Erstaunlich, nicht wahr? Und wir kreieren einen Arbeitsstandard, der über unsere kühnsten Erwartungen hinausgeht. Veränderung ist gut. \n\n## Schließe dich uns an!\n\nBist Du interesiert, dein Arbeitsleben umzukrempeln? Wir stellen ein. [Erfahre mehr](/careers)."
        },
        {
          "lang": "jp",
          "intro": "",
          "body": "私はパートナーたちと15年以上の間、2人での運営からグローバルな規模と拡がりを持った組織まで、大小さまざまな会社を運営してきました。\n\n規模と扱う製品・サービスは大きく異なりますが、物理的な仕事の構造は常に一定でした。オフィスがありました。営業日がありました。規則をもとにチームを構成していました。定期的な会議もありました。基本的に「仕事」という言葉を聞いたときに思い浮かぶあらゆることです。\n\n楽しくなかったと言いたいわけではありません。これはカーテンロード沿いにあるオフィスで、Airlock社の初期の頃の写真です。（一部のモニターはすごいサイズですね!）-\n\n![以前のオフィス](/assets/how-we-work/airlock.jpg)\n\nですが、私たちは仕事中心の生活を作り上げていました。徹夜は日常的で、休日に突然仕事が入ることも当たり前でした。\n\nDADI+を立ち上げた時、仕事について私たちが常識だと考えていたことすべてを捨て去ろうと決めました。白紙の状態からもう一度始め、あるコア原則を中心にすべてを作り上げていきました-\n\n**仕事に生活を合わせるのではなく、生活に仕事を合わせる。**\n\n## オフィスをなくす\n\n私たちにとってもっとも明らかな変化は同時にもっとも難しいものでした。それはオフィスをなくすことです。\n\n環境と仕事には非常に強い関係があります。人生においてずっと「仕事に行く」ということをしていると、物理的な行き先を失ったとき、仕事の概念そのものに対する自分なりの定義と理解に大きな疑問を抱くことになります。\n\nそして、それこそがまさに私たちが挑戦したかったことでした。\n\n現在の1つ前の会社ではスタッフの通勤時間がもっともフェアになるという観点からオフィスを選んでいました。実際にはオフィスにたどり着くまでの平均通勤時間は1時間を少し超えていました。従業員ひとりひとりが週に1日分以上の時間を通勤に充てていたことになります。1週間に300時間も地下鉄に乗り、ロンドン中心部の汚染の中を通勤するために使っていたということです。\n\nこの事実が示す明らかなスタッフの負担が感じられなくとも、経済的には考えることはできると思います。1週間に300時間というのはおよそ月100,000ポンド相当です。この時間を使って働くことができたと言いたいわけではなく、単純に通勤による時間のロスの合計が驚くほど大きいということです。\n\nまた、私たちは多くの人にとってもなじみがあるであろう、ある傾向に気付きました。オープンプランオフィスで働いている人々はみな大きなヘッドフォンをつけているということです。\n\nテクノロジーが大いに発展し始め、10年ほど前から見て明らかに私たちの働き方を変えています。今では2つ隣の席の同僚に直接話しかけるのではなく、インスタントメッセージで会話するのが当たり前になっています。それとともにヘッドフォンの普及は、伝統的で同期的な仕事の仕方から非同期的なものに移り変わっていることを示すものです。\n\n本社を持たないことはこの変化を受け入れたものです。これによって私たちはまったく新しい仕事の進め方が可能になり、場所を基準とした働き方による伝統的な構造や政治を排除できました。私たちにとってはあらゆるものが非同期的です。\n\nこの変化によって私たちは採用についてもまったく異なる考え方ができるようになりました。もっとも優秀なコーダー、デザイナー、ストラテジストがロンドン中心部から1時間圏内に住んでいると思っているのであれば、それは誤った考えです。オフィスがないということは、最高の才能を求めて遠く、幅広く目を向けることができるということです。\n\n伝統的な仕事環境を好むスタッフにはシェアオフィススペースの費用を私たちが負担しています。カフェ巡りをするスタッフもいます。ホームオフィスで働くスタッフもいます（今わたしは自分のホームオフィスでこれを打っています）。ロンドンにもいます。そしてロンドン以外にもいます。さらに国外にもいます。\n\nまた、1日のうちもっとも生産性の高い時間帯を一般化することはもちろん不可能です。食事をとる時間、あるいは服を着るかどうか判断する時間のように、通勤は時間の中断のうち避けられる部類のものです。個々人の生産性のピークや食事のタイミングにもとづいた時間の使い方の自由を与えることで、電車に飛び乗らなければいけないからと一連の思考を中断することを避けることができます。\n\n### 極端なリモートワーク\n\nこの方はジムといいます-\n\n![ジェームズ・ランビー氏](/assets/how-we-work/jim.jpg)\n\n彼は主任開発者の1人です。そして明日は15,000マイル (!) の自転車の旅の初日で最終的にはニュージーランドまで行く予定です。ブライトンから出発します。\n\n大部分の時間は路上にいることになるでしょうが、チームの一員として残り、当社の核となる基盤技術の開発の指揮をとります。自転車をこぎながら、片手はハンドル、そしてもう片手では自転車の側面に装着されたノートパソコンに猛烈な勢いでタイピングしている姿を想像してしまいますが、実際には都市間の移動途中の一定時間、そして大部分は冬の寒い時期に働くといった断続的に貢献してもらいます。\n\nこれは非同期的な働き方によって可能となった極端な例ですが、述べてきたことの証明になるのではないかと思います。私たちの1つ前の会社ではこの旅行を受け入れることは到底できなかったでしょう。\n\nジムの驚くべき旅は [agreatdistance.org](http://www.agreatdistance.org) で確認することができ、彼の現在地座標からこれまでの走行距離といったさまざまなデータが掲載されており、彼を応援したい場合に役立ちます! \n\n## 会議は有害\n\n37Signalsは著書[Getting Real](https://gettingreal.37signals.com/)の中で「会議は有害」という内容を創案しています。\n\n会議はあることに対して詳細な議論が必要な場合に開催されます。しかし必要以上に人を集め、組織の階層と政治が反映され、大体において必要以上に長い時間がかかります。\n\n簡単に言うと、会議は生産性を下げます。\n\nテクノロジーの分野ではどんどん進めてしまう方がよほど理にかなっており、ずっと生産的です。事前にシステム設計を完璧にホワイトボードに書き出すことを前提とせず、ブランチをプッシュし、差分を確認し、その差分上でイテレーションを行ったほうが良いでしょう。\n\nプログラミングをする上での正解は、他のあらゆるビジネスの側面でも正解といえます。\n\n会議でメモをとっても、すべてを書き留めることはできません。それぞれの時点で何を書き留めるのか判断します。そして1週間後、書き留めなかった会議の一幕こそが重要であったことが明らかになり、それを思い出そうとするわけです。\n\nチャットの記録ではこの問題は生じません。それぞれのまとまり切らない長ったらしい考えを、具体的な文章として短く落とし込むことは議論への集中を助けます。\n\nDADI+では今でも時々会議を開きますが、それはルールではなく例外です。\n\n### 従うべきルール\n\n* アジェンダのない会議には出席しない\n* 電話またはチャットで意思決定ができるのであればそうして、会議を調整したり出席しない。\n* どのような会議も30分以内に終える\n* もっとも重要な人物だけが会議に参加する。他の人には電子メールで知らせる\n* アウトプットのレビューのための会議は開かない。レビューはオフラインでまず行い、絶対に必要な場合のみアウトプットを議論するために会議を開催する\n\n## 非同期的に働く\n\n同期的な働き方では日常的にメンバーの一部、あるいは全員が作業を中断し、集まり、次のステップを議論・決定し、その後戻って決定したステップを実行に移します。こういった同期的な「集合ポイント」は頻繁、不可避で仕事の構造の中に組み込まれています。\n\nそれに対して非同期的な働き方では、そのような機会があればですが、チームはごくまれに大きな合意や議論の為に集まります。それぞれのチームメンバーは程度の差はあれど、非同期的なメカニズムで管理されたコラボレーションと合意の中で、個々に、そして自分のペースで働きます。\n\n![働き方の未来](/assets/how-we-work/working-asynchronously.png)\n\n非同期的な働き方は共有されたアーティファクトを軸とし、それぞれのチームメンバーが徐々にレイヤーと複雑性をアーティファクトに融合させていきます。もっとも一般的な例はソースコードレポジトリーへのコミットです。また、複数の編集者と評者によるオンラインのドキュメント共有も良い例です。チームメンバーは通常複数の関連した仕事を同時並行で進めており、そのうち1つが他者が原因で滞っても、別の仕事に取り組んで仕事の推進力を維持することができます。\n\n非同期的な働き方によって当社のチームの地理的な分散と最適な時間の選択を可能にします。\n\n単にいえばチームが生活を第一に置くことを可能にします。\n\n## 仕事に適したツール\n\nちろん適切なツールの支援がなければこれらは実現できません。\n\n私たちの働き方の側面としてもっとも重要なもののうち、スタッフの次に来るのが日々利用しているツールです。あるツールが私たちにとって機能しなくなった時、別のものに切り替えていきます。こういったことをよく検討しています。半年前と比較して2倍の規模になったが、今も私たちは全体としてうまく働けているだろうか?\n\nツールが違いを生み出します。\n\n### Slack\n\nDADI+で使っているツールの中でおそらくもっとも重要なのがSlackです。これはパブリックとプライベートチャネルを中心として作られたチャットプラットフォームです。\n\nSlackは非同期的です。非同期的なコミュニケーションとは、例えば昼食に出て、戻った時に記録をたどって話に追いつけるということを意味します。また、同僚を邪魔する心配なく質問ができるということです。手が空いたときに回答してもらえばいいわけですから。非同期的なコミュニケーションとはサマセットの田舎町にいって、そこで通常通りに働けることを意味します。\n\n![Slack](/assets/how-we-work/slack.png)\n\n詳細はこちら: [slack.com](https://slack.com/)\n\n### Github\n\nGithubを使えばあらゆることでコラボレーションが可能になります。バージョン管理システムですが、よくある使えないものではありません。\n\nたちは主にソースコード管理の為に用いていますが、他への適用も増やしています。\n\n![Github](/assets/how-we-work/github.png)\n\n詳細はこちら: [github.com](https://github.com/)\n\n## これらの取り組みの結果は?\n\n私たちは今までになく生産性が高まりました。驚くほどにです。そして仕事の質に関しても、想定していた最大の要求値をはるかに上回る成果を出しています。変化していくのは素晴らしいことです。\n\n## 当社で働きませんか\n\nあなたの仕事生活を一新しませんか。現在採用中です。[詳細はこちら](/careers)."
        },
        {
          "lang": "fr",
          "intro": "",
          "body": "Mes partenaires et moi gérons des entreprises de différentes tailles depuis plus de 15 ans, d'une exploitation de deux personnes à des organisations d'une portée mondiale.\n\nMalgré d'énormes différences d'échelle et d'offre, les structures physiques du travail sont demeurées constantes tout du long. Nous avions un bureau. Nous avions une journée de travail. Nous structurions des équipes autour des disciplines. Nous avions des réunions régulières. En gros, tout ce qui saute à l'esprit lorsque l'on entend le mot « travail ».\n\nCela ne veut pas dire que ce n'était pas amusant. Ce sont nos bureaux sur la tringle à rideaux, au début d'Airlock (regardez la taille de certains de ces moniteurs !) -\n\n![Nos anciens bureaux](/assets/how-we-work/airlock.jpg)\n\n... mais nous structurions nos vies autour de notre travail : les nuits blanches étaient fréquentes et les interruptions pour les vacances n'étaient pas acquises.\n\nLorsque nous avons démarré DADI+, nous avons décidé de déconstruire tout ce que nous pensions savoir à propos du travail. Nous avons recommencé à partir de zéro, en structurant tout autour d'un principe de base -\n\n**Le travail doit s'adapter à nos vies, et non l'inverse.**\n\n## Abandonner les bureaux\n\nLe changement le plus évident pour nous a été également le plus difficile : se passer de nos bureaux.\n\nIl y a un lien incroyablement fort entre l'environnement et le travail. Si vous passez votre vie à « vivre pour le travail », le fait de retirer une destination physique pose de sérieuses questions sur votre définition et votre compréhension de la notion même de travail.\n\nEt c'est bien sûr exactement ce que nous voulions remettre en cause.\n\nDans notre dernière entreprise, nous avions choisi nos bureaux en cherchant à trouver le trajet le plus équitable pour tout notre personnel. En pratique, cela signifiait que le trajet moyen vers le bureau était d'un peu plus d'une heure. C'est plus d'une journée par semaine de trajet pour chaque personne de l'entreprise : 300 heures par semaine perdues dans le métro et la pollution du centre de Londres.\n\nMême si vous n'arrivez pas à voir la tension humaine évidente que cela représente, considérez cela sur le plan financier : 300 heures de temps par semaine valent environ 100 000 £ par mois. Cela ne veut pas dire qu'autrement ce serait du temps de travail, c'est simplement que le temps collectivement perdu dans les trajets peut être faramineux.\n\nNous avons également remarqué une tendance bien connue de beaucoup de gens : le fait que tout le monde porte un gros casque dans un bureau à espace décloisonné.\n\nIl y a environ une déccennie, la technologie a commencé à changer, de manière significative et considérable, la façon dont nous travaillons. Il est maintenant courant d'utiliser une messagerie instantanée pour discuter avec la personne à deux bureaux de vous, plutôt que de lui parler directement. Cela en plus de la prévalence du casque est signe d'un changement dans les pratiques de travail ; un pas d'un mode de travail traditionnel et synchrone vers un mode asynchrone.\n\nLe fait de ne pas avoir de bureaux centraux répond à ce changement. Cela nous permet de travailler d'une façon totalement nouvelle, et a permis de supprimer les structures et les règles traditionnelles qui accompagnent le travail dans un lieu déterminé. Pour nous, tout est asynchrone.\n\nCe changement nous a également permis d'envisager le recrutement de manière totalement différente. C'est une fausse idée de penser que les meilleurs codeurs, concepteurs et stratèges vivent à moins d'une heure du centre de Londres. Le fait de ne pas avoir de bureaux signifie que nous pouvons rechercher les meilleurs talents possibles partout.\n\nCertains membres de notre équipe préfèrent un environnement de travail traditionnel. Nous louons pour eux un espace de bureaux partagé. Certains membres de notre équipe passent d'un café à l'autre. Certains membres de notre équipe ont un bureau à domicile (je suis assis dans le mien pendant que je tape ce texte). Certains membres de notre équipe sont à Londres. Certains membres de notre équipe sont à l'extérieur de la ville de Londres. Nous avons des membres de l'équipe dans différents pays.\n\nEt bien sûr, il est impossible de généraliser sur l'heure de la journée à laquelle nous sommes le plus productif. Un déplacement est une perturbation évitable, tout comme l'heure à laquelle nous choisissons de manger ou le fait de mettre des vêtements ou pas. Le fait de donner aux individus la liberté d'organiser leur temps selon leurs propres pics et creux de productivité évite de perdre le fil des idées.\n\n### Distance extrême\n\nVoici Jim -\n\n![M. James Lambie](/assets/how-we-work/jim.jpg)\n\nIl est l'un de nos principaux développeurs. Demain, il part pour un parcours à vélo de 15 000 miles qui le conduira jusqu'en Nouvelle-Zélande. Il part de Brighton.\n\nAlors qu'il sera sur la route la plupart du temps, il reste membre de notre équipe, dirigeant le développement de certaines de nos principales technologies sous-jacentes. Nous nous plaisons à penser qu'il fera du vélo avec une main sur le guidon et qu'il tapera violemment, de l'autre main, sur un ordinateur portable fixé sur le côté de son vélo, mais en réalité, il contribuera par intermittence, en travaillant pendant des périodes de temps depuis des villes clés en chemin, principalement pendant les froids mois d'hiver.\n\nC'est un exemple extrême de ce que le travail asynchrone permet, mais cela l'illustre. Ce voyage n'aurait en aucune manière été posible dans notre agence précédente.\n\nVous pouvez suivre le voyage incroyable de Jim sur [agreatdistance.org](http://www.agreatdistance.org), qui contient une foule de données, de ses coordonnées actuelles, utiles si vous voulez lui faire un coucou, à la distance qu'il a parcourue.\n\n## Les réunions sont toujours ███████ toxiques\n\n37signals a créé « Les réunions sont toxiques » dans son livre, [Getting Real](https://gettingreal.37signals.com/).\n\nTraditionnellement, l'on organise des réunions quand quelque chose doit être réglé. Elles ont tendance à réunir plus de personnes que nécessaire, à être le reflet de la hiérarchie et de la politique au sein de l'organisation et elles durent généralement beaucoup plus longtemps que nécessaire.\n\nBref, les réunions tuent la productivité.\n\nDans le domaine de la technologie, il est beaucoup plus logique et beaucoup plus productif de simplement s'y mettre, tester, vérifier la différence, puis itérer sur cette différence plutôt que de penser que vous allez créer parfaitement une architecture système à l'avance.\n\nCe qui est vrai au sujet de la programmation est vrai pour tous les autres aspects de l'entreprise.\n\nMême si vous prenez des notes lors d'une réunion, vous ne pouvez pas tout saisir. Vous décidez à un moment donné ce qu'il faut écrire. Ensuite, une semaine plus tard, vous essayez de vous rappeler ce qui n'a pas été écrit, car il devient évident que cette partie de la discussion était plus importante.\n\nVous ne rencontrez pas ce problème avec les transcriptions des conversations. Forcer les gens à réduire leurs pensées autrement décousues pour en faire des phrases concrètes aide à concentrer la discussion.\n\nBien sûr, nous avons toujours des réunions chez DADI+ de temps en temps, mais ce sont les exceptions qui confirment la règle.\n\n### Règles de vie\n\n* Ne pas assister à une réunion sans ordre du jour\n* Si une décision peut être prise par téléphone ou par chat, faites ainsi au lieu d'organiser ou d'assister à une réunion\n* Aucune réunion ne doit durer plus de 30 minutes\n* Seules les personnes les plus importantes doivent assister à une réunion. Les autres peuvent être informées par e-mail\n* Ne jamais faire de réunions pour examiner un résultat. Les revues doivent être effectuées hors réunion d'abord. La réunion ne doit servir qu'à discuter des résultats, et ne doit se tenir que si elle est absolument nécessaire\n\n## Travailler de manière asynchrone\n\nDans un style de travail synchrone, certains ou tous les membres d'une équipe arrêtent régulièrement ce qu'ils font, se réunissent, discutent et se mettent d'accord sur les prochaines étapes à suivre avant de reprendre le travail en mettant en œuvre ces étapes. Ces « points de jonction » synchrones sont fréquents, inévitables et intégrés à la structure du travail.\n\nDans un style de travail asynchrone, l'ensemble de l'équipe se réunit rarement, voire jamais, pour discuter et se mettre d'accord sur des points importants. Chaque membre individuel de l'équipe travaille plus ou moins seul et à son propre rythme, en collaborant et en s'accordant avec les autres grâce à des mécanismes asynchrones.\n\n![Le futur du travail](/assets/how-we-work/working-asynchronously.png)\n\nLe travail asynchrone est centré autour de réalisations partagées, chaque membre d'une équipe ajoutant graduellement des couches et de la complexité à ces réalisations. L'exemple le plus courant renvoie à un référentiel de code source. Un autre bon exemple est le partage de documents en ligne, avec plusieurs personnes qui font des modifications et des commentaires. Les membres de l'équipe ont généralement plusieurs fils de travail connexes qui sont gérés simultanément, de sorte que si l'on est bloqué sur l'entrée de quelqu'un d'autre, l'on peut récupérer un autre fil afin de maintenir la progression.\n\nLe fait de travailler de manière asynchrone permet aux membres de notre équipe d'être dispersés géographiquement et de choisir les heures qui leur conviennent le mieux.\n\nEn bref, cela permet aux membre de notre équipe de faire passer leur vie en premier.\n\n## Les bons outils pour le travail\n\nBien sûr, rien de cela ne fonctionnerait sans les bons outils de soutien.\n\nAprès notre personnel, les aspects les plus importants de notre façon de travailler sont les outils que nous utilisons quotidiennement. Dans le cas où un outil particulier ne fonctionne pas pour nous, nous passons à autre chose. Nous pensons fréquemment à ce sujet. Travaillons-nous toujours bien ensemble aujourd'hui, même si nous avons une taille deux fois plus importante qu'il y a six mois ?\n\nLes outils font la différence.\n\n### Slack\n\nSlack est probablement l'outil le plus important utilisé chez DADI+. C'est une plate-forme de chat organisée autour de chaînes publiques et privées.\n\nSlack est asynchrone. La communication asynchrone signifie que je peux sortir pour le déjeuner et rattraper les transcriptions en rentrant. Cela signifie que je peux poser une question à un collègue sans avoir peur de le déranger, car il reviendra vers moi quand il sera disponible. La communication asynchrone signifie que je peux aller dans la campagne du Somerset et effectuer une journée de travail normale.\n\n![Slack](/assets/how-we-work/slack.png)\n\nEn savoir plus : [slack.com](https://slack.com/)\n\n### Github\n\nGithub vous permet de collaborer sur n'importe quoi. C'est un système de contrôle de versions, mais qui ne craint pas.\n\nNous l'utilisons principalement pour le contrôle du code source, mais nous l'utilisons de plus en plus pour tout le reste.\n\n![Github](/assets/how-we-work/github.png)\n\nEn savoir plus : [github.com](https://github.com/)\n\n## Le résultat de tout cela ?\n\nNous sommes plus productifs que jamais. Étonnamment. Et nous produisons un niveau de travail au-delà même de nos attentes les plus élevées. Le changement est bénéfique.\n\n## Nous rejoindre\n\nVous souhaitez faire bouger votre vie professionnelle ? Nous embauchons. [En savoir plus](/careers)."
        },
        {
          "lang": "ru",
          "intro": "",
          "body": "Мы с моими партнерами занимаемся бизнесом разных масштабов более пятнадцати лет, от предприятия из двух человек до организаций всемирного масштаба и охвата.\n\nНесмотря на огромные различия в масштабе и предложении, физическая структура работы оставалась неизменной. У нас был офис. У нас был рабочий день. Команды структурировались по специальностям. У нас были регулярные совещания. По сути все те вещи, что приходят на ум, когда вы слышите слово «работа».\n\nНе то чтобы это было скучно. Вот наш офис на Curtain Road в первые дни Airlock (вы только зацените размер некоторых из этих мониторов!) – \n\n![Наш старый офис](/assets/how-we-work/airlock.jpg)\n\n...но мы структурировали наши жизни вокруг работы: бессонные ночи были обычным делом, а перерывы на празднества и подавно.\n\nКогда мы начали DADI+, то решили перевернуть все, что, как мы думали, знали о работе. Мы начали снова с нуля, строя все на основе одного ключевого принципа –\n**Это работа должна вписываться в наши жизни, а не наоборот.**\n\n## Прощание с офисом\n\nСамая очевидная для нас перемена была также самой тяжелой: избавиться от офиса.\n\nМежду окружением и работой существует невероятно сильная связь. Если вы проводите свою жизнь «уходя на работу», то исчезновение физического места назначения поставит перед вами серьезные вопросы касательно вашего определения и понимания самой концепции работы.\n\nЧто, конечно же, и являлось тем, чему мы хотели бросить вызов.\n\nВ нашем последнем начинании мы подбирали офисы так, чтобы они были на одинаковой отдаленности от всех наших сотрудников. На практике это означало, что в среднем на дорогу в офис уходило чуть меньше часа. Это более дня в неделю, потраченного каждым сотрудником компании на дорогу туда и обратно: 300 часов в неделю, растраченных на метро и загрязнение центра Лондона.\n\nДаже если вы не видите в этом очевидного напряжения, которое вынужден переносить человек, посмотрите с финансовой точки зрения: 300 часов в неделю – это около 100 000 фунтов стерлингов в месяц. Это не значит, что если бы не дорога, то данное время было бы потрачено на работу. Просто наглядный пример того, что коллективно на дорогу может тратиться ошеломляюще много времени.\n\nМы также заметили знакомый многим тренд: все работающие в офисе открытого типа носят большие наушники.\n\nТехнологии стали серьезно и заметно менять то, как мы работаем, около десяти лет назад. Теперь для общения с человеком, сидящим от вас в двух столах, вместо живого диалога обычно используются мгновенные сообщения. Наряду с повальным использованием наушников это является признаком изменения трудовых приемов; отхода от традиционного, синхронного метода работы к асинхронности.\n\nОтсутствие центрального офиса охватывает это изменение. Оно позволяет нам работать абсолютно по-новому и устраняет традиционные структуры и правила, сопровождающие привязанную к месту работу. Для нас все асинхронно.\n\nЭто изменение также позволило нам совсем по-иному взглянуть на наем кадров. Глупым тщеславием было бы полагать, что лучшие программисты, дизайнеры и стратеги живет в часе езды от центра Лондона. Отсутствие офиса означает, что мы можем искать лучшие таланты повсюду.\n\nВ нашей команде есть члены, которые предпочитают традиционную рабочую среду. Для них мы покрываем аренду совместного офисного пространства. У нас есть сотрудники, предпочитающие работать в кафе. У нас работают люди, у которых есть домашний офис (я сейчас как раз сижу в своем). У нас есть сотрудники в Лондоне. А есть и не в Лондоне. Члены нашей команды живут в разных странах. \n\nИ, конечно, совершенно невозможно назвать единое время дня, когда мы наиболее продуктивны. Дорога на работу и обратно – устранимое препятствие. Это точно так же, как выбирать время для еды или решать – одевать что-то или нет. Дать людям свободу организовывать свое время в зависимости от их собственного графика пиков и спадов продуктивности означает избежать прерывания хода размышлений из-за необходимости успеть на поезд.\n\n### Крайнее отдаление\n\nЭто Джим – \n\n![Мистер Джеймс Лэмби](/assets/how-we-work/jim.jpg)\n\nОн один из наших ведущих разработчиков. Завтра будет первый день его поездки длиной в 15 000 миль на велосипеде (!), в конце которой он окажется аж в Новой Зеландии. Он начинает в Брайтоне.\n\nПроводя большую часть времени в пути, он будет оставаться частью нашей команды, руководя разработкой некоторых из наших основных технологий. Мы любим размышлять о том, как он ведет велосипед одной рукой, а второй неистово печатает на ноутбуке, привязанном сбоку к его велосипеду. Но на самом деле он будет делать вклад прерывисто, работая из главных городов на маршруте – в основном в холодные зимние месяцы.\n\nЭто крайнее проявление того, что позволяет асинхронность, но оно подтверждает главное. Никоим образом он не смог бы совместить эту поездку с работой в нашем последнем агентстве.\n\nВы можете следить за невероятной поездкой Джима на [agreatdistance.org](http://www.agreatdistance.org), где есть множество информации – от его текущих координат – будет полезно для тех, кто захочет подбодрить его лично! – до уже преодоленной им дистанции.\n\n## Совещания все еще ███████ токсичны\n\n37signals заявили, что «совещания токсичны», в своей книге [Getting Real](https://gettingreal.37signals.com/).\n\nТрадиционно совещания проводятся, когда что-то нужно обсудить. Они часто собирают больше людей, чем нужно, отражают иерархию и политику внутри организации и обычно длятся намного дольше, чем требуется.\n\nСловом, совещания убивают продуктивность.\n\nПри работе с технологиями намного более уместно и продуктивно просто продолжать им заниматься – поднять ветку, проверить отличия, после чего снова пройтись по ним вместо того, чтобы думать, будто вы сможете сразу идеально разработать архитектуру системы.\n\nЧто верно для программирования, верно и для других сфер бизнеса.\n\nДаже если вы делаете заметки на совещании, вы не можете записать все. В какой-то момент вы делаете суждение о том, что записывать. Неделю спустя вы пытаетесь вспомнить то, что не было записано, и понимаете, что та часть обсуждения была более важной.\n\nС текстами переписок этой проблемы у вас не будет. Чтобы сфокусировать обсуждение, нужно заставить людей сузить свои размытые мысли до конкретных предложений.\n\nКонечно же, время от времени мы в DADI+ проводим совещания, но они скорее исключение, чем правило.\n\n### Правила жизни\n\n* Не посещайте никаких совещаний без повестки\n* Если решение можно принять по телефону или в чате, принимайте его именно так, вместо созыва или посещения совещания\n* Совещания не должны длиться более 30 минут\n* Только самые важные люди должны посещать совещания. Остальных можно уведомить по эл. почте\n* Никогда не проводите совещания для рассмотрения результатов. Рассмотрения нужно сначала делать офлайн, а уже встречаться для обсуждения результатов – только при крайней необходимости\n\n## Асинхронная работа\n\nСинхронный стиль работы – тот, при котором некоторые или все члены команды регулярно прекращают работу, встречаются, обсуждают и соглашают следующие шаги, прежде чем вернуться к работе и реализовать их. Эти синхронные «точки соприкосновения» часты, неизбежны и встроены в структуру работы.\n\nАсинхронный стиль работы – тот, при котором целая команда редко (если вообще) собирается вместе с целью проведения больших согласований и обсуждений. Каждый отдельный член команды в некоторой степени работает сам по себе и в своем собственном ритме, взаимодействие и согласование проводятся с использованием асинхронных механизмов.\n\n![Будущее работы](/assets/how-we-work/working-asynchronously.png)\n\nАсинхронные рабочие центры базируются вокруг общих артефактов, и каждый член команды постепенно наращивает на них новые слои и повышает уровень их сложности. Наиболее распространенным примером являются вклады в хранилище исходного кода. Другой хороший пример – онлайн-работа над документом, с несколькими редакторами и комментаторами. Члены команды обычно имеют несколько одновременных рабочих потоков, поэтому если один зависает в ожидании вклада от кого-то еще, можно переключиться на другой, чтобы не тормозить продвижение вперед.\n\nАсинхронная работа позволяет нашей команде быть географически децентрализованной и выбирать для работы время, подходящее каждому.\n\nСловом, она позволяет нашей команде поставить жизнь на первое место.\n\n## Правильные средства для работы\n\nКонечно, ничего из этого не работало бы без помощи правильных инструментов.\n\nПосле сотрудников вторыми по значимости в нашей работе являются средства, которыми мы пользуемся каждый день. Если какой-то инструмент нам не подходит, мы переходим на что-то другое. Мы постоянно думаем о сотрудниках. Работаем ли мы еще слаженно сегодня, когда спустя шесть месяцев выросли вдвое?\n\nСредства имеют значение.\n\n### Slack\n\nSlack, наверное, самый важный инструмент, которым мы пользуемся в DADI+. Это платформа-чат, организованная вокруг публичных и приватных каналов.\n\nSlack асинхронна. Асинхронная коммуникация означает, что я могу прерваться на ланч и догнать переписку по возвращении. Это означает, что я могу задать коллеге вопрос, не волнуясь, что побеспокою ее – она ответит мне, когда сможет. Асинхронная коммуникация означает, что я могу отправиться в сельскую местность Сомерсета и провести там нормальный рабочий день.\n\n![Slack](/assets/how-we-work/slack.png)\n\nУзнать больше: [slack.com](https://slack.com/)\n\n### Github\n\nGithub позволяет вам совместно работать над чем угодно. Это система контроля версий, но действительно качественная.\n\nВ основном мы пользуемся ей для контроля исходного кода, но все больше привлекаем и для всего остального.\n\n![Github](/assets/how-we-work/github.png)\n\nУзнать больше: [github.com](https://github.com/)\n\n## Результаты всего этого?\n\nМы продуктивнее, чем когда-либо. Представьте себе. И выполняем стандартный план куда быстрее даже самых высоких наших ожиданий. Перемены – это хорошо.\n\n## Присоединяйтесь к нам\n\nХотите встряхнуть свою рабочую жизнь? Мы нанимаем. [Узнайте больше](/careers)."
        },
        {
          "lang": "pt",
          "body": "Os meus sócios e eu temos gerido negócio de diferentes tamanhos ao longo de quinze anos, desde uma operação de duas pessoas até organizações de escala global.\n\nApesar de enormes diferenças em escala e oferta, as estruturas físicas de trabalho mantiveram-se constantes ao longo do tempo. Tínhamos um escritório. Tínhamos um horário de trabalho. Tínhamos equipas organizadas à volta de disciplinas. Tínhamos reuniões normais. Basicamente tudo o que vem à ideia quando se fala de \"trabalho\".\n\nNão é que não fosse divertido. Este é o nosso escritório na Curtain Road, nos primeiros tempos da Airlock (olha para o tamanho de alguns dos monitores!) –\n\n![O nosso antigo escritório](/assets/how-we-work/airlock.jpg)\n\n... mas nós estruturávamos as nossas vidas à volta do trabalho: fazer directas era frequente e interromper férias era um dado adquirido.\n\nQuando começámos a DADI decidimos romper com tudo aquilo que achávamos que sabíamos sobre o trabalho. Começámos do zero, estruturando tudo à volta de um princípio chave –\n\n**O trabalho deve moldar-se às nossas vidas, não o contrário.**\n\n## Abandonar o escritório\n\nA mudança mais óbvia para nós foi também a mais difícil: livrarmo-nos do nosso escritório.\n\nHá uma ligação incrivelmente forte entre o ambiente e o trabalho. Se passas a tua vida a \"ir para o trabalho\", remover o destino físico da equação levanta sérias questões sobre a tua definição e percepção do próprio conceito de trabalho.\n\nO que é precisamente aquilo que queríamos desafiar.\n\nNo nosso último negócio decidimos escolher os nossos escritórios com base no valor óptimo da distância a percorrer para todo o nosso staff. Na prática, isto significava que a viagem média até ao escritório era de pouco mais de uma hora. Isso representa mais do que um dia por semana em que cada pessoa da empresa passa a viajar: 300 horas por semana perdidas para o metro e para a poluição de Londres.\n\nMesmo que não consigas ver o óbvio esforço humano que isso representa, considera o aspecto financeiro: 300 horas por semana representam cerca de £100,000 por mês. Não quer dizer que esse tempo seria obrigatoriamente usado para trabalhar, mas o que é facto é que o tempo colectivo perdido em transportes é incrivelmente alto.\n\nTambém reparámos em algo que certamente será familiar para muitos: toda a gente usava auscultadores enormes num escritório aberto.\n\nA tecnologia começou a mudar clara e radicalmente a forma como trabalhámos há cerca de uma década. É hoje prática comum utilizar serviços de mensagens instantâneas para falar com a pessoa que está sentada a duas secretárias de distância, em vez de falar com ela pessoalmente. Além da massificação dos auscultadores, isto foi um ponto de viragem nas práticas de trabalho; um abandono dos métodos tradicionais e síncronos de trabalho, dando lugar a um método assíncrono.\n\nNão ter um escritório promove esta mudança. Permite que trabalhemos de uma forma completamente nova e remove estruturas e políticas tradicionais que resultam de trabalhar num espaço físico. Para nós, tudo é assíncrono.\n\nEsta mudança também nos permitiu abordar o recrutamento de uma forma completamente diferente. É uma falácia pensar que os melhores programadores, designers e estrategistas vivem todos a uma hora de Londres. Não ter um escritório significa que podemos alargar os horizontes e procurar o melhor talento possível.\n\nTemos membros da equipa que preferem um ambiente de trabalho tradicional, aos quais cobrimos as despesas de aluguer de um espaço de escritório físico. Temos membros da equipa que saltam de café em café. Temos membros da equipa que têm um escritório em casa (estou a escrever a partir do meu). Temos membros da equipa em Londres. Temos membros da equipa em diversos países.\n\nE, claro, é impossível generalizar sobre a altura do dia em que somos mais produtivos. Uma viagem para o trabalho é necessariamente uma interrupção, como a altura do dia em que escolhemos comer ou vestirmo-nos. Dar aos indivíduos a liberdade de organizar o seu tempo à volta dos seus próprios altos e baixos de produtividade evita teres de deixar um raciocínio descarrilar para te enfiares num comboio.\n\n### Trabalho remoto ao extremo\n\nEste é o Jim –\n\n![Sr. James Lambie](/assets/how-we-work/jim.jpg)\n\nEle é um dos nossos Lead Developers. Amanhã, ele parte para o primeiro dia da sua viagem de 25.000 km em bicicleta – ! – que o levará até à Nova Zelândia. Ele parte de Brighton.\n\nApesar de ele andar na estrada durante a maioria do tempo, ele continuará como membro da nossa equipa, liderando o desenvolvimento de algumas das nossas tecnologias base. Gostamos de pensar que ele vai pedalar com uma mão no guiador e outra a teclar furiosamente num portátil amarrado à bicicleta, mas na verdade ele irá contribuir à medida que pode, trabalhando intervalos de tempo a partir das cidades que visita, especialmente durante os meses frios do Inverno.\n\nEste é um exemplo extremo daquilo que o trabalho assíncrono permite, mas serve para provar a teoria. De forma alguma esta viagem poderia funcionar na nossa última agência.\n\nPodes seguir a incrível viagem do Jim em [agreatdistance.org](http://www.agreatdistance.org), que inclui uma série de dados, desde as suas coordenadas actuais – útil se lhe quiseres dizer adeus! – até à distância percorrida.\n\n## As reuniões são ███████ tóxicas\n\nA 37signals cunhou a expressão \"as reuniões são tóxicas\" no seu livro, [Getting Real](https://gettingreal.37signals.com/).\n\nNormalmente, as reuniões são convocadas quando alguém precisa de falar. Costumam ser convidadas mais pessoas que o necessário, reflectindo a hierarquia e políticas da organização e tendem a durar muito mais tempo do que o necessário.\n\nEm suma, as reuniões acabam com a produtividade.\n\nEm tecnologia, faz mais sentido e é muito mais produtivo fazeres-te ao caminho – submeter um pedaço de código, analisar as diferenças e iterar sobre essas diferenças em vez de assumires que vais pegar num marcador e desenhar num quadro branco toda a arquitectura do sistema de antemão.\n\nO que é verdadeiro para a programação aplica-se também a todos os outros aspectos de um negócio.\n\nMesmo que tomes notas numa reunião, não podes absorver tudo. Tens de tomar decisões, de tempos a tempos, sobre o que é digno de tomar nota. Uma semana depois, tentas lembrar-te daquilo que acabaste por não escrever, à medida que percebes que essa parte da discussão era mais importante.\n\nNão tens este problema com transcrições de salas de chat. Forçar as pessoas a reduzirem as suas divagações a pensamentos concretos ajuda a que a discussão se mantenha focada.\n\nClaro que também temos reuniões na DADI de tempos a tempos, mas são a excepção e não a regra.\n\n### Regras a seguir\n\n* Não vás a uma reunião que não tenha uma ordem de trabalhos\n* Se uma decisão pode ser tomada ao telefone ou no chat, fá-lo, em vez de marcares ou ires a uma reunião\n* Nenhuma reunião deverá durar mais do que 30 minutos\n* Só as pessoas mais importantes deverão estar na reunião. As outras podem ser informadas por email\n* Nunca convoques reuniões para rever resultados. Revisões devem acontecer \"offline\" primeiro, resultando numa reunião para discussão só quando absolutamente necessário\n\n## Trabalhar assincronamente\n\nUm estilo de trabalho síncrono é aquele em que alguns ou todos os membros de uma equipa frequentemente param o que estão a fazer, reúnem-se, discutem e planeiam os próximos passos a seguir, para depois voltarem ao trabalho e seguirem esses passos. Estes \"pontos de contacto\" síncronos são frequentes, inevitáveis e embrenhados na estrutura do trabalho.\n\nUm estilo de trabalho assíncrono é aquele em que uma equipa raramente, ou nunca, se reúne para grandes planos e discussões. Cada membro da equipa trabalha mais ou menos por si próprio e ao seu próprio ritmo, com colaborações e planeamentos sendo tidos através de mecanismos assíncronos.\n\n![O futuro do trabalho](/assets/how-we-work/working-asynchronously.png)\n\nO trabalho assíncrono é assente nestes artefactos partilhados, com cada membro da equipa a acrescentar gradualmente camadas de complexidade a esses artefactos. O exemplo mais comum é o envio de código fonte para um repositório. Outro bom exemplo é a partilha de documentos online, com vários editores e comentadores. Os membros da equipa têm frequentemente vários assuntos de trabalho relacionados a correr simultaneamente, de modo a que se um ficar bloqueado à espera de input de alguém, outro assunto pode passar à acção para que o ritmo de trabalho de mantenha.\n\nTrabalhar assincronamente permite à nossa equipa estar geograficamente distribuída e escolher as horas que melhor se ajustam a cada pessoa.\n\nEm suma, isto permite que os membros da nossa equipa coloquem as suas vidas em primeiro.\n\n## As ferramentas certas para o trabalho\n\nClaro que nada disto funcionaria sem o suporte das ferramentas certas.\n\nDepois do nosso staff, o aspecto mais importante da forma como trabalhamos são as ferramentas que usamos diariamente. Quando uma ferramenta não funciona connosco, adoptamos outra qualquer. Avaliamos estas coisas constantemente. Continuamos a trabalhar bem juntos, apesar de hoje termos o dobro do tamanho que tínhamos há seis meses?\n\nAs ferramentas fazem a diferença.\n\n### Slack\n\nO Slack é provavelmente a ferramenta mais importante que usamos na DADI. É uma plataforma de chat organizada em canais públicos e privados.\n\nO Slack é assíncrono. Comunicação assíncrona significa que eu posso sair para almoçar e pôr-me a par das discussões quando voltar. Significa que posso fazer uma pergunta a uma colega e não me preocupar se a estou a incomodar, já que ela me responderá quando estiver disponível. Comunicação assíncrona significa que posso ir para o Somerset rural e ter um normal dia de trabalho.\n\n![Slack](/assets/how-we-work/slack.png)\n\nSabe mais: [slack.com](https://slack.com/)\n\n### GitHub\n\nO GitHub permite-nos colaborar em tudo. É um sistema de controlo de versões, mas um que presta.\n\nNós usamo-lo predominantemente para o controlo de versões do código, mas começamos gradualmente a usá-lo para tudo o resto também.\n\n![GitHub](/assets/how-we-work/github.png)\n\nSabe mais: [github.com](https://github.com/)\n\n## O resultado de tudo isto?\n\nSomos mais produtivos do que alguma vez fomos. Sem qualquer dúvida. E os padrões do trabalho que produzimos correspondem e excedem as nossas maiores expectativas. A mudança é boa.\n\n## Junta-te a nós\n\nEstás interessado em abanar a tua vida profissional? Estamos a recrutar. [Sabe mais](/careers)."
        },
        {
          "lang": "zh_hant",
          "body": "我和我的伙伴已經經營不同大小的企業超過十五年了，規模從兩人編制到全球性組織。\n\n儘管在規模和薪資上有巨大差異，工作的物理結構始終不變。我們有辦公室。我們有工作日。我們以紀律管理團隊。我們定期開會。基本上，聽到「工作」時腦中浮現的所有事情我們都有。\n\n並不是說這樣不好玩。這是 Airlock草創時期，我們在窗簾路的辦公室（看看有些螢幕的大小！）-\n\n![我們的舊辦公室](/assets/how-we-work/airlock.jpg)\n\n...但我們的生活圍繞著工作轉：熬夜不睡稀鬆平常，度假被工作打斷更是家常便飯。 \n\n剛創立 DADI+ 時，我們決定打破自己對工作所有既定觀念。一切從零開始，依照一個核心概念來規劃－\n\n**工作應配合我們的生活，而非相反。**\n\n## 捨棄辦公室\n\n對我們來說，最明顯也最困難的改變就是：捨棄我們的辦公室。\n\n環境與工作有很神奇的強大連結。如果你一生都是「出門去上班」，少了具體的上班目的地將會讓你對工作最基本的定義與理解產生很深的疑惑。\n\n這正是我們想挑戰的。\n\n在我們上一個事業，我們的辦公室位置是以所有員工通勤時間的平均來決定。也就是稍稍超過一小時。這代表辦公室每個人每週花超過一天的時間在通勤：一周浪費 300 小時在地鐵與倫敦市中心的空氣污染上。\n\n即便你看不出這對人力上的明顯消耗，請以經濟來考量：一周 300 小時的時間價值等於一個月 £100,000。這並不是說這些時間本來一定會拿來工作，但光是花在交通上的總時間就已經高到嚇人。 \n\n我們也注意到一個很多人都很熟悉的風氣：在開放式辦公室裡，每個人都戴著大型耳罩式耳機。\n\n科技在這幾十年來，開始顯著改變我們工作的方式。現在用即時通跟兩桌之隔的人聯繫，而不是直接跟他們說話，已是很平常的事。再加上耳機的盛行，代表工作慣例的改變；從傳統、同步的工作方式到異步。\n\n沒有中央社辦公室符合這個變化。這讓我們以全新的方式工作，消除了建基於地理位置工作之傳統架構與運作方式。對我們來說，一切都是異步的。 \n\n這個改變也讓我們對招聘的想法完全改觀。認為最棒的編碼員、設計師、策略師都住在倫敦市中心一小時車程內的想法太荒謬了。沒有辦公室代表我們可以四處招聘最棒的人才。\n\n我們有團隊成員偏好傳統的工作環境，對此我們會給予共享辦公室之租金補貼。我們也有成員喜歡到不同咖啡廳工作。還有成員在家工作（我現在打字的同時就坐在家中）。我們有團隊成員在倫敦、在倫敦以外的城市、或是在不同國家。\n\n當然，籠統概述一天中我們何時生產力最高這件事是不可能的。通勤是可避免的中斷，就像我們選擇要進食或是是否要穿上衣服。讓每個人根據他們生產力的高低峰自由運用時間，避免為了跳上火車而打斷進行中的思緒。\n\n### 極端遠程\n\n這是吉姆 -\n\n![Mr James Lambie](/assets/how-we-work/jim.jpg)\n\n他是我們的主要發展者。明天是他展開前往紐西蘭的 15,000 英里- ! -單車之旅的第一天。他從布萊頓開始。 \n\n雖然他大部分時間都會在路上，他仍待在我們團隊裡，領導我們一些核心基礎技術的發展。我們想像他會一手放在單車把手上騎車，另一手在綁在單車一邊的筆電上瘋狂打字，但事實上，他會在經過路上主要城市時，間歇性的貢獻心力，特別是在寒冷的冬季時。\n\n這是異步工作的極端例子，但它的確說明了一點。在我們上個工作地點，這樣的旅行是絕對不可能的。\n\n您可以在 [agreatdistance.org](http://www.agreatdistance.org)追蹤吉姆的旅程，上面有豐富的資料，從他目前所在座標－若您想跟他打招呼將會非常有用！－到他已旅行的距離等等。\n\n## 會議仍然非常 ███████ 有毒\n\n37signals 在《Getting Real》這本書提出「會議有毒說」 (https://gettingreal.37signals.com/)。\n\n過去，召開會議是因為有事情需要具體討論。會議通常邀請多於必要的人參加、反映出組織的層級與運作方式、並通常相當冗長。\n\n簡言之，會議扼殺生產力。\n\n在技術上，更加合理且有成效的方式是快點行動─要建立分支，先比對差異，然後由此衍生，而不是假設你能提前架設出完美的系統架構。 \n\n程式設計的真理也適用於商業的其他所有面向。\n\n就算你在會議中作筆記，你也無法捕捉一切。你在某個時間點決定該紀錄什麼。然後一周後，你試著回想沒紀錄的部分，因為很明顯這部分的討論似乎更加重要。\n\n強迫人們將其漫不經心的想法濃縮為句子，有助於討論的聚焦。\n\nDADI+ 當然三不五時還是會開會，但這些是特例而非常態。\n\n### 生活規則\n\n* 不要在沒有議程的情況下參加任何會議\n* 如果可以透過電話或線上聊天下決定，請不要安排或參加會議\n* 會議長度不應超過 30 分鐘\n* 只有最重要的人需要參加會議。其他人可以用電子郵件通知\n* 不要舉行會議來檢核輸出。檢核應離線處理，除非萬不得已才召開會議討論。\n\n## 異步工作\n\n同步工作的方式，是團隊中的一些或所有成員停止他們在做的事，會面、同意接下來的步驟後，再重新開始執行這些步驟。這些同步的「連結點」既頻繁又不可避免、並被納入工作的結構中。\n\n異步的工作風格，則是整個團隊很少或幾乎不聚集在一起進行大型協議和討論。每個成員都或多或少以自己的速度自行展開工作，合作及協議則透過異步機制來處理。\n \n!《The future of work》(/assets/how-we-work/working-asynchronously.png)\n\n異步工作強調共享文物，團隊中的每個成員逐漸增加文物的層次與複雜度。最常見的例子是提交到原始碼儲存平台。另一個好例子是能夠有多位編輯者與評論者的線上文件分享。團隊成員通常有多個相關的工作執行緒同時進行，這樣如果一個輸入被別人阻擋，還可以進行另一個工作執行緒以保持前進的動能。\n\n異步工作讓我們的團隊得以在不同地區工作，並選擇適合他們的時間。\n\n簡言之，我們團隊能夠把自己的生活放在第一位。\n\n## 適合這樣工作的工具\n\n當然，如果沒有合適的工具支援，這些都不會發生。\n\n除了員工之外，我們工作最重要的部分就是每天使用的工具。如果一個特定工具不適合我們，我們就會繼續尋找。我們常常思考的問題是，即便我們的規模已是六個月前的兩倍大，我們還是工作順暢嗎？ \n\n使一切不同的工具。\n\n### Slack\n\nSlack 可能是 DADI+ 使用最重要的工具。它是囊括了公共和私人頻道的聊天平台。\n\nSlack 是異步的。異步溝通代表我可以外出用餐，等回來再回覆聊天記錄。這代表我可以問同事問題，而不用擔心會打擾到她，因為她會等有空時再回覆我。異步溝通代表我可以去薩默塞特鄉間還正常地工作一整天。\n!《Slack》(/assets/how-we-work/slack.png)\n\n了解更多：[slack.com](https://slack.com/)\n\n### Github\n\nGithub 允許你進行任何協作。它是一個版本控制系統，但很不賴。\n\n我們主要用它作原始碼控制，但其他部分也越來越常使用它。\n\n!《Github》(/assets/how-we-work/github.png)\n\n了解更多：[github.com](https://github.com/)\n\n## 這一切的結果是？\n\n我們比過去任何時刻都更有成效。非常驚人。 而且我們正在創造一種比我們期待更高、更前所未有的工作標準。改變是好的。\n\n## 加入我們\n\n有興趣改變你的工作生活嗎？我們正在招聘。 [了解更多](/careers).\n"
        }
      ]
    }
  }
}