{
  "datasource": {
    "key": "products",
    "name": "Information about DADI products",
    "requestParams": [{
      "param": "product", "field": "product"
    }],
    "source": {
      "type": "static",
      "data": [
        {
          "title": "API",
          "product": "api",
          "color": "#0BA6DD",
          "overview": "A high-performance RESTful API layer designed in support of API-first development and the principles of COPE.",
          "description": [
            "**DADI API** is a rapid set-up data layer ready to act as the backbone to your digital platform. It is designed to be plugged into a templating layer, a mobile application or to be used with any other data consumer – and can be used alongside other apps in the DADI technology suite.",
            "It can contain your business/domain logic (the part of a platform that encodes the real-world business rules that determine how data is created, displayed, stored and changed). **DADI API** allows you to get a complete data layer up and running in minutes."
          ],
          "headlines": [
            "**Filter and sort** your data with ease",
            "**Flexible** database support",
            "Automatic document **versioning**",
            "Built in support for **oAuth2**"
          ],
          "features": [
            {
              "title": "Filter and sort your data with ease",
              "icon": "folder-open",
              "description": "Harness the power of MongoDB-style querying to filter and sort your data."
            },
            {
              "title": "Flexible database support",
              "icon": "database",
              "description": "Support for multiple database connectors including MongoDB, CouchDB and RethinkDB."
            },
            {
              "title": "Automatic database indexing",
              "icon": "list",
              "description": "Indexing your underlying database is as simple as adding configuration elements to collections."
            },
            {
              "title": "Automatic input validation",
              "icon": "happy",
              "description": "Easily configure fields within collections for input validation."
            },
            {
              "title": "Collection-level access control",
              "icon": "locked",
              "description": "With a fine-grained authorisation layer, control who can access data and how."
            },
            {
              "title": "Cache data for faster retrieval",
              "icon": "cloud-upload",
              "description": "Cache data using a Redis server or the local filesystem, providing faster response times."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** can provide dynamic content for **Web**."
            },
            {
              "product": "publish",
              "description": "**Publish** provides an interface to edit content in **API**."
            }
          ]
        },
        {
          "hide_docs": true,
          "title": "Publish",
          "product": "publish",
          "color": "#FFBF0D",
          "overview": "A writer’s window to the world of content creation. Flexible interfaces designed to optimize editorial workflow.",
          "description": [
            "**DADI Publish** is developed to optimize editorial workflow with flexible interfaces that adapt to your requirements, meaning more time can be spent making content than wasting time managing it. It is built to support the [principles of COPE](./concepts/api-first-and-cope/) (Create Once Publish Everywhere).",
            "Journalists and editors can seamlessly manage output across multiple products from one place, while engineers can make light work of even complex content collections. Publish currently works with **DADI API** but our development roadmap will soon allow use with a variety of data stores."
          ],
          "headlines": [
            "Extendable **custom fields**",
            "Manage documents across **multiple APIs**",
            "Intuitive **in-browser editor** with the simple drag and drop tool",
            "**Background tasks** to manage big-data operations, analytics and much more"
          ],
          "features": [
            {
              "title": "Centralized media management",
              "icon": "picture",
              "description": "Power a suite of digital products from a single content store. Saves time and effort for engineers and editors alike."
            },
            {
              "title": "Article publish scheduling",
              "icon": "time",
              "description": "Pre-load content for automatic publishing at a time that suits the content, not your working day. Also create drafts for internal review."
            },
            {
              "title": "Setup and connect in 30 seconds",
              "icon": "database",
              "description": "The perfect partner for **DADI API** so you are up and running in days and weeks not weeks and months. Soon to work with other data stores."
            },
            {
              "title": "Custom user permissions",
              "icon": "locked",
              "description": "Enhanced features for large teams – keeping the right hands on the right parts of the system. Extends to support editorial workflow."
            },
            {
              "title": "Collaborative document editing",
              "icon": "user-new ",
              "description": "See where colleagues are in shared articles and avoid treading on toes – work together seamlessly to update content."
            },
            {
              "title": "Revision history with quick revert",
              "icon": "rewind",
              "description": "Provides a complete audit trail allowing you to restore to any point in time. Document differentials provide an overview of changes."
            }
          ],
          "workswith": [
            {
              "product": "web",
              "description": "**API** can provide content for **Web**."
            },
            {
              "product": "publish",
              "description": "Content in **API** can be editied in **Publish**."
            }
          ]
        },
        {
          "title": "CDN",
          "product": "cdn",
          "color": "#e02975",
          "dark-color": "#280816",
          "overview": "A just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution.",
          "description": [
            "**DADI CDN** is analogous to a traditional CDN (Content Distribution Network) such as [Akamai](https://www.akamai.com/) and [Limelight](https://www.limelight.com/). It is designed to carry the processing and delivery load associated with image manipulation and asset delivery (CSS/JS/fonts) and acts autonomously as a layer on top of your core product.",
            "**CDN** has full support for caching, header control, image manipulation, image compression and image format conversion. An authenticated API allows for fine grained cache control in the form of content invalidation on an individual file or collective path basis."
          ],
          "headlines": [
            "Serve from **Amazon S3**, a remote server or the local filesystem",
            "Dynamically generate images for **responsive design** and mobile devices",
            "Extensive set of image **enhancement** and **transformation** tools",
            "Image **format conversion**"
          ],
          "features": [
            {
              "title": "Crop based on subject matter",
              "icon": "picture",
              "description": "Let CDN decide the focal point of the image and deliver an image containing only the essentials, cropped to your specifications."
            },
            {
              "title": "Simplified media storage",
              "icon": "database",
              "description": "No need to maintain multiple sizes of each image you upload into an article - CDN generates new variations from a single master image."
            },
            {
              "title": "One CDN for all asset types",
              "icon": "layers",
              "description": "Store and deliver font files and minify all your CSS and JavaScript assets for delivery."
            },
            {
              "title": "Intelligent delivery",
              "icon": "activity",
              "description": "Let CDN choose the best transformations based on device, network, location or language."
            },
            {
              "title": "Delivery Recipes",
              "icon": "id",
              "description": "Store frequently used image manipulation parameters as a 'delivery recipe'."
            },
            {
              "title": "Cache crops for faster delivery",
              "icon": "bolt",
              "description": "Converted images can be cached using a Redis server or the local filesystem, providing faster delivery on subsequent requests."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Publish** manages content stored in **API**."
            },
            {
              "product": "cdn",
              "description": "**Publish** uses **CDN** to store and maniuplate images."
            },
            {
              "product": "web",
              "description": "**Publish** can use **Web** to serve a front-end."
            }
          ]
        },
        {
          "title": "Web",
          "product": "web",
          "color": "#e42918",
          "dark-color": "#490b08",
          "overview": "A schemaless templating layer that can operate as a standalone platform or with API as a full stack web application.",
          "description": [
            "**DADI Web** makes it easy to build custom enterprise-grade web applications. Easily create static pages or connect to APIs to generate data-driven apps giving you the power to search, paginate, sort and filter your data, on the server or in browser.",
            "**DADI Web** can use a variety of templating languages, providing a simple yet powerful template layer for displaying your data. These include _LinkedIn’s_ [Dust](http://www.dustjs.com/), [Pug](https://pugjs.org/) or [Handlebars](http://handlebarsjs.com/) – or you can easily craft your own."
          ],
          "headlines": [
            "Connect with **REST APIs** to generate data-driven pages",
            "Search, paginate, sort and filter your data",
            "Easily create **static pages**",
            "Support for **database-backed** sessions"
          ],
          "features": [
            {
              "title": "Flexible template engine support",
              "icon": "chat-alt",
              "description": "Use Web's default Dust.js template engine or swap in one for Pug.js or Handlebars.js – even craft your own!"
            },
            {
              "title": "URL Rewriting Support",
              "icon": "duplicate",
              "description": "Includes Apache-like URL rewriting, with full support for redirects and proxying."
            },
            {
              "title": "Events Layer",
              "icon": "bolt",
              "description": "Create custom JavaScript events to modify the request and response, or take action based on data loaded from a source."
            },
            {
              "title": "Data from anywhere",
              "icon": "cloud",
              "description": "You're not limited to using DADI API - serve data from static Markdown files or retrieve feeds from Twitter and Wordpress."
            },
            {
              "title": "Preload Data",
              "icon": "fast-forward",
              "description": "Speed up access to commonly required data by preloading it when the application boots."
            },
            {
              "title": "Cache pages for faster retrieval",
              "icon": "performance",
              "description": "Cache data using a Redis server or the local filesystem, providing faster response times to users. Includes full support for Cache-Control headers."
            }
          ],
          "workswith": [
            {
              "product": "api",
              "description": "**Web** can display content from **API**."
            },
            {
              "product": "cdn",
              "description": "**Web** uses **CDN** to serve images, CSS and JS."
            }
          ]
        }
      ]
    }
  }
}
