{
  "datasource": {
    "key": "products-list",
    "name": "Information about DADI products",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "product": "api",
          "overview": "A high-performance RESTful API layer designed in support of API-first development and the principles of COPE."
        },
        {
          "lang": "en",
          "product": "publish",
          "overview": "A writer’s window to the world of content creation. Flexible interfaces designed to optimise editorial workflow."
        },
        {
          "lang": "en",
          "product": "cdn",
          "overview": "A just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution."
        },
        {
          "lang": "en",
          "product": "web",
          "overview": "A schemaless templating layer that can operate as a standalone platform or with API as a full stack web application."
        },
        {
          "lang": "en",
          "product": "track",
          "overview": "Real-time, streaming data layer providing accurate metrics at individual and product level. Drives DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "en",
          "product": "visualize",
          "overview": "A data visualization interface for Identity and Track, but capable of taking data feeds from virtually any source.",
          "date": "Q2 2018"
        },
        {
          "lang": "en",
          "product": "identity",
          "overview": "Guarantees uniqueness of individuals – and powers segmentation – for anonymous and known users.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "en",
          "product": "match",
          "overview": "Taxonomic framework for automated content classification through machine learning. Plugs into Publish.",
          "date": "Q3 2017"
        },
        {
          "lang": "en",
          "product": "predict",
          "overview": "A machine learning  layer that predicts user behaviour at an individual level based on past interactions.",
          "date": "Q4 2017"
        },
        {
          "lang": "en",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "A lightweight, RSMQ-powered asynchronous task queue featuring simple task routing and throttling."
        },
        {
          "lang": "de",
          "product": "api",
          "overview": "Eine high-performance RESTful API Oberfläche, gestaltet mit Unterstützung der API-first Entwicklung und den Prinzipe von COPE."
        },
        {
          "lang": "de",
          "product": "publish",
          "overview": "Das Fenster zur Welt der Inhaltsschaffung eines Autors. Flexible Oberflächen, gestaltet um den editoriellen Workflow zu optimieren."
        },
        {
          "lang": "de",
          "product": "cdn",
          "overview": "Eine Echtzeit Asset und Delivery Oberfläche, gestaltet als moderne, weltweite Content Distribution Lösung."
        },
        {
          "lang": "de",
          "product": "web",
          "overview": "Eine schemalose Vorlagenebene, die entweder als Standalone Plattform betrieben werden kann oder mit API als eine allumfassende Internetanwendung."
        },
        {
          "lang": "de",
          "product": "track",
          "overview": "Echtzeit und Streaming Datenoberfläche um maßgeschneiderte Lösungen auf der individuellen Ebene und der Produktebene zu garantieren. Betreibt DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "de",
          "product": "visualize",
          "overview": "Eine Visualitierungsplattform für Daten aus Identity und Track, aber es ist möglich, Datenströme von jeder virtuellen Quelle zu erfassen.",
          "date": "Q2 2018"
        },
        {
          "lang": "de",
          "product": "identity",
          "overview": "Garantiert die Einzigartigkeit des Individuums - und ermöglicht Unterteilung - für anonyme und bekannte User.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "de",
          "product": "match",
          "overview": "Taxonomische Rahmenbedingungen für automatisierte Inhaltsklassifikationen durch maschinelles Lernen. Als Plug-in für Publish möglich.",
          "date": "Q3 2017"
        },
        {
          "lang": "de",
          "product": "predict",
          "overview": "Maschinelle Lernoberfläche, die individuelles Benutzerverhalten basierend auf vergangenen Interaktionen vorhersagt.",
          "date": "Q4 2017"
        },
        {
          "lang": "de",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Eine leichte, RSMQ-angetriebene asynchrone Task-Warteschlange mit einfacher Task-Routing und Throttling."
        },
        {
          "lang": "jp",
          "product": "api",
          "overview": "APIファーストの開発と、COPEの原則をサポートするように設計された高性能RESTful APIレイヤー。"
        },
        {
          "lang": "jp",
          "product": "publish",
          "overview": "コンテンツ制作の世界へのライターの窓口。編集ワークフローを最適化するように設計された柔軟なインターフェース。"
        },
        {
          "lang": "jp",
          "product": "cdn",
          "overview": "最新のグローバルコンテンツ配信ソリューションとして設計されたジャストインタイムでのアセット操作と配信レイヤー"
        },
        {
          "lang": "jp",
          "product": "web",
          "overview": "スキーマレスのテンプレートレイヤー。スタンドアロンのプラットフォームとしても、APIを使用してフルスタックのWebアプリケーションとしても動かすことができます。"
        },
        {
          "lang": "jp",
          "product": "track",
          "overview": "個別かつプロダクトレベルの正確なメトリックを提供するリアルタイムのストリーミングデータレイヤー。DADI Identifyを支えます。",
          "date": "Q3/4 2017"
        },
        {
          "lang": "jp",
          "product": "visualize",
          "overview": "IdentityとTrackのためのデータ可視化インターフェース。事実上あらゆるソースからデータフィードを取得することができます。",
          "date": "Q2 2018"
        },
        {
          "lang": "jp",
          "product": "identity",
          "overview": "個人の一意性の保証。さらに権限の区分け。匿名および既知のユーザのためのものです。",
          "date": "Q3/4 2017"
        },
        {
          "lang": "jp",
          "product": "match",
          "overview": "機械学習を通じた自動コンテンツ分類器のための分類学的フレームワーク。Publishに接続されます。",
          "date": "Q3 2017"
        },
        {
          "lang": "jp",
          "product": "predict",
          "overview": "過去のやりとりに基づいて個人レベルでのユーザの行動を予測する機械学習レイヤー。",
          "date": "Q4 2017"
        },
        {
          "lang": "jp",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "シンプルなタスクルーティングとスロットル機能を備えた、軽量でRSMQ対応の非同期タスクキュー。"
        },
        {
          "lang": "fr",
          "product": "api",
          "overview": "Une couche API RESTful à haute performance conçue pour soutenir le premier développement de l'API et les principes de COPE."
        },
        {
          "lang": "fr",
          "product": "publish",
          "overview": "Une fenêtre d'écrivain vers le monde de la création de contenu. Des interfaces flexibles conçues pour optimiser le flux de travail éditorial."
        },
        {
          "lang": "fr",
          "product": "cdn",
          "overview": "Une solution de manipulation et de distribution d'actifs juste à temps conçue comme une solution de distribution de contenu mondiale moderne."
        },
        {
          "lang": "fr",
          "product": "web",
          "overview": "Une couche de modélisation sans schéma qui peut fonctionner comme une plate-forme autonome ou avec API en tant qu'application Web full stack."
        },
        {
          "lang": "fr",
          "product": "track",
          "overview": "Couche de données en temps réel en continu fournissant des mesures précises au niveau individuel et du produit. Dirige DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "fr",
          "product": "visualize",
          "overview": "Une interface de visualisation de données pour Identity et Track, mais capable de prendre des flux de données de pratiquement n'importe quelle source.",
          "date": "Q2 2018"
        },
        {
          "lang": "fr",
          "product": "identity",
          "overview": "Garantit l'unicité des individus – et la segmentation des pouvoirs – pour les utilisateurs anonymes et connus.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "fr",
          "product": "match",
          "overview": "Cadre taxonomique pour la classification automatisée du contenu par apprentissage machine. S'applique à la publication.",
          "date": "Q3 2017"
        },
        {
          "lang": "fr",
          "product": "predict",
          "overview": "Une couche d'apprentissage machine qui prédit le comportement de l'utilisateur à un niveau individuel en fonction des interactions passées.",
          "date": "Q4 2017"
        },
        {
          "lang": "fr",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Une ligne de tâches asynchrones légère et à assistance RSMQ offrant un routage et une limitation des tâches simples."
        },
        {
          "lang": "es",
          "product": "api",
          "overview": "Una capa API de alto rendimiento diseñada para apoyar el desarrollo de API-first y los principios de COPE."
        },
        {
          "lang": "es",
          "product": "publish",
          "overview": "La ventana de un escritor al mundo de la creación de contenidos. Interfaces flexibles diseñadas para optimizar el flujo de trabajo editorial."
        },
        {
          "lang": "es",
          "product": "cdn",
          "overview": "Una capa de manipulación y entrega de activos justo a tiempo diseñada como solución moderna de distribución de contenido global."
        },
        {
          "lang": "es",
          "product": "web",
          "overview": "Una capa de plantilla sin esquema que puede funcionar como plataforma independiente o con API como aplicación web full stack."
        },
        {
          "lang": "es",
          "product": "track",
          "overview": "Capa de datos de streaming en tiempo real que proporciona métricas precisas a nivel individual y de producto. Dirige la Identidad de DADI.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "es",
          "product": "visualize",
          "overview": "Una interfaz de visualización de datos para identidad y seguimiento, pero capaz de tomar canales de datos de prácticamente cualquier fuente.",
          "date": "Q2 2018"
        },
        {
          "lang": "es",
          "product": "identity",
          "overview": "Garantiza la unicidad de los individuos, y potencia la segmentación, para usuarios anónimos y conocidos.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "es",
          "product": "match",
          "overview": "Marco taxonómico para la clasificación automatizada de contenido a través del aprendizaje automático. Se conecta a Publicar.",
          "date": "Q3 2017"
        },
        {
          "lang": "es",
          "product": "predict",
          "overview": "Una capa de aprendizaje automático que predice el comportamiento del usuario en un nivel individual en función de interacciones pasadas.",
          "date": "Q4 2017"
        },
        {
          "lang": "es",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Una cola de tareas asíncronas, ligera y RSMQ, que ofrece un enrutamiento y un estrangulamiento de tareas sencillos."
        },
        {
          "lang": "ru",
          "product": "api",
          "overview": "Высокопроизводительный REST-слой API поддерживает разработку по принципу API-first и соответствует принципам COPE."
        },
        {
          "lang": "ru",
          "product": "publish",
          "overview": "Окно писателя в мир создания контента. Гибкие интерфейсы, разработанные для оптимизации рабочей области редактирования."
        },
        {
          "lang": "ru",
          "product": "cdn",
          "overview": "Своевременный слой для передачи и управления ресурсами, разработанный в форме современного глобального решения для распределения контента."
        },
        {
          "lang": "ru",
          "product": "web",
          "overview": "Неструктурированный шаблонный слой, который может функционировать как автономная платформа или с API в качестве \"full stack\" веб-приложения."
        },
        {
          "lang": "ru",
          "product": "track",
          "overview": "Слой потоковых данных в режиме реального времени, обеспечивающий точные показатели на индивидуальном уровне и на уровне продукта. Обеспечивает работу DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "ru",
          "product": "visualize",
          "overview": "Интерфейс визуализации данных для Identity и Track, однако способный получать данные из практически любого источника.",
          "date": "Q2 2018"
        },
        {
          "lang": "ru",
          "product": "identity",
          "overview": "Гарантирует уникальность индивидуумов и обеспечивает сегментацию для анонимных и известных пользователей.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "ru",
          "product": "match",
          "overview": "Таксономический фреймворк для автоматизированной классификации контента с помощью машинного обучения. Подключается к Publish.",
          "date": "Q3 2017"
        },
        {
          "lang": "ru",
          "product": "predict",
          "overview": "Слой машинного обучения, который предсказывает поведение пользователя на индивидуальном уровне на основе прошлых взаимодействий.",
          "date": "Q4 2017"
        },
        {
          "lang": "ru",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Легкая, асинхронная очередь задач с поддержкой RSMQ с простой маршрутизацией задач и дросселированием."
        },
        {
          "lang": "pt",
          "product": "api",
          "overview": "Um serviço API RESTful de alta performance desenhada em suporte de um desenvolvimento API-first e dos princípios de COPE."
        },
        {
          "lang": "pt",
          "product": "publish",
          "overview": "A janela de um escritor para o mundo da criação de conteúdos. Interfaces flexíveis desenhados para optimizar o processo editorial."
        },
        {
          "lang": "pt",
          "product": "cdn",
          "overview": "Um serviço para manipulação de recursos just-in-time, desenhada para ser uma solução moderna de distribuição global de conteúdos."
        },
        {
          "lang": "pt",
          "product": "web",
          "overview": "Um serviço para templates sem lógica de negócio que pode operar sozinha ou com API, formando uma aplicação web full stack."
        },
        {
          "lang": "pt",
          "product": "track",
          "overview": "Um serviço de dados em tempo real, gerando métricas precisas ao nível do produto e do indivíduo. Alimenta o DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "pt",
          "product": "visualize",
          "overview": "Um interface de visualização de dados para Identity e Track, mas capaz de monitorizar feeds de dados de praticamente qualquer fonte.",
          "date": "Q2 2018"
        },
        {
          "lang": "pt",
          "product": "identity",
          "overview": "Garante a unicidade de indivíduos - e gera a segmentação - para utilizadores anónimos e conhecidos.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "pt",
          "product": "match",
          "overview": "Uma estrutura taxonómica para a classificação automática de conteúdos através de machine learning. Liga com Publish.",
          "date": "Q3 2017"
        },
        {
          "lang": "pt",
          "product": "predict",
          "overview": "Um serviço de machine learning que prevê o comportamento dos utilizadores a um nível individual, baseado em interacções passadas.",
          "date": "Q4 2017"
        },
        {
          "lang": "pt",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Uma fila de tarefas assíncronas com suporte RSMQ, com roteamento e aceleração de tarefas simples."
        }
      ]
    }
  }
}
