{
  "datasource": {
    "key": "products-list",
    "name": "Information about DADI products",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "product": "api",
          "overview": "A high-performance RESTful API layer designed in support of API-first development and the principles of COPE."
        },
        {
          "lang": "en",
          "product": "publish",
          "overview": "A writer’s window to the world of content creation. Flexible interfaces designed to optimise editorial workflow."
        },
        {
          "lang": "en",
          "product": "cdn",
          "overview": "A just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution."
        },
        {
          "lang": "en",
          "product": "web",
          "overview": "A schemaless templating layer that can operate as a standalone platform or with API as a full stack web application."
        },
        {
          "lang": "en",
          "product": "track",
          "overview": "Real-time, streaming data layer providing accurate metrics at individual and product level. Drives DADI Identity.",
          "date": "Q1 2018"
        },
        {
          "lang": "en",
          "product": "visualize",
          "overview": "A data visualization interface for Identity and Track, but capable of taking data feeds from virtually any source.",
          "date": "Q2 2018"
        },
        {
          "lang": "en",
          "product": "identity",
          "overview": "Guarantees uniqueness of individuals – and powers segmentation – for anonymous and known users.",
          "date": "Q1 2018"
        },
        {
          "lang": "en",
          "product": "match",
          "overview": "Taxonomic framework for automated content classification through machine learning. Plugs into Publish.",
          "date": "Q3 2018"
        },
        {
          "lang": "en",
          "product": "predict",
          "overview": "A machine learning  layer that predicts user behaviour at an individual level based on past interactions.",
          "date": "Q3 2018"
        },
        {
          "lang": "en",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "A lightweight, RSMQ-powered asynchronous task queue featuring simple task routing and throttling."
        },
        {
          "lang": "en",
          "product": "store",
          "overview": "A cloud storage solution for all types of data, with built-in security, privacy and redundancy.",
          "date": "Q1 2018"
        },
        {
          "lang": "de",
          "product": "api",
          "overview": "Eine high-performance RESTful API Oberfläche, gestaltet mit Unterstützung der API-first Entwicklung und den Prinzipe von COPE."
        },
        {
          "lang": "de",
          "product": "publish",
          "overview": "Das Fenster zur Welt der Inhaltsschaffung eines Autors. Flexible Oberflächen, gestaltet um den editoriellen Workflow zu optimieren."
        },
        {
          "lang": "de",
          "product": "cdn",
          "overview": "Eine Echtzeit Asset und Delivery Oberfläche, gestaltet als moderne, weltweite Content Distribution Lösung."
        },
        {
          "lang": "de",
          "product": "web",
          "overview": "Eine schemalose Vorlagenebene, die entweder als Standalone Plattform betrieben werden kann oder mit API als eine allumfassende Internetanwendung."
        },
        {
          "lang": "de",
          "product": "track",
          "overview": "Echtzeit und Streaming Datenoberfläche um maßgeschneiderte Lösungen auf der individuellen Ebene und der Produktebene zu garantieren. Betreibt DADI Identity.",
          "date": "Q1 2018"
        },
        {
          "lang": "de",
          "product": "visualize",
          "overview": "Eine Visualitierungsplattform für Daten aus Identity und Track, aber es ist möglich, Datenströme von jeder virtuellen Quelle zu erfassen.",
          "date": "Q2 2018"
        },
        {
          "lang": "de",
          "product": "identity",
          "overview": "Garantiert die Einzigartigkeit des Individuums - und ermöglicht Unterteilung - für anonyme und bekannte User.",
          "date": "Q1 2018"
        },
        {
          "lang": "de",
          "product": "match",
          "overview": "Taxonomische Rahmenbedingungen für automatisierte Inhaltsklassifikationen durch maschinelles Lernen. Als Plug-in für Publish möglich.",
          "date": "Q3 2018"
        },
        {
          "lang": "de",
          "product": "predict",
          "overview": "Maschinelle Lernoberfläche, die individuelles Benutzerverhalten basierend auf vergangenen Interaktionen vorhersagt.",
          "date": "Q3 2018"
        },
        {
          "lang": "de",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Eine leichte, RSMQ-angetriebene asynchrone Task-Warteschlange mit einfacher Task-Routing und Throttling."
        },
        {
          "lang": "de",
          "product": "store",
          "overview": "Eine Cloud-Speicherlösung für alle Arten von Dateien, welche Sicherheit, Datenschutz und Redundanz umfasst.",
          "date": "Q1 2018"
        },
        {
          "lang": "jp",
          "product": "api",
          "overview": "APIファーストの開発と、COPEの原則をサポートするように設計された高性能RESTful APIレイヤー。"
        },
        {
          "lang": "jp",
          "product": "publish",
          "overview": "コンテンツ制作の世界へのライターの窓口。編集ワークフローを最適化するように設計された柔軟なインターフェース。"
        },
        {
          "lang": "jp",
          "product": "cdn",
          "overview": "最新のグローバルコンテンツ配信ソリューションとして設計されたジャストインタイムでのアセット操作と配信レイヤー"
        },
        {
          "lang": "jp",
          "product": "web",
          "overview": "スキーマレスのテンプレートレイヤー。スタンドアロンのプラットフォームとしても、APIを使用してフルスタックのWebアプリケーションとしても動かすことができます。"
        },
        {
          "lang": "jp",
          "product": "track",
          "overview": "個別かつプロダクトレベルの正確なメトリックを提供するリアルタイムのストリーミングデータレイヤー。DADI Identifyを支えます。",
          "date": "Q1 2018"
        },
        {
          "lang": "jp",
          "product": "visualize",
          "overview": "IdentityとTrackのためのデータ可視化インターフェース。事実上あらゆるソースからデータフィードを取得することができます。",
          "date": "Q2 2018"
        },
        {
          "lang": "jp",
          "product": "identity",
          "overview": "個人の一意性の保証。さらに権限の区分け。匿名および既知のユーザのためのものです。",
          "date": "Q1 2018"
        },
        {
          "lang": "jp",
          "product": "match",
          "overview": "機械学習を通じた自動コンテンツ分類器のための分類学的フレームワーク。Publishに接続されます。",
          "date": "Q3 2018"
        },
        {
          "lang": "jp",
          "product": "predict",
          "overview": "過去のやりとりに基づいて個人レベルでのユーザの行動を予測する機械学習レイヤー。",
          "date": "Q3 2018"
        },
        {
          "lang": "jp",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "シンプルなタスクルーティングとスロットル機能を備えた、軽量でRSMQ対応の非同期タスクキュー。"
        },
        {
          "lang": "jp",
          "product": "store",
          "overview": "セキュリティ・秘匿性・冗長性を備えた、あらゆる種類のデータにお使いいただけるクラウドストレージソリューション。",
          "date": "Q1 2018"
        },
        {
          "lang": "fr",
          "product": "api",
          "overview": "Une couche API RESTful à haute performance conçue pour soutenir le premier développement de l'API et les principes de COPE."
        },
        {
          "lang": "fr",
          "product": "publish",
          "overview": "Une fenêtre d'écrivain vers le monde de la création de contenu. Des interfaces flexibles conçues pour optimiser le flux de travail éditorial."
        },
        {
          "lang": "fr",
          "product": "cdn",
          "overview": "Une solution de manipulation et de distribution d'actifs juste à temps conçue comme une solution de distribution de contenu mondiale moderne."
        },
        {
          "lang": "fr",
          "product": "web",
          "overview": "Une couche de modélisation sans schéma qui peut fonctionner comme une plate-forme autonome ou avec API en tant qu'application Web full stack."
        },
        {
          "lang": "fr",
          "product": "track",
          "overview": "Couche de données en temps réel en continu fournissant des mesures précises au niveau individuel et du produit. Dirige DADI Identity.",
          "date": "Q1 2018"
        },
        {
          "lang": "fr",
          "product": "visualize",
          "overview": "Une interface de visualisation de données pour Identity et Track, mais capable de prendre des flux de données de pratiquement n'importe quelle source.",
          "date": "Q2 2018"
        },
        {
          "lang": "fr",
          "product": "identity",
          "overview": "Garantit l'unicité des individus – et la segmentation des pouvoirs – pour les utilisateurs anonymes et connus.",
          "date": "Q1 2018"
        },
        {
          "lang": "fr",
          "product": "match",
          "overview": "Cadre taxonomique pour la classification automatisée du contenu par apprentissage machine. S'applique à la publication.",
          "date": "Q3 2018"
        },
        {
          "lang": "fr",
          "product": "predict",
          "overview": "Une couche d'apprentissage machine qui prédit le comportement de l'utilisateur à un niveau individuel en fonction des interactions passées.",
          "date": "Q3 2018"
        },
        {
          "lang": "fr",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Une ligne de tâches asynchrones légère et à assistance RSMQ offrant un routage et une limitation des tâches simples."
        },
        {
          "lang": "fr",
          "product": "store",
          "overview": "Une solution de stockage sur le cloud pour tous types de données, avec sécurité, confidentialité, et redondance intégrées.",
          "date": "Q1 2018"
        },
        {
          "lang": "es",
          "product": "api",
          "overview": "Una capa API de alto rendimiento diseñada para apoyar el desarrollo de API-first y los principios de COPE."
        },
        {
          "lang": "es",
          "product": "publish",
          "overview": "La ventana de un escritor al mundo de la creación de contenidos. Interfaces flexibles diseñadas para optimizar el flujo de trabajo editorial."
        },
        {
          "lang": "es",
          "product": "cdn",
          "overview": "Una capa de manipulación y entrega de activos justo a tiempo diseñada como solución moderna de distribución de contenido global."
        },
        {
          "lang": "es",
          "product": "web",
          "overview": "Una capa de plantilla sin esquema que puede funcionar como plataforma independiente o con API como aplicación web full stack."
        },
        {
          "lang": "es",
          "product": "track",
          "overview": "Capa de datos de streaming en tiempo real que proporciona métricas precisas a nivel individual y de producto. Dirige la Identidad de DADI.",
          "date": "Q1 2018"
        },
        {
          "lang": "es",
          "product": "visualize",
          "overview": "Una interfaz de visualización de datos para identidad y seguimiento, pero capaz de tomar canales de datos de prácticamente cualquier fuente.",
          "date": "Q2 2018"
        },
        {
          "lang": "es",
          "product": "identity",
          "overview": "Garantiza la unicidad de los individuos, y potencia la segmentación, para usuarios anónimos y conocidos.",
          "date": "Q1 2018"
        },
        {
          "lang": "es",
          "product": "match",
          "overview": "Marco taxonómico para la clasificación automatizada de contenido a través del aprendizaje automático. Se conecta a Publicar.",
          "date": "Q3 2018"
        },
        {
          "lang": "es",
          "product": "predict",
          "overview": "Una capa de aprendizaje automático que predice el comportamiento del usuario en un nivel individual en función de interacciones pasadas.",
          "date": "Q3 2018"
        },
        {
          "lang": "es",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Una cola de tareas asíncronas, ligera y RSMQ, que ofrece un enrutamiento y un estrangulamiento de tareas sencillos."
        },
        {
          "lang": "es",
          "product": "store",
          "overview": "Una solución de almacenamiento en la nube para todo tipo de datos, con seguridad, privacidad y redundancia integradas.",
          "date": "Q1 2018"
        },
        {
          "lang": "ru",
          "product": "api",
          "overview": "Высокопроизводительный REST-слой API поддерживает разработку по принципу API-first и соответствует принципам COPE."
        },
        {
          "lang": "ru",
          "product": "publish",
          "overview": "Окно писателя в мир создания контента. Гибкие интерфейсы, разработанные для оптимизации рабочей области редактирования."
        },
        {
          "lang": "ru",
          "product": "cdn",
          "overview": "Своевременный слой для передачи и управления ресурсами, разработанный в форме современного глобального решения для распределения контента."
        },
        {
          "lang": "ru",
          "product": "web",
          "overview": "Неструктурированный шаблонный слой, который может функционировать как автономная платформа или с API в качестве \"full stack\" веб-приложения."
        },
        {
          "lang": "ru",
          "product": "track",
          "overview": "Слой потоковых данных в режиме реального времени, обеспечивающий точные показатели на индивидуальном уровне и на уровне продукта. Обеспечивает работу DADI Identity.",
          "date": "Q1 2018"
        },
        {
          "lang": "ru",
          "product": "visualize",
          "overview": "Интерфейс визуализации данных для Identity и Track, однако способный получать данные из практически любого источника.",
          "date": "Q2 2018"
        },
        {
          "lang": "ru",
          "product": "identity",
          "overview": "Гарантирует уникальность индивидуумов и обеспечивает сегментацию для анонимных и известных пользователей.",
          "date": "Q1 2018"
        },
        {
          "lang": "ru",
          "product": "match",
          "overview": "Таксономический фреймворк для автоматизированной классификации контента с помощью машинного обучения. Подключается к Publish.",
          "date": "Q3 2018"
        },
        {
          "lang": "ru",
          "product": "predict",
          "overview": "Слой машинного обучения, который предсказывает поведение пользователя на индивидуальном уровне на основе прошлых взаимодействий.",
          "date": "Q3 2018"
        },
        {
          "lang": "ru",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Легкая, асинхронная очередь задач с поддержкой RSMQ с простой маршрутизацией задач и дросселированием."
        },
        {
          "lang": "ru",
          "product": "store",
          "overview": "Вариант облачного хранилища для всех типов данных со встроенной безопасностью, конфиденциальностью и резервированием.",
          "date": "Q1 2018"
        },
        {
          "lang": "pt",
          "product": "api",
          "overview": "Um serviço API RESTful de alta performance desenhada em suporte de um desenvolvimento API-first e dos princípios de COPE."
        },
        {
          "lang": "pt",
          "product": "publish",
          "overview": "A janela de um escritor para o mundo da criação de conteúdos. Interfaces flexíveis desenhados para optimizar o processo editorial."
        },
        {
          "lang": "pt",
          "product": "cdn",
          "overview": "Um serviço para manipulação de recursos just-in-time, desenhada para ser uma solução moderna de distribuição global de conteúdos."
        },
        {
          "lang": "pt",
          "product": "web",
          "overview": "Um serviço para templates sem lógica de negócio que pode operar sozinha ou com API, formando uma aplicação web full stack."
        },
        {
          "lang": "pt",
          "product": "track",
          "overview": "Um serviço de dados em tempo real, gerando métricas precisas ao nível do produto e do indivíduo. Alimenta o DADI Identity.",
          "date": "Q1 2018"
        },
        {
          "lang": "pt",
          "product": "visualize",
          "overview": "Um interface de visualização de dados para Identity e Track, mas capaz de monitorizar feeds de dados de praticamente qualquer fonte.",
          "date": "Q2 2018"
        },
        {
          "lang": "pt",
          "product": "identity",
          "overview": "Garante a unicidade de indivíduos - e gera a segmentação - para utilizadores anónimos e conhecidos.",
          "date": "Q1 2018"
        },
        {
          "lang": "pt",
          "product": "match",
          "overview": "Uma estrutura taxonómica para a classificação automática de conteúdos através de machine learning. Liga com Publish.",
          "date": "Q3 2018"
        },
        {
          "lang": "pt",
          "product": "predict",
          "overview": "Um serviço de machine learning que prevê o comportamento dos utilizadores a um nível individual, baseado em interacções passadas.",
          "date": "Q3 2018"
        },
        {
          "lang": "pt",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "Uma fila de tarefas assíncronas com suporte RSMQ, com roteamento e aceleração de tarefas simples."
        },
        {
          "lang": "pt",
          "product": "store",
          "overview": "Uma solução de armazenamento na nuvem para todos os tipos de dados, com segurança, privacidade e redundância integradas.",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hant",
          "product": "api",
          "overview": "為支援 API 優先開發模式和 COPE 原則所設計的高效能 RESTful API 層級架構。"
        },
        {
          "lang": "zh_hant",
          "product": "publish",
          "overview": "為作者提供一扇內容創建世界之窗。為優化編輯工作流程設計的彈性介面。"
        },
        {
          "lang": "zh_hant",
          "product": "cdn",
          "overview": "以現代、全球的內容分發解決方案來設計的及時資產操作與傳遞層級。"
        },
        {
          "lang": "zh_hant",
          "product": "web",
          "overview": "能以獨立平台或與 API 作為完整堆疊網路應用程式來作業的無綱要式模板層級。"
        },
        {
          "lang": "zh_hant",
          "product": "track",
          "overview": "即時的串流資料層級能為個人和產品層面提供準確的衡量指標。可用來驅動 DADI Identity。",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hant",
          "product": "visualize",
          "overview": "專為身分和追蹤設計的資料視覺化介面，但也能支援來自幾乎所有來源的資訊摘要。",
          "date": "Q2 2018"
        },
        {
          "lang": "zh_hant",
          "product": "identity",
          "overview": "為匿名和具名使用者確保個人獨特性與使用者權限區隔。",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hant",
          "product": "match",
          "overview": "為機器學習演算自動內容分類所設計的分類架構。讓發佈更具能量。",
          "date": "Q3 2018"
        },
        {
          "lang": "zh_hant",
          "product": "predict",
          "overview": "可依據先前互動預測個人層級使用者行為的機器學習層級。",
          "date": "Q3 2018"
        },
        {
          "lang": "zh_hant",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "A lightweight, RSMQ-powered asynchronous task queue featuring simple task routing and throttling."
        },
        {
          "lang": "zh_hant",
          "product": "store",
          "overview": "可供所有類型資料使用的雲端儲存解決方案，具備內建安全性、隱私以及備援功能。",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hans",
          "product": "api",
          "overview": "高性能 RESTful API 层，其设计支持 API 优先开发和 COPE 原则。"
        },
        {
          "lang": "zh_hans",
          "product": "publish",
          "overview": "写作者通往内容创作世界的一个窗口。灵活的界面，采用了编辑工作流程优化设计。"
        },
        {
          "lang": "zh_hans",
          "product": "cdn",
          "overview": "即时 (JIT) 素材处理和交付层，采用了现代化全球内容分发解决方案设计。"
        },
        {
          "lang": "zh_hans",
          "product": "web",
          "overview": "无模式模板层，可作为独立平台运行，也可作为完整的堆栈 Web 应用程序与 API 配合运行。"
        },
        {
          "lang": "zh_hans",
          "product": "track",
          "overview": "实时流处理数据层，在个人和产品层提供准确的指标。驱动 DADI Identity。",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hans",
          "product": "visualize",
          "overview": "一种用于标识和跟踪的数据可视化界面，但可以采用几乎任何来源的数据馈送。",
          "date": "Q2 2018"
        },
        {
          "lang": "zh_hans",
          "product": "identity",
          "overview": "保证匿名和已知用户的个体唯一性，并支持细分。",
          "date": "Q1 2018"
        },
        {
          "lang": "zh_hans",
          "product": "match",
          "overview": "分类框架，可通过机器学习自动完成内容分类。插入式发布。",
          "date": "Q3 2018"
        },
        {
          "lang": "zh_hans",
          "product": "predict",
          "overview": "一个机器学习层，可根据过去的互动在个体层面预测用户行为。",
          "date": "Q3 2018"
        },
        {
          "lang": "zh_hans",
          "product": "queue",
          "url": "https://github.com/dadi/queue",
          "overview": "A lightweight, RSMQ-powered asynchronous task queue featuring simple task routing and throttling."
        },
        {
          "lang": "zh_hans",
          "product": "store",
          "overview": "一种适用于所有数据类型的云存储解决方案，内置安全、隐私和冗余功能。",
          "date": "Q1 2018"
        }
      ]
    }
  }
}
