{
  "datasource": {
    "key": "products-list",
    "name": "Information about DADI products",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "product": "api",
          "overview": "A high-performance RESTful API layer designed in support of API-first development and the principles of COPE."
        },
        {
          "lang": "en",
          "product": "publish",
          "overview": "A writer’s window to the world of content creation. Flexible interfaces designed to optimise editorial workflow."
        },
        {
          "lang": "en",
          "product": "cdn",
          "overview": "A just-in-time asset manipulation and delivery layer designed as a modern, global content distribution solution."
        },
        {
          "lang": "en",
          "product": "web",
          "overview": "A schemaless templating layer that can operate as a standalone platform or with API as a full stack web application."
        },
        {
          "lang": "en",
          "product": "track",
          "overview": "Real-time, streaming data layer providing accurate metrics at individual and product level. Drives DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "en",
          "product": "visualize",
          "overview": "A data visualization interface for Identity and Track, but capable of taking data feeds from virtually any source.",
          "date": "Q2 2018"
        },
        {
          "lang": "en",
          "product": "identity",
          "overview": "Guarantees uniqueness of individuals – and powers segmentation – for anonymous and known users.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "en",
          "product": "match",
          "overview": "Taxonomic framework for automated content classification through machine learning. Plugs into Publish.",
          "date": "Q3 2017"
        },
        {
          "lang": "en",
          "product": "predict",
          "overview": "A machine learning  layer that predicts user behaviour at an individual level based on past interactions.",
          "date": "Q4 2017"
        },
        {
          "lang": "de",
          "product": "api",
          "overview": "Eine high-performance RESTful API Oberfläche, gestaltet mit Unterstützung der API-first Entwicklung und den Prinzipe von COPE."
        },
        {
          "lang": "de",
          "product": "publish",
          "overview": "Das Fenster zur Welt der Inhaltsschaffung eines Autors. Flexible Oberflächen, gestaltet um den editoriellen Workflow zu optimieren."
        },
        {
          "lang": "de",
          "product": "cdn",
          "overview": "Eine Echtzeit Asset und Delivery Oberfläche, gestaltet als moderne, weltweite Content Distribution Lösung."
        },
        {
          "lang": "de",
          "product": "web",
          "overview": "Eine schemalose Vorlagenebene, die entweder als Standalone Plattform betrieben werden kann oder mit API als eine allumfassende Internetanwendung."
        },
        {
          "lang": "de",
          "product": "track",
          "overview": "Echtzeit und Streaming Datenoberfläche um maßgeschneiderte Lösungen auf der individuellen Ebene und der Produktebene zu garantieren. Betreibt DADI Identity.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "de",
          "product": "visualize",
          "overview": "Eine Visualitierungsplattform für Daten aus Identity und Track, aber es ist möglich, Datenströme von jeder virtuellen Quelle zu erfassen.",
          "date": "Q2 2018"
        },
        {
          "lang": "de",
          "product": "identity",
          "overview": "Garantiert die Einzigartigkeit des Individuums - und ermöglicht Unterteilung - für anonyme und bekannte User.",
          "date": "Q3/4 2017"
        },
        {
          "lang": "de",
          "product": "match",
          "overview": "Taxonomische Rahmenbedingungen für automatisierte Inhaltsklassifikationen durch maschinelles Lernen. Als Plug-in für Publish möglich.",
          "date": "Q3 2017"
        },
        {
          "lang": "de",
          "product": "predict",
          "overview": "Maschinelle Lernoberfläche, die individuelles Benutzerverhalten basierend auf vergangenen Interaktionen vorhersagt.",
          "date": "Q4 2017"
        },
        {
          "lang": "jp",
          "product": "api",
          "overview": "APIファーストの開発と、COPEの原則をサポートするように設計された高性能RESTful APIレイヤー。"
        },
        {
          "lang": "jp",
          "product": "publish",
          "overview": "コンテンツ制作の世界へのライターの窓口。編集ワークフローを最適化するように設計された柔軟なインターフェース。"
        },
        {
          "lang": "jp",
          "product": "cdn",
          "overview": "最新のグローバルコンテンツ配信ソリューションとして設計されたジャストインタイムでのアセット操作と配信レイヤー"
        },
        {
          "lang": "jp",
          "product": "web",
          "overview": "スキーマレスのテンプレートレイヤー。スタンドアロンのプラットフォームとしても、APIを使用してフルスタックのWebアプリケーションとしても動かすことができます。"
        },
        {
          "lang": "jp",
          "product": "track",
          "overview": "個別かつプロダクトレベルの正確なメトリックを提供するリアルタイムのストリーミングデータレイヤー。DADI Identifyを支えます。",
          "date": "Q3/4 2017"
        },
        {
          "lang": "jp",
          "product": "visualize",
          "overview": "IdentityとTrackのためのデータ可視化インターフェース。事実上あらゆるソースからデータフィードを取得することができます。",
          "date": "Q2 2018"
        },
        {
          "lang": "jp",
          "product": "identity",
          "overview": "個人の一意性の保証。さらに権限の区分け。匿名および既知のユーザのためのものです。",
          "date": "Q3/4 2017"
        },
        {
          "lang": "jp",
          "product": "match",
          "overview": "機械学習を通じた自動コンテンツ分類器のための分類学的フレームワーク。Publishに接続されます。",
          "date": "Q3 2017"
        },
        {
          "lang": "jp",
          "product": "predict",
          "overview": "過去のやりとりに基づいて個人レベルでのユーザの行動を予測する機械学習レイヤー。",
          "date": "Q4 2017"
        }
      ]
    }
  }
}
