{
  "datasource": {
    "key": "security",
    "requestParams": [
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "title": "Secure Access",
          "body": "Out of the box, DADI access passwords are encrypted, salted and repeatedly hashed.\n\nIndustry standard authentication practices are fully supported, including SSL and 2-factor authentication."
        },
        {
          "lang": "en",
          "title": "Granular User Access Control",
          "body": "DADI provides administrators with complete control over who can see and who can modify every part of a product. DADI operates based on a system of extensible user roles and access permissions.\n\nAdministrators can create user roles and give them specific, limited permissions. For example, your editorial interfaces might need an author role that can create and update content, but not publish or delete it (permissions reserved for the editor role), while administrative settings are reserved for a separate role entirely. Authenticated users can be assigned any number of roles, and their permissions are cumulative. Menu links and features are automatically hidden from users who do not have appropriate access."
        },
        {
          "lang": "en",
          "title": "Data Encryption",
          "body": "In high security applications, DADI can be configured for extremely strong data encryption.\n\nWhen whole-database encryption is not desired, very high granularity is available to protect more specific information: user accounts, specific forms, and even the values of specific fields can be encrypted. The encryption system can be configured to pass the strictest PCI, HIPAA, and state privacy laws, including offsite encryption key management."
        },
        {
          "lang": "en",
          "title": "Preventing XSS, CSRF, and other malicious data entry",
          "body": "DADI’s Events layer ensures that data is validated and scrubbed before entry into your data layer. The system tests all given data to ensure that it matches prescribed, expected formats and values.\n\nTokens are injected into front end forms as they are generated, to protect against potential CSRF attacks.\n\nThe complete separation of concerns within DADI enables every layer within your platform - Your API, templating system, editorial interfaces, tracking tools etc. - to perform and handle security checks appropriate to their concerns independently."
        },
        {
          "lang": "en",
          "title": "Brute Force Detection",
          "body": "DADI protects against brute-force password attacks by limiting the number of login attempts from a single IP address and username over a predefined period of time."
        },
        {
          "lang": "en",
          "title": "Mitigating Denial of Service (DoS) Attacks",
          "body": "DADI supports comprehensive caching in every layer of your platform. Shared caching support via Redis, local caching and client caching approaches are all available as part of the core application set.\n\nThis multi-layered cache architecture is extremely resistant to high volumes of traffic, and makes DADI the system of choice for some of the world’s highest-traffic properties."
        },
        {
          "lang": "de",
          "title": "Sicherer Zugang",
          "body": "Out of the box, DADI Zugriffspasswörter sind verschlüsselt, salted und mehrfach gehasht.\n\nStandards der Authentifizierung aus der Industrie werden ganzheitlich unterstützt, miteingeschlossen SSL und Zwei-Faktor-Authentifizierung."
        },
        {
          "lang": "de",
          "title": "Granulare Benutzerzugangskontrolle",
          "body": "DADI stattet Administratoren mit der kompletten Kontrolle darüber aus, wer einzelne Teile des Produkts sehen und bearbeiten kann. DADI arbeitet auf Grundlage von erweiterbaren Benutzerkonten und Zugriffsberechtigungen.\n\nAdministratoren können Benutzerkonten erstellen und ihnen spezielle, begrenzte Rechte geben. Zum Beispiel benötigt die editorielle Oberfläche ein Autorenkonto, mit dem man Inhalt erstellen und updaten kann, aber nicht veröffentlichen oder löschen kann (dieses Recht ist dem Editor Konto vorbehalten), während die Administratorenrechte einem komplett gesonderten Konto zugewiesen sind. Authentifizierten Benutzern können eine Reihe von Konten zugewiesen werden und ihre Zugriffsrechte sind kumulativ. Menüeinträge und Funktionen werden automatisch für Benutzer ausgeblendet, die nicht die entsprechende Zugriffsberechtigung haben."
        },
        {
          "lang": "de",
          "title": "Datenverschlüsselung",
          "body": "Für Hochsicherheitsanwedungen kann DADI auf extrem strenge Datenverschlüsselung konfiguriert werden.\n\nWenn eine komplette Datenbankverschlüsselung nicht gewünscht ist, ist ein hohes Maß an Granularität verfügbar um eher spezielle Informationen zu schützen: Benutzeraccounts, spezielle Formulare, und sogar der Wert einzelner Felder kann verschlüsselt werden. Das Verschlüsselungssystem kann so konfiguriert werden, dass es auch die strengsten PCI, HPAA und Datenschutzgesetze aller Staaten, inklusive eines Offsite Verschlüsselungs Key Management Systems, erfüllt."
        },
        {
          "lang": "de",
          "title": "Verhindern von XSS, CSRF, und anderen schädlichen Dateneinträgen",
          "body": "DADIs Events Oberfläche stellt sicher, dass Daten validiert und bereinigt werden, bevor sie den Weg in ihre Datenoberfläche finden. Das System testet alle existierenden Daten, um sicherzustellen, dass diese die vorgeschriebenen und erwarteten Formate und Werte erfüllen.\n\nIn den Frontendformularen werden Tokens eingefügt, um sie gegen potentielle CSRF Attacken zu schützen. Die komplette Teilung der Zuständigkeiten innerhalb DADI erlaubt es jeder Oberfläche der Plattform - Ihrem API, Vorlagensysteme, Editorielle Schnittstellen, Tracking tools, etc. - Sicherheitsüberprüfungen, gemäß ihrer Belange, unabhängig zu bedienen und durchzuführen" 
        },
        {
          "lang": "de",
          "title": "Brute Force Detection",
          "body": "DADI schützt sich gegen Brute-Force Passwort Attacken, indem es die Nummer der Anmeldeversuche von einer einzigen IP Adresse und einem Usernamen über eine vorher festgelegte Zeitperiode limitiert."
        },
        {
          "lang": "de",
          "title": "Entschärfen von Denial of Service (DoS) Attacken",
          "body": "DADI unterstützt allumfassendes Chaching auf jeder Oberfläche der Plattform. Unterstützung durch gemeinsames Caching durch Redis, lokales Caching und Client Caching Methoden sind als Teil des Kernanwendungssatzes verfügbar.\n\nDiese mehrlagige Cachestruktur ist extrem widerstandsfähig gegenüber hohem Aufkommen von Traffic und das macht DADI zu dem System der Wahl bei einigen der höhsten Trafficaufkommen der Welt."
        }, 
        {
          "lang": "jp",
          "title": "セキュアアクセス",
          "body": "箱から取り出してDADIのアクセス・パスワードは暗号化されて、ソルトが付与され、繰り返しハッシュ計算されます。\n\nSSLや2要素認証を含む業界標準の認証方法が完全にサポートされています。"
        },
        {
          "lang": "jp",
          "title": "粒度の細かいユーザーアクセス制御",
          "body": "DADIは、プロダクトの全ての部分について、誰が閲覧したり変更したりできるかの完全な制御を管理者に与えます。DADIは、拡張可能なユーザーロールとアクセス許可のシステムに基づいて動作します。\n\n管理者はユーザーロールを作成して、特定の制限付きのアクセス許可を与えることができます。たとえば、編集者のインターフェースには、コンテンツを作成および更新できるが公開や削除はできないという執筆者ロール (エディタロール用に用意されている権限) が必要でしょう。一方で、管理者の設定は別の役割のために予約されています。認証されたユーザーには、任意の数のロールを割り当てることができ、その権限は重複可能です。メニューのリンクや機能は、適切なアクセス権を持たないユーザーから自動的に隠されます。"
        },
        {
          "lang": "jp",
          "title": "データ暗号化",
          "body": "高度なセキュリティアプリケーションでは、DADIは非常に強力なデータ暗号を行う設定にすることができます。\n\nデータベース全体の暗号化が望まれない場合、特定の情報を保護するために、非常に細かい細分化が利用できます。ユーザーアカウント、特定のフォーム、特定のフィールドの値を暗号化することができます。暗号化システムは、オフサイトの暗号化キー管理を含む厳密なPCI、HIPAA、および州のプライバシー法を通過するように設定できます。"
        },
        {
          "lang": "jp",
          "title": "XSS、CSRF、その他の悪意のあるデータ入力を防止する",
          "body": "DADIのEventsレイヤーでは、データレイヤーに入る前にデータの検証と洗浄が行われます。システムは、指定されたすべてのデータをテストして、規定されたフォーマットや値と一致することを確認します。\n\n潜在的なCSRF攻撃から保護するために、トークンは生成時にフロントエンドのフォームに投入されます。\n\nDADI内の懸念を完全に分離することで、プラットフォーム内の各レイヤー (API、テンプレートシステム、編集インターフェース、トラッキングツールなど) が、自分の懸念に適したセキュリティチェックを個別に実行して取り扱うことができます。"
        },
        {
          "lang": "jp",
          "title": "ブルートフォース検出",
          "body": "DADIは、事前定義された期間にわたって同一のIPアドレスとユーザー名からのログイン試行回数を制限することにより、ブルートフォースパスワード攻撃から保護します。"
        },
        {
          "lang": "jp",
          "title": "サービス拒否 (DoS) 攻撃の緩和",
          "body": "DADIは、プラットフォームの各レイヤーにおける包括的なキャッシュをサポートしています。Redisによる共有キャッシングのサポート、ローカルキャッシングおよびクライアントキャッシングのアプローチはすべて、コアアプリケーションセットの一部として利用できます。\n\nこのマルチレイヤーのキャッシュ構造は大量のトラフィックに非常に強く、DADIを世界で最もトラフィックの多い施設のいくつかにより選択されるシステムとしました。"
        },
        {
          "lang": "fr",
          "title": "Accès sécurisé",
          "body": "Les mots de passe d'accès DADI originaux sont cryptés, salés et hachés à plusieurs reprises.\n\nLes pratiques d'authentification standard de l'industrie sont entièrement compatibles, y compris l'authentification SSL et à deux facteurs "
        },
        {
          "lang": "fr",
          "title": "Contrôle d'accès à l'utilisateur granulaire",
          "body": "DADI fournit aux administrateurs un contrôle total sur les personnes qui peuvent voir et qui peuvent modifier chaque partie d'un produit. DADI fonctionne en fonction d'un système de rôles d'utilisateur extensibles et d'autorisations d'accès.\n\nLes administrateurs peuvent créer des rôles utilisateur et leur donner des autorisations spécifiques et limitées. Par exemple, vos interfaces éditoriales peuvent avoir besoin d'un rôle d'auteur qui peut créer et mettre à jour le contenu, mais ne pas le publier ou le supprimer (autorisations réservées au rôle de l'éditeur), alors que les paramètres administratifs sont entièrement réservés pour un rôle distinct. Les utilisateurs authentifiés peuvent recevoir n'importe quel nombre de rôles et leurs autorisations sont cumulatives. Les liens et les fonctionnalités du menu sont automatiquement cachés aux utilisateurs qui n'ont pas l'accès approprié."
        },
        {
          "lang": "fr",
          "title": "Cryptage des données",
          "body": "Dans les applications de haute sécurité, DADI peut être configuré pour un cryptage de données extrêmement important.\n\nLorsque le cryptage de la base de données complète n'est pas souhaité, une granularité très élevée est disponible pour protéger des informations plus spécifiques : les comptes d'utilisateurs, les formulaires spécifiques et même les valeurs de champs spécifiques peuvent être cryptées. Le système de cryptage peut être configuré pour passer les lois PCI, HIPAA et de confidentialité d'état les plus strictes, y compris la gestion des clés de cryptage hors site."
        },
        {
          "lang": "fr",
          "title": "Prévenir XSS, CSRF et autres saisies de données malveillantes",
          "body": "La couche d'événements de DADI garantit que les données sont validées et effacées avant d'entrer dans votre couche de données. Le système teste toutes les données saisies afin de s'assurer qu'elles correspondent aux formats et aux valeurs prescrits et attendus.\n\nLes jetons sont injectés dans les formulaires front end puisqu'ils sont générés, pour protéger contre les éventuelles attaques CSRF.\n\nLa séparation complète des problèmes au sein de DADI permet à chaque couche de votre plate-forme - votre API, votre système de planification, vos interfaces éditoriales, vos outils de suivi, etc. - d'effectuer et de gérer des contrôles de sécurité appropriés à leurs problèmes indépendamment."
        },
        {
          "lang": "fr",
          "title": "Détection de la force brute",
          "body": "DADI protège contre les attaques par mot de passe de force brute en limitant le nombre de tentatives de connexion d'une seule adresse IP et d'un nom d'utilisateur pendant une période prédéfinie"
        },
        {
          "lang": "fr",
          "title": "Atténuer les interdictions de déni de service (DoS)",
          "body": "DADI prend en charge la mise en cache complète dans chaque couche de votre plate-forme. La prise en charge de mise en cache partagée via Redis, la mise en cache locale et les approches de mise en cache des clients sont tous disponibles dans le cadre du jeu d'applications principal.\n\nCette architecture de cache multi-couches est extrêmement résistante aux grands volumes de trafic et fait de DADI le système de choix pour certaines des propriétés les plus performantes du monde."
        },
        {
          "lang": "es",
          "title": "Acceso seguro",
          "body": "Las creativas contraseñas de acceso DADI están cifradas, saladas y troceadas repetidamente.\n\nLas prácticas de autenticación estándar de la industria son totalmente compatibles, incluyendo SSL y autenticación de dos factores."
        },
        {
          "lang": "es",
          "title": "Control de acceso de usuario granular",
          "body": "DADI proporciona a los administradores un control completo sobre quién puede ver y quién puede modificar cada parte de un producto... DADI opera basado en un sistema de funciones de usuario extensibles y permisos de acceso.\n\nLos administradores pueden crear funciones de usuario y otorgarles permisos específicos y limitados. Por ejemplo, es posible que sus interfaces editoriales necesiten un rol de autor que pueda crear y actualizar contenido, pero no publicarlo o eliminarlo (permisos reservados para el rol de editor), mientras que las configuraciones administrativas están reservadas para un rol independiente. A los usuarios autenticados se les puede asignar cualquier número de funciones y sus permisos son acumulativos. Los vínculos y funciones de los menús se ocultan automáticamente a los usuarios que no tienen acceso adecuado."
        },
        {
          "lang": "es",
          "title": "Cifrado de datos",
          "body": "En aplicaciones de alta seguridad, DADI se puede configurar para un cifrado de datos extremadamente fuerte.\n\nCuando no se desea cifrar toda la base de datos, se dispone de granularidad muy alta para proteger información más específica: se pueden cifrar las cuentas de usuario, formularios específicos e incluso los valores de campos específicos. El sistema de encriptación puede configurarse para que se ajuste a las más estrictas leyes de privacidad de PCI, HIPAA y estado, incluyendo la administración de claves de encriptación externa."
        },
        {
          "lang": "es",
          "title": "Prevención de XSS, CSRF y otros datos maliciosos",
          "body": "La capa de eventos de DADI asegura que los datos se validan y se depuran antes de entrar en su capa de datos. El sistema prueba todos los datos dados para asegurar que coinciden con los formatos y valores prescritos y esperados.\n\nLos tokens se inyectan en las formas front end mientras se generan, para protegerse contra posibles ataques CSRF.\n\nLa completa separación de las preocupaciones dentro de DADI permite que cada capa dentro de su plataforma, su API, sistema de plantillas, interfaces editoriales, herramientas de seguimiento, etc, lleve a cabo y maneje las verificaciones de seguridad adecuadas a sus preocupaciones de forma independiente "
        },
        {
          "lang": "es",
          "title": "Detección de Fuerza Bruta",
          "body": "DADI protege contra ataques de contraseña de fuerza bruta al limitar el número de intentos de inicio de sesión desde una única dirección IP y nombre de usuario durante un período de tiempo predefinido."
        },
        {
          "lang": "es",
          "title": "Mitigación de ataques de denegación de servicio (DoS)",
          "body": "DADI es compatible con el almacenamiento en caché completo en cada capa de su plataforma. La compatibilidad del almacenamiento en caché compartido a través de Redis, el almacenamiento en caché local y los métodos de almacenamiento en caché de clientes están disponibles en el marco del conjunto de aplicaciones principales.\n\nEsta arquitectura de caché de capas múltiples es extremadamente resistente a grandes volúmenes de tráfico y hace que DADI sea el sistema de elección para algunas de las propiedades de mayor tráfico del mundo."
        },
        {
          "lang": "ru",
          "title": "Безопасный доступ",
          "body": "Изначально пароли доступа DADI шифруются, солятся и неоднократно хэшируются.\n\nПолностью поддерживаются характерные для отрасли стандартные методы проверки подлинности, включая SSL и двухфакторную аутентификацию."
        },
        {
          "lang": "ru",
          "title": "Гранулированный контроль доступа пользователей",
          "body": "DADI предоставляет администраторам полный контроль над тем, кто может видеть и модифицировать каждый компонент продукта. DADI работает на базе системы расширяемых пользовательских ролей и прав доступа.\n\nАдминистраторы могут создавать пользовательские роли и предоставлять им определенные ограниченные разрешения. Например, для ваших редакторских интерфейсов нужна роль автора, который может создавать и обновлять контент, но не публиковать и удалять его (данные права зарезервированы для роли редактора), при этом административные настройки зарезервированы для совершенно отдельной роли. Аутентифицированные пользователи могут иметь любое количество ролей, а их права являются накопительными. Ссылки и функции в меню автоматически скрываются от пользователей, у которых нет соответствующих прав."
        },
        {
          "lang": "ru",
          "title": "Шифрование данных",
          "body": "Для приложений с высокой степенью защиты в настройках DADI можно включить максимально сильное шифрование данных.\n\nКогда шифрование всей базы данных не требуется, доступна очень высокая степень гранулярности для защиты конкретной информации — аккаунтов пользователей, определенных форм и даже значений определенных полей. Систему шифрования можно настроить таким образом, что она будет соответствовать самым строгим стандартам PCI, HIPAA и государственных законов о защите данных, включая удаленное управление ключами шифрования."
        },
        {
          "lang": "ru",
          "title": "Предотвращение XSS, CSRF и других видов вредоносного ввода данных",
          "body": "Слой событий DADI гарантирует, что данные тщательно проверяются перед поступлением в ваш слой данных. Система проверяет все данные, чтобы убедиться, что они соответствуют предписанным и ожидаемым форматам и значениям.\n\nПо мере генерации front-end форм в них внедряются токены для защиты от потенциальных CSRF-атак.\n\nПолное разделение задач внутри DADI позволяет каждому слою вашей платформы — вашему API, редакторским интерфейсам, инструментам отслеживания и др. — независимо выполнять и контролировать проверки безопасности, соответствующие их потребностям."
        },
        {
          "lang": "ru",
          "title": "Выявление атак методом \"грубой силы\"",
          "body": "DADI защищает от парольных атак методом \"грубой силы\", ограничивая количество попыток входа в систему с одного IP-адреса и от одного имени пользователя в течение заданного периода времени."
        },
        {
          "lang": "ru",
          "title": "Устранение атак типа \"Отказ в обслуживании\" (DoS)",
          "body": "DADI поддерживает всестороннее кэширование в каждом слое вашей платформы. В рамках основного набора приложений доступна поддержка общего кэширования с помощью Redis, локального кэширования и кэширования клиентов.\n\nЭта многоуровневая архитектура кэширования чрезвычайно устойчива к большим объемам трафика, что делает DADI оптимальной системой для площадок с самыми высокими показателями трафика в мире."
        },
        {
          "lang": "pt",
          "title": "Acesso seguro",
          "body": "Por defeito, passwords de acesso DADI são encriptadas, \"salteadas\" e repetidamente \"hashed\".\n\nPráticas de autenticação que são padrões de indústria são totalmente suportadas, incluindo SSL e autenticação de 2 factores."
        },
        {
          "lang": "pt",
          "title": "Controlo Granular de Acesso de Utilizadores",
          "body": "DADI oferece aos administradores controlo completo sobre quem pode ver e quem pode modificar cada parte do produto. DADI opera sobre um sistema de tipos de utilizador e permissões de acesso extensíveis.\n\nOs administradores podem criar tipos de utilizador e dar-lhes permissões específicas e limitadas. Por exemplo, os teus interfaces editoriais podem necessitar de um autor que possa criar e actualizar conteúdo, mas não publicar ou apagar (permissões reservadas ao tipo de utilizador \"editor\"), ao passo que configurações administrativas estão reservadas para um tipo de utilizador completamente diferente. Utilizadores autenticados podem ter um número infinito de tipos e as suas permissões são acumulativas. Links em menus e funcionalidades são automaticamente escondidas de utilizadores que não tenham o nível de acesso necessário."
        },
        {
          "lang": "pt",
          "title": "Encriptação de Dados",
          "body": "Em aplicações de alta segurança, DADI pode ser configurado para ter uma forte encriptação de dados.\n\nQuando encriptação total ao nível da base de dados não é necessária, é possível proteger informação mais específica com grande granularidade: contas de utilizador, formulários específicos, e até os valores de determinados campos podem ser encriptados. O sistema de encriptação pode ser configurado para passar as rigorosas PCI, HIPAA, e as leis estatais de privacidade, incluindo a gestão externa de chaves de encriptação."
        },
        {
          "lang": "pt",
          "title": "Prevenir XSS, CSRF, e outras tentativas maliciosas de introdução de dados",
          "body": "A camada de Eventos DADI garante que os dados são validados e passados a pente fino antes de entrarem na tua camada de dados. O sistema testa todos os dados para garantir que cumpre todos os formatos e valores prescritos e esperados.\n\nSão inseridas chaves (tokens) nos formulários front-end à medida que estes são gerados, por forma a evitar ataques CSRF.\n\nEsta completa separação de responsabilidades na plataforma DADI permite que cada camada – a tua API, o teu sistema de templates, interfaces editoriais, ferramentas de tracking, etc. – acarretem testes de segurança adequados às suas responsabilidades independentemente."
        },
        {
          "lang": "pt",
          "title": "Detecção de Força Bruta",
          "body": "DADI protege contra ataques a passwords por força bruta limitando o número de tentativas de login feitas de um único endereço de IP e username dentro de um determinado período de tempo."
        },
        {
          "lang": "pt",
          "title": "Mitigando Ataques Denial of Service (DoS)",
          "body": "DADI suporta caching completo em todas as camadas da tua plataforma. Partilha de suporte de cache via Redis, cache local e cache no cliente são todas abordagens disponíveis, parte do núcleo de aplicações.\n\nEsta arquitectura multi-cache é extremamente resistente a altos volumes de tráfego, e torna DADI o sistema escolhido para algumas das propriedades com maior tráfego no mundo."
        },
        {
          "lang": "zh_hant",
          "title": "安全的資料存取",
          "body": "DADI 提供開箱即用功能，所有存取的密碼皆會經加密、加料並重覆雜湊。"
        },
        {
          "lang": "zh_hant",
          "title": "精細用戶存取控制",
          "body": "DADI 提供管理者對瀏覽和修改任何產品部分的完整權限控制。DADI 的作業基礎是一座可延伸使用者角色和存取權限的系統。\n\n管理者可建立使用者角色並授予特定及有限的權限。舉例來說，你的編輯工作介面可能需要的是一名可以創作和更新內容的作者角色，而非發表或刪除內容（此權限保留給編輯），而管理設定權限則完整保留給另外一個不同角色。已驗證的使用者可進行分配任何數量的角色，且擁有累進式的權限。選單連結和功能則可對無相關存取權限的使用者自動隱藏。"
        },
        {
          "lang": "zh_hant",
          "title": "資料加密技術",
          "body": "在高度安全等級的應用程式，DADI 能用來配置安全性極強的資料加密。\n\n當整個"
        },
        {
          "lang": "zh_hant",
          "title": "防止跨站指令碼 (XSS)、跨站偽造請求 (CSRF) 及其他惡意程式入侵",
          "body": "DADI 的事件層級能確保資料在進入你的資料層級之前經過驗證及洗滌。系統將全面測試所有資料來確保能符合指定及預期的格式和數值。符記在生成的同時將會被注入字型和前端模型來防禦潛在的跨站請求偽造攻擊。\n\nDADI 系統內的完整關注點分離可啟動你平台內的每一層級——你的 API、模板系統、編輯介面、追蹤工具等——來獨立執行處理適合各個不同關注點的安全性檢查"
        },
        {
          "lang": "zh_hant",
          "title": "暴力攻擊偵測",
          "body": "DADI 能藉由限制同一 IP 地址和用戶名稱在預設時間內的登入嘗試次數來防禦暴力密碼攻擊"
        },
        {
          "lang": "zh_hant",
          "title": "防禦 DoS 阻斷服務攻擊",
          "body": "DADI 能全面支援你所有平台層級的快取。經由 Redis、本地快取和用戶端快取方式的共享快取支援皆在我們核心應用程式組合中提供的服務內容。\n\n這項多層的快取架構不但可強力抵抗高資料流量，也讓 DADI 成為世界上具高流量性能的最佳系統選擇之一。"
        },
      ]
    }
  }
}