{
  "datasource": {
    "key": "successes",
    "name": "DADI platform case studies",
    "requestParams": [
      {
        "param": "client",
        "field": "handle"
      },
      {
        "param": "lang",
        "field": "lang"
      }
    ],
    "source": {
      "type": "static",
      "data": [
        {
          "lang": "en",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "End-to-end rebuild on DADI technology to optimize workflow, improve engagement and support new commercial opportunity.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? was built on an ageing legacy platform that presented a brittle, desktop-only user experience with multiple disconnected editorial workstreams. New systems were required so that writers could spend more time on content than admin – and users could have a seamless experience across devices.",
          "results": "DADI technology delivers an API-first platform solution that abstracts content from presentation, meaning one pot of content and one editorial workflow can feed multiple digital products across desktop, tablet and mobile.",
          "detail": "Haymarket Media group chose to use DADI technology to deliver a rebuild of whatcar.com, which used a mix of ageing technology that placed excessive demands on editorial resource and provided a poor user experience.\n\nIn-house developers worked in collaboration with DADI engineers and strategists against a new, iterative product roadmap – fixing the many shortcomings of the legacy platform and extending a 'reviews' website into a full car-buying retail service.\n\nA new content store and management interface was developed, tailored to editorial workflow requirement and capable of powering desktop, tablet, mobile and future products from a single source. This was then integrated with an updated fully responsive front-end designed with future content personalisation in mind – based on usage data collected by the DADI platform. It is a model bend of content and commerce.",
          "quote": {
            "body": "Moving whatcar.com to DADI significantly reduced our infrastructure costs",
            "cite": "Product Lead, **Haymarket Consumer Media**"
          },
          "captions": [
            "Whatcar.com responsive homepage.",
            "Combining multiple data sources to reveal new insights.",
            "Full screen image galleries showcase the great editorial photography.",
            "Design work for the much respected What Car? Car of the Year Awards."
          ]
        },
        {
          "lang": "en",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "A new platform built in support of single user and subscriber view – and to power a full suite of digital product from browser to app.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocle digital products were driven by a disconnected platform with no correlation between magazine subscribers, shop customers and website users. A new solution was needed to facilitate single subscriber view across web and mobile – and drive a focussed CRM strategy.",
          "results": "The DADI platform underpins a new data driven strategy that identifies the individual and optimizes user experience, delivering an 88% increase in visitors, 49% more registered users, 25% greater shop sales and a 44% increase in paid subscribers – and inside six months.",
          "detail": "Monocle uses DADI technology to power an enhanced CRM strategy across print, digital, radio and retail. It pulls all user data into a single pot and works to provide a seamless data driven experience to rival the premium service found in physical Monocle stores.\n\nA single user record supports registration with digital product, sign up to email bulletins, purchases made in the Monocle Shop plus both digital and magazine subscriptions. This has allowed for more targeted messaging which is more effective for both brand and users alike.\n\nThe DADI platform also manages editorial content across browser site and apps, while our enterprise support team has been working in co-development with engineers at Monocle offering support ranging from tech heavy lifting to UX and design – a partnership that has rewarded Monocle.com with several awards for its digital product.",
          "quote": {
            "body": "DADI technology made sense of our user data and enabled a premium online experience of the quality our readers find in print.",
            "cite": "Head of Digital, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Site-wide solution: from the homepage to the shopping cart.",
            "iOS app designed and built, pulling from a single API.",
            "Cross-device delivery of audio content, both real-time and on-demand.",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "en",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Rebuilt website and content management to streamline user experience and editorial workflow – all delivered against the clock.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire was suffering with poor user experience and bringing headaches to its editorial team. It needed a design refresh and content management reboot – and there was only 12 weeks to do it.",
          "results": "A mix of DADI microservices rapidly delivers a new mobile responsive website driven by easy-to-use content management interfaces. It lays the ground for iterative evolution in co-development.",
          "detail": "Bauer chose DADI technology for its Empire refresh in Summer 2015 and delivered a fully rebuilt site before the leaves turned yellow in Autumn.\n\nThe new product is an API-first built in support of lean editorial workflow, clutter-free user experience across multiple devices and enhanced SEO functionality. The project was initially defined as a minimum viable product and after the launch phase moved into continuous iteration measured against usage data.\n\nDADI is now working with Empire on a release to include the latest version of Publish and is rolling out platform technology across other titles in the Bauer portfolio.",
          "quote": {
            "body": "The DADI platform provides unique and market-leading SEO functionality",
            "cite": "Head of Search, **Bauer Media**"
          },
          "captions": [
            "Fully responsive homepage.",
            "Early design concept work.",
            "Integration with Themoviedb.org allows editors to select high quality images easily.",
            "Hub pages allow content to be organised around titles."
          ]
        },
        {
          "lang": "en",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "A premium digital product worthy of exclusive luxury holiday islands and properties selected personally by Richard Branson.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition needed more than a brochure site to represent its unique mix of private islands, thrilling safaris and luxury properties. It needed immersive UX and seamless CRM.",
          "results": "DADI technology delivers flexible content management and premium user experience, plus a lightweight CRM  that acts as the glue between booking engine, digital communication and face-to-face customer service.",
          "detail": "Virgin Limited Edition uses DADI technology to power content management and manage relationships with its users. It's an API-first build assembled and managed by the DADI enterprise support team.\n\nFirst priority was presentation – the site was planned, designed and built to immerse the user in property detail – but the DADI platform also allows flexible control over the way the content is presented, so the team can build individual templates without developer intervention.\n\nBehind the scenes, a single user data store mixes information from multiple sources and provides a single version of the truth – vital for being able to tune a customer contact strategy for a demanding demographic.",
          "quote": {
            "body": "DADI has become an essential part of our growth strategy, building not only our ‘shop-front window’ website, but also helping us manage our customer data more intelligently",
            "cite": "Director of Marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "A single design system which adapts to each of the nine properties.",
            "Small interative additions are scattered throughout the site.",
            "High-resolution image galleries showcase the luxury experiences.",
            "The Virgin Limited Edition blog lets vistors learn about the personality of each location."
          ]
        },
        {
          "lang": "en",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "An ambitious project to combine multiple titles and editorial teams into a single solution with enhanced revenue streams.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia, Closer and Heat magazines were a disjointed digital portfolio using multiple content management and advertising delivery systems. Lifestyle.one sought to bring together these products into a single streamlined package.",
          "results": "DADI technology drives all three titles from a single codebase, making small presentational adjustments for each brand requirement. Years of content was migrated into a single location with both advertising and editorial workstreams significantly enhanced.",
          "detail": "Another end-to-end build using the suite of DADI technology, Lifestyle.one is a single front-end presentation that accommodates various commercial and editorial requirements across a mix of titles – and dovetails workflow requirements across multiple editorial teams.\n\nThe build extended the Publish content management solution built for Empire magazine, bringing advantages in combined releases and updates across four titles in the wider portfolio.\n\nThe result is a leaner digital product that is less hungry for resource in technical, commercial and editorial maintenance. It fosters cross-promotion and gathers an audience around the content portfolio with greater revenue opportunity.",
          "quote": {
            "body": "Products built with DADI are delivered in days and weeks, not weeks and months",
            "cite": "Chief Technology Officer, **Bauer Media**"
          },
          "captions": [
            "Each magazine site is derived from a unified codebase. (Grazia)",
            "Heat World.",
            "Closer.",
            "Cross-site integrated search, tagging and celebrity database."
          ]
        },
        {
          "lang": "de",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "End-to-end Neuauflage basierend auf DADI Technologie um den Workflow zu optimieren, Bindungen zu verbessern und neue geschäftliche Möglichkeiten zu unterstützen.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? wurde aufgebaut auf einer veralteten antiken Plattform, die eine vergängliche, desktop-only User Erfahrung ermöglichte mit verschiedenen, unzusammenhängenden editoriellen Arbeitsgruppen. Neue Systeme wurden benötigt, damit Autoren wieder mehr Zeit auf den Inhalt verwenden können anstellte von Admin - und damit die User eine nahtlose Erfahrung auf all ihren Endgeräten genießen.",
          "results": "DADI Technology liefert eine API-first Plattform Lösung die Inhalt von der Darbietung loslöst, was bedeutet, dass ein Topf voll Inhalt und ein editorieller Workflow verschiedene digitale Produkte vom Desktop PC über das Tablet bis hin zum Smartphone bedienen kann.",
          "detail": "Haymarket Media Group hat sich dazu entschlossen, DADI Technology zu nutzen um die Seite whatcar.com neu aufzusetzen, damals basierend auf veralteter Technologie, die erhöhte Anforderungen an editorielle Ressurcen stellte und eine schlechte Usererfahrung bot.\n\nFirmeninterne Entwickler arbeiteten zusammen mit DADI Entwicklern und Strategen an einem neuen, iterativen Entwicklungsplan - um die vielen Probleme der alternden Plattform auszubessern und eine 'reviews' website erweitern zu einem komplette Autohandel.\n\nEin neuer Content Store und eine Management Oberfläche wurde entwickelt, zugeschnitten auf die Bedingungen des editoriellen Workflow und fähig, Desktop, Tablet, Smartphone und zukünftige Endgeräte durch eine einzige Quelle zu unterstützen. Dies wurde dann in ein aktuelles, voll ansprechendes Front-End Design integriert mit zukünftiger Personalisierung des Inhalts im Hinterkopf - basierend auf den Nutzungsdaten, die durch die DADI Plattform gesammelt wurden. Dies ist eine Modellvorstellung aus Inhalt und Geschäft. ",
          "quote": {
            "body": "Der Umzug von whatcar.com zu DADI hat die Kosten für die Infrastruktur erheblich gesenkt.",
            "cite": "Produktleiter, **Haymarket Consumer Media**"
          },
          "captions": [
            "Whatcar.com homepage",
            "Verschiedene Datenquellen werden kombiniert um neue Einsichten offenzulegen.",
            "Vollbild Gallerien präsentieren großartige Fotografien.",
            "Planungsarbeit für die viel beachteten What Car? Car of the Year Awards."
          ]
        },
        {
          "lang": "de",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "Eine neue Plattform aufgebaut mit der Unterstützung von einzelnen Usern und Abonnenten - und um die volle Bandbreite eines digitalen Produkts vom Browser zur App zu ermöglichen.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocle digital products were driven by a disconnected platform with no correlation between magazine subscribers, shop customers and website users. A new solution was needed to facilitate single subscriber view across web and mobile – and drive a focussed CRM strategy.",
          "results": "The DADI platform underpins a new data driven strategy that identifies the individual and optimizes user experience, delivering an 88% increase in visitors, 49% more registered users, 25% greater shop sales and a 44% increase in paid subscribers – and inside six months.",
          "detail": "Monocle nutzt DADI Technology um eine verbesserte CRM Strategie im Druck, Digital, Radio und Verkauf zu betreiben. Es zieht sich alle Nutzerdaten in einen Topf und arbeitet daran, ein nahtloses datengesteuertes Erlebnis bereitzustellen, rivalisierend zu dem Premium Service, den man in den materiellen Monocle Stores finden kann.\n\nEin einzelnes Benutzerverzeichnis unterstützt Registrierung des digitalen Produkts, Anmeldung zu Email Neuigkeiten, Einkäufe im Monocle Shop sowie digitale und Magazin Abonnements. Dies führte zu gezielteren Nachrichten, was sowohl für die Marke als auch für den Benutzer effektiver ist.\n\n...",
          "quote": {
            "body": "DADI Technology gab unseren Benutzerdaten einen Sinn und ermöglichte Premium Online Erlebnisse von einer Qualität, die unsere Leser auch in unseren Printmagazinen finden.",
            "cite": "Chef der Digitalabteilung, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Seitenumfassende Lösung: Von der Homepage zum Einkaufswagen.",
            "iOS App designt und aufgebaut, aufgezogen durch eine einzige API.",
            "Cross-Endgeräte Verfügbarkeit von Audioinhalten, sowohl in Echtzeit als auch On-Demand."
          ]
        },
        {
          "lang": "de",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Neuaufsetzen der Webseite und des Content Management um das Usererlebnis und den editoriellen Workflow zu optimieren - alles musste innerhalb kürzester Zeit geliefert werden.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire litt an schlechten Usererlebnissen und verursachte dem Editorteam Kopfschmerzen. Es brauchte eine Auffrischung des Designs und ein Reboot des Content Management - und es blieben nur 12 Wochen Zeit dafür.",
          "results": "Ein Mix der DADI Microservices lieferte schnell eine neue Smartphone responsive Homepage betrieben durch easy-to-use Content Management Systeme. Dies ist die Grundlage für iterative Evolution in Co-Entwicklung.",
          "detail": "Bauer entschied sich für DADI Technology für die Auffrischung von Empire im Sommer 2015 und wir lieferten eine komplett neu aufgesetze Seite bevor sich noch die Blätter im Herbst gelb färbten.\n\nDas neue Produkt ist eine API-first Version, das wenig editoriellen Workflow unterstützt, ein störungsfreies Usererlebnis über alle Endgeräte hinweg ermöglicht und erweiterte SEO Funktionen hat. Anfangs wurde es als minimal realisierbares Produkt definiert aber nach dem Start wurde es in die kontinuerliche Iterationen gemessen an den Nutzerdaten überführt.\n\nDADI arbeitet nun mit Empire an einem Release, um die neuste Version von Publish einzubinden und erweitert die Plattformtechnologie anderer Produkte des Bauer Portfolios. Ein einzelnes Benutzerverzeichnis unterstützt Registrierung des digitalen Produkts, Anmeldung zu Emailbenachrichtigungen, Einkäufe im Monocle Shop sowie digitale und Magazin Abonnements. Dies führte zu gezielteren Nachrichten, was sowohl für die Marke als auch für den Benutzer effektiver ist.\n\nDie DADI Plattform managt auch den editoriellen Inhalt vom Browser und den Apps, während unser Support Team für die Unternehmen in der Co-Entwicklung mit den Entwicklern von Monocle gearbeitet hat, in dem es Unterstützung gegeben hat, das sich von technologischen Schwergewichten bis zu UX und Design erstreckte - eine Partnerschaft, die Monocle.com etliche Awards für ihr digitales Produkt bescherte.",
          "quote": {
            "body": "Die DADI Plattform bietet einzigartige und marktführende SEO Funktionalität",
            "cite": "Searchleiter, **Bauer Media**"
          },
          "captions": [
            "Voll responsive Homepage.",
            "Frühe Design Konzeptartbeit.",
            "Integration in Themoviedb.org ermöglicht es Designern, qualitativ hochwertige Bilder leicht auszuwählen.",
            "Hub Seiten ermöglichen die Organisation des Inhalts um Titel herum"
          ]
        },
        {
          "lang": "de",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "Ein digitales Premiumprodukt für luxuriöse Urlaubsinseln und Immobilien, persönlich ausgewählt durch Richard Branson.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition brauchte mehr als nur eine Broschürenwebseite um den luxuriösen Mix aus privaten Inseln, aufregenden Safaris und Luxusimmobilien zu repräsentieren. Es benötigte ein umfassendes UX und nahtloses CRM.",
          "results": "DADI Technology liefert flexiblen Content Management und Premium Usererlebnisse, inklusive eines abgespeckten CRM, das als Klebstoff zwischen Buchungssystem, digitaler Kommunikation und Face-to-Face Kundenservice fungiert.",
          "detail": "Virgin Limited Edition nutzt DADI Technology um Content Management zu betreiben und Beziehungen zu seinen Kunden zu pflegen. Es ist eine API-first Version, die vom DADI Unternehmenssupportteam zusammengestellt und gemanagt wird.\n\nDie höhste Priorität war die Präsentation - die Seite wurde geplant, designt und aufgebaut um dem Benutzer das Eintauchen in die Produktdetails zu ermöglichen - aber die DADI Plattform ermöglicht auch die flexible Kontrolle über die Art, wie der Inhalt präsentiert wird, sodass das Team auch individuelle Vorlagen oder Entwicklerhilfen erstellen kann.\n\nEin Blick hinter die Kulissen verrät, dass eine einzelne Benutzerdatei Informationen aus verschiedenen Quellen mischt und so die eine Wahrheit liefert - unverzichtbar für das Anpassen einer kundenorientierte Strategie in einer fordernden Gesellschaft.",
          "quote": {
            "body": "DADI wurde ein essentieller Teil unserer Wachstumsstrategie, in dem sie nicht nur unsere 'Schaufenster' Webseite aufgebaut haben, sondern uns auch dabei unterstützt haben, unsere Kundendaten intelligenter zu managen.",
            "cite": "Chef des Marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "Ein einzelnes Designsystem, das sich jedem der neun Eigenschaften anpasst.",
            "Kleine interaktive Zusätze sind auf der Seite verstreut.",
            "Hochauflösende Bildergallerie präsentiert die luxoriösen Erlebnisse.",
            "Der Virgin Limited Edition Blog hilft den Besuchern, mehr über die Individualität eines jeden Ortes zu erfahren."
          ]
        },
        {
          "lang": "de",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "Ein ambitioniertes Projekt, das verschiedene Titel und Editorteams zu einer einzigen Lösung mit einem erweiterten Einkommensstrom kombiniert.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia, Closer and Heat magazines were a disjointed digital portfolio using multiple content management and advertising delivery systems. Lifestyle.one sought to bring together these products into a single streamlined package.",
          "results": "DADI Technology betreibt alle drei Titel von einer einzigen Codebasis, während kleinere darstellungstechnische Anpassungen je nach Anforderungen der Marke vorgenommen wurden. Inhalt von mehreren Jahren wurde zu einem einzigen Ort überführt, was sowohl die Werbe- als auch die editoriellen Arbeitsabläufe spürbar verbesserte.",
          "detail": "Eine weitere End-to-End Version, die die Suite von DADI Technology benutzt, ist Lifestyle.one; eine einzige Front-End Präsentation, die verschiedene gewerbliche und editorielle Anforderungen titelübergreifend beherbergt - und Bedingungen für den Workflow aus verschiedenen Editorteams miteinander verzahnt.\n\nDie Version erweiterte die Publish Content Management Lösung, die für das Empire Magazin erstellt wurde, was vorteilhaft war für kombinierte Veröffentlichungen und Updates quer über die vier Titel in dem erweiterten Portfolio.\n\nDas Ergebnis ist ein einfacheres digitales Produkt, das weniger technische, gewerbliche und editorielle Ressourcen verschlingt. Es begünstig Cross-Promotion und erreicht ein Publikum mit dem Inhaltsportfolio, was auch zu mehr Einkommensmöglichkeiten führt.",
          "quote": {
            "body": "Mit DADI erstellte Produkte werden innerhalb von Tagen und Wochen fertiggestellt, nicht innerhalb von Wochen oder Monaten.",
            "cite": "Technischer Direktor, **Bauer Media**"
          },
          "captions": [
            "Jede Magazinseite leitet sich von einer einheitlichen Codebasis ab. (Grazia)",
            "Heat World.",
            "Closer.",
            "Seitenübergreifende integrierte Suchfunktion, Tag und Celebrity Datenbank."
          ]
        },
        {
          "lang": "jp",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "ワークフローを最適化し、エンゲージメントを改善し、新しいビジネスチャンスを支援するDADIテクノロジー上での端から端までの再構築",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car?は、複数の連携していない編集ワークストリームを有する脆弱でデスクトップ専用のユーザーエクスペリエンスを提供する古いレガシープラットフォーム上に構築されていました。新システムでは、ライター達が管理業務ではなくコンテンツにもっと時間を費やすことができるように、そしてユーザーがデバイス間でシームレスな体験ができるように求められました。",
          "results": "DADIテクノロジーは、プレゼンテーションからコンテンツを抽象化する、すなわちひとつのコンテンツとひとつの編集ワークフローがデスクトップ、タブレット、モバイルを跨ぐ複数のデジタルプロダクトを供給することのできるAPIファーストのプラットフォームソリューションを提供します。",
          "detail": "Haymarket MediaグループはDADIテクノロジーを使用してwhatcar.comの再構築を行いました。whatcar.comは、編集リソースを過剰に要求し、不十分なユーザーエクスペリエンスを提供する老朽化したテクノロジーを組み合わせて使用していました。\n\n社内開発者はDADIのエンジニアや戦略立案者と協力して新しい反復型のプロダクトロードマップに取り組みました。レガシープラットフォームの多くの欠点を修正し、「説明」のためのWebサイトを完全な自動車購入のための小売サービスとして拡張しました。\n\n編集ワークフローの要件に合わせてカスタマイズされ、デスクトップ、タブレット、モバイル、さらには将来のプロダクトも単一のソースから供給することができるように、新しいコンテンツストアと管理インターフェースが開発されました。さらに将来DADIプラットフォームで収集される使用状況のデータに基づいてコンテンツのパーソナライズを行うことを念頭にデザインされた最新の完全にレスポンシブなフロントエンド と統合されました。これはコンテンツと商取引との間のモデルとなる内部です。",
          "quote": {
            "body": "whatcar.comをDADIに移行したことでインフラのコストが大幅に削減されました。",
            "cite": "Haymarket Consumer Mediaのプロダクト責任者"
          },
          "captions": [
            "Whatcar.comのレスポンシブホームページ",
            "複数のデータソースを組み合わせて新しい知見を得ます。",
            "フルスクリーンのイメージギャラリーは素晴らしい編集写真を示しています。",
            "評判の非常に高いWhat Car?のカーオブザイヤー賞のためのデザイン作業"
          ]
        },
        {
          "lang": "jp",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "シングルユーザーと購読者ビューをサポートする新しいプラットフォーム。ブラウザからアプリまであらゆるデジタルプロダクトに対応。",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocleのデジタルプロダクトは、雑誌購読者やショップの顧客、Webサイトのユーザが紐付いていない非連携のプラットフォームで運用されていました。Webとモバイルを横断する単一の購読者ビューを容易にし、焦点を合わせたCRM戦略を進めるための新しいソリューションが必要でした。",
          "results": "DADIプラットフォームは、個々人を特定し、ユーザーエクスペリエンスを最適化し、訪問者を88%増加させ、登録ユーザ数を49%増やし、ショップの売上を25%伸ばし、有料購読者を44%増やし、しかもこれを6ヶ月以内に成し遂げる新しいデータ駆動型の戦略を支えます。",
          "detail": "Monocleは印刷物、デジタル、ラジオ、小売に跨がる強化されたCRM戦略を支えるDADIテクノロジーを使用しています。全てのユーザデータを1つにまとめ、Monocleストアにあるプレミアムサービスに匹敵するシームレスなデータ駆動の体験を提供します。\n\nひとつのユーザーレコードが、デジタルプロダクトへの登録、電子メールでのお知らせへのサインアップ、Monocleショップでの購買、加えてデジタルと雑誌の両方の購読をサポートします。これによりブランドにもユーザにも両方にとって効果的なターゲットメッセージングが可能となりました。\n\nDADIプラットフォームはまたブラウザーサイトからアプリにわたる編集コンテンツを管理していますが、私たちのエンタープライズサポートチームは、力仕事からUXやデザインまでのサポートを提供し、Monocleのエンジニアとの共同開発に取り組んできました。このパートナーシップが、デジタルプロダクトに対する数々の賞をMonocle.comにもたらしました。",
          "quote": {
            "body": "DADIテクノロジーが私たちのデータの意味を解明し、読者が印刷物に見ている品質相当のプレミアムなオンラインの経験を可能にしてくれました。",
            "cite": "Monocleデジタル責任者"
          },
          "vimeo": "66093926",
          "captions": [
            "サイト全体にわたるソリューション：ホームページからショッピングカートまで",
            "iOSアプリを設計構築しました。単一のAPIから取り出しています。",
            "オーディオコンテンツのクロスデバイスへの配信。リアルタイムとオンデマンドの両方。",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },        
        {
          "lang": "jp",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "ユーザーエクスペリエンスと編集ワークフローを合理化するWebサイトとコンテンツ管理の再構築。全ては時間との戦いでした。",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empireは貧弱なユーザーエクスペリエンスに悩まされており、編集チームの頭痛の種でした。デザインのリフレッシュとコンテンツ管理の再立ち上げが必要でした。そしてその作業には12週間しかありませんでした。",
          "results": "DADIのマイクロサービスの組み合わせは、使いやすいコンテンツ管理インターフェースによりもたらされる新しいモバイル向けレスポンシブWebサイトを迅速に提供します。共同開発における反復的発展の基礎となります。",
          "detail": "Bauerは2015年夏にEmpireの更新のためにDADIテクノロジーを選択しました。秋に葉が黄色に変わる前に完全に再構築したサイトを配信しました。\n\n新プロダクトはAPIファーストで構築され、リーン編集ワークフロー、複数のデバイスを跨がる綺麗に整ったユーザーエクスペリエンス、SEO機能の強化をサポートします。プロジェクトは当初最小限に機能する製品 (MVP) として定義されました。ローンチ後、ユーザーデータに対して測定する継続的イテレーションのフェーズに移行しました。\n\nDADIは現在、最新バージョンのPublishを含むリリースにEmpireとともに取り組んでいます。また、Bauerのポートフォリオの他のタイトルにわたるプラットフォームテクノロジーを公開しています。\n\n...",
          "quote": {
            "body": "DADIプラットフォームはユニークで市場をリードするSEO機能を提供してくれます",
            "cite": "Bauer Mediaの検索担当責任者"
          },
          "captions": [
            "完全にレスポンシブなホームページ",
            "初期のデザインコンセプト作品",
            "Themoviedb.orgとの統合により、編集者は高品質の画像を容易に選択することができます。",
            "ハブページでは、タイトルの周りにコンテンツをまとめることができます。"
          ]
        },       
        {
          "lang": "jp",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "リチャード・ブランソン氏が個人的に選んだ高級で贅沢な余暇向けの島々や施設にふさわしいプレミアムデジタルプロダクト",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Editionは、プライベートアイランド、スリリングなサファリ、豪華な施設のユニークな組み合わせを表現するために、カタログサイトを超えるものを必要としていました。夢中になれるUX、シームレスなCRMが必要でした。",
          "results": "DADIテクノロジーは、 delivers 柔軟なコンテンツ管理とプレミアムなユーザーエクスペリエンスに加えて、予約エンジン、デジタル通信、対面顧客サービスの間の接着剤として機能する軽量のCRMを提供します。",
          "detail": "Virgin Limited Editionは、DADIテクノロジーを使用して、コンテンツ管理を動かし、ユーザとの関係を管理しています。APIファーストで構築され、DADIのエンタープライズ・サポートチームにより組み立てと管理がされました。\n\n第一の優先事項は見栄えでした。サイトは、ユーザが施設の詳細に夢中になるように設計、デザイン、構築がされました。しかしDADIプラットフォームは、コンテンツがどのように表示されるかを柔軟に制御できるようにしますので、チームは開発者の介入なしに個別のテンプレートを作成することができます。\n\nこの裏側では、単一のユーザデータストアが、複数のソースからの情報をミックスし、真実に対するひとつの考えを提供しています。要望のある層への顧客コンタクトの戦略を調整するために不可欠です。",
          "quote": {
            "body": "DADIは私たちの成長戦略に不可欠なパーツになりました。「店頭窓口」のWebサイトを構築するだけでなく、お客様のデータをインテリジェントに管理するためにも役立っています。",
            "cite": "Virgin Limited Editionのマーケティング責任者"
          },
          "captions": [
            "9つの施設のそれぞれに適応する単一のデザインシステム",
            "サイト全体に小さな反復的追加が散在しています。",
            "贅沢な経験を示す高解像度のイメージギャラリー",
            "Virgin Limited Editionのブログは、訪問者に各地の個性を知らしめている。"
          ]
        },      
        {
          "lang": "jp",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "複数のタイトルと編集チームを、強化された収益源を有する1つのソリューションに統合する野心的なプロジェクト",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia、Closer、Heatの雑誌は、複数のコンテンツ管理と広告配信システムを使用したバラバラのデジタルポートフォリオでした。Lifestyle.oneは、これらのプロダクトを単一の合理化されたパッケージにまとめようとしました。",
          "results": "DADIテクノロジは、3つのタイトルをすべて単一のコードベースから動かしています。各ブランドの要件に応じた小さなプレゼンテーションの調整を行います。何年ものコンテンツは単一の場所に移動され、広告と編集の両方のワークストリームが大幅に強化されました。",
          "detail": "Lifestyle.oneは、DADIテクノロジースイートを使用したもう一つの端から端までのビルドで、複数のタイトルにわたるさまざまな商用および編集上の要件に対応する単一のフロントエンドのプレゼンテーションです。また、複数の編集チームにわたるワークフローの要件を満たします。\n\nこのビルドでは、Empire誌向けのPublishコンテンツ管理ソリューションが拡張され、より幅広いポートフォリオの4つのタイトルでリリースとアップデートを組み合わせた優位性がもたらされました。\n\n技術上、商業上、編集上のメンテナンスのリソースが少なくて済む、よりリーンなデジタルプロダクトが結果として得られます。クロスプロモーションを促進し、より大きな収益機会を持つコンテンツのポートフォリオの読者を集めます。",
          "quote": {
            "body": "DADIで構築された製品は、数週間から数ヶ月ではなく、数日から数週間で配信されます",
            "cite": "Bauer Mediaの最高技術責任者"
          },
          "captions": [
            "各雑誌サイトは一元化されたコードベースから派生しています。(Grazia)",
            "Heat World.",
            "Closer.",
            "検索、タグ、有名人データベースを統合したクロスサイト"
          ]
        },
        {
          "lang": "fr",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "Reconstruction bout à bout sur la technologie DADI pour optimiser le flux de travail, améliorer l'engagement et soutenir de nouvelles opportunités commerciales.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? a été construite sur une plate-forme héritée ancienne qui présentait une expérience utilisateur fragile et sans ordinateur avec de multiples flux de travail réduits déconnectés. De nouveaux systèmes étaient nécessaires pour que les auteurs puissent consacrer plus de temps au contenu que l'administrateur - et les utilisateurs pourraient avoir une expérience sans problèmes entre les appareils.",
          "results": "La technologie DADI offre une solution de plate-forme API-first qui résume le contenu de la présentation, ce qui signifie qu'un ensemble de contenu et un flux de travail éditorial peuvent faire fonctionner plusieurs produits numériques sur l'ordinateur de bureau, la tablette et le mobile.",
          "detail": "Le groupe Haymarket Media a choisi d'utiliser la technologie DADI pour fournir une reconstruction de whatcar.com, qui a utilisé un mélange de technologie ancienne qui a imposé des exigences excessives sur les ressources éditoriales et a fourni une mauvaise expérience utilisateur.\n\nLes développeurs internes ont travaillé en collaboration avec les ingénieurs et les stratèges de DADI contre une nouvelle feuille de route itérative pour les produits - en réparant les nombreuses lacunes de la plate-forme héritée et en étendant un site Web de « commentaires » dans un service d'achat de voitures au détail.\n\nUne nouvelle interface de gestion et de magasin de contenus a été développée, adaptée aux besoins du flux de travail éditorial et capable de faire fonctionner des produits de bureau, de tablette, de mobile et futurs à partir d'une source unique. Cela a ensuite été intégré à un front-end complètement sensible et mis à jour avec la personnalisation future du contenu, en fonction des données d'utilisation collectées par la plate-forme DADI. C'est un nœud exemplaire de contenu et de commerce.",
          "quote": {
            "body": "Le déplacement de whatcar.com vers DADI a considérablement réduit nos coûts d'infrastructure",
            "cite": "Responsable du produit, **Haymarket Consumer Media**"
          },
          "captions": [
            "La page d'accueil réactive de Whatcar.com",
            "Combinaison de sources de données multiples pour révéler de nouvelles idées.",
            "Les galeries d'images en plein écran présentent la grande photographie éditoriale",
            "Travaux de conception pour les très respectés prix What Car? ​​de la voiture de l'année"
          ]
        },
        {
          "lang": "fr",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "Une nouvelle plate-forme conçue en faveur de l'utilisateur unique et des vues des abonnés - et pour faire fonctionner une gamme complète de produits numériques du navigateur et de l'application.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Les produits numériques de Monocle ont été guidés par une plate-forme déconnectée sans corrélation entre les abonnés au magazine, les clients commerciaux et les utilisateurs du site. Une nouvelle solution était nécessaire pour faciliter la vue de l'abonné unique sur le Web et le mobile - et diriger une stratégie de CRM ciblée.",
          "results": "La plate-forme DADI sous-tend une nouvelle stratégie axée sur les données qui identifie l'individu et optimise l'expérience de l'utilisateur, générant une augmentation de 88 % des visiteurs, 49 % de plus d'utilisateurs enregistrés, 25 % de plus de ventes au magasin et une augmentation de 44 % des abonnés payés - tout dans les six mois.",
          "detail": "Monocle utilise la technologie DADI pour diriger une stratégie de CRM améliorée à travers l'impression, le numérique, la radio et le commerce de détail. Elle extrait toutes les données de l'utilisateur en un seul ensemble et travaille pour fournir une expérience continue axée sur les données pour rivaliser avec le service de permière catégorie trouvé dans les magasins physiques Monocle.\n\nUn enregistrement d'utilisateur unique prend en charge l'enregistrement avec un produit numérique, l'inscription aux bulletins électroniques, les achats effectués dans le magasin Monocle et les abonnements numériques et au magazine. Cela a permis des messages plus ciblés qui sont plus efficaces tant pour la marque que pour les utilisateurs.\n\nLa plate-forme DADI gère également le contenu éditorial sur le site et les applications du navigateur, tandis que notre équipe de soutien d'entreprise travaille en co-développement avec des ingénieurs à Monocle qui offrent un support allant du plus gros travail à l'expérience utilisateur et au design - un partenariat qui a récompensé Monocle.com avec plusieurs prix pour son produit numérique.",
          "quote": {
            "body": "La technologie DADI a permis de comprendre les données de nos utilisateurs et a permis une expérience en ligne de meilleure qualité que la qualité que nos lecteurs trouvent en version imprimée",
            "cite": "Responsable numérique, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Solution complète : de la page d'accueil au panier d'achat",
            "Une application iOS conçue et construite, profitant d'une seule API",
            "Livraison entre dispositifs du contenu audio, en temps réel et à la demande",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },        
        {
          "lang": "fr",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Le site Web de reconstruction et la gestion des contenus pour rationaliser l'expérience utilisateur et le flux de travail éditorial - tout contre la montre.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire was suffering with poor user experience and bringing headaches to its editorial team. It needed a design refresh and content management reboot – and there was only 12 weeks to do it.",
          "results": "A mix of DADI microservices rapidly delivers a new mobile responsive website driven by easy-to-use content management interfaces. It lays the ground for iterative evolution in co-development.",
          "detail": "Bauer a choisi la technologie DADI pour son rafraîchissement d'Empire à l'été 2015 et a livré un site entièrement reconstruit avant que les feuilles ne deviennent jaunes en automne.\n\nLe nouveau produit est une API-first créée dans le cadre d'un processus de rédaction rédactionnel modéré, une expérience utilisateur simple sur plusieurs appareils et une fonctionnalité de référencement améliorée. Le projet a été initialement défini comme un produit minimum viable et après la phase de lancement il est passée à une itération continue mesurée par rapport aux données d'utilisation.\n\nDADI travaille maintenant avec Empire sur une version pour inclure la dernière version de Publish et déploie la technologie de plate-forme sur d'autres titres de la gamme de Bauer. Un enregistrement d'utilisateur unique prend en charge l'enregistrement avec un produit numérique, l'inscription aux bulletins électroniques, les achats effectués dans le magasin Monocle plus les abonnements numériques et de magazines. Cela a permis des messages plus ciblés qui sont plus efficaces tant pour la marque que pour les utilisateurs.",
          "quote": {
            "body": "La plate-forme DADI offre une fonctionnalité de référencement unique et leader sur le marché.",
            "cite": "Responsable de recherche, **Bauer Media**"
          },
          "captions": [
            "Une page d'accueil entièrement adaptée",
            "Travaux conceptuels de conception initiale",
            "L'intégration avec Themoviedb.org permet aux éditeurs de sélectionner facilement des images de haute qualité",
            "Les pages centrales permettent d'organiser le contenu autour des titres"
          ]
        },       
        {
          "lang": "fr",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "Un produit numérique de qualité digne d'îles et de propriétés de vacances de luxe exclusives sélectionné personnellement par Richard Branson",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition a besoin de plus d'un site de brochure pour représenter son mélange unique d'îles privées, de safaris passionnants et de propriétés de luxe. Il fallait une expérience utilisateur immersive et un CRM sans problèmes.",
          "results": "La technologie DADI offre une gestion flexible du contenu et une expérience utilisateur excellente, plus un CRM sans problème qui constitue la colle entre le moteur de réservation, la communication numérique et le service à la clientèle en face à face.",
          "detail": "Virgin Limited Edition utilise la technologie DADI pour alimenter la gestion des contenus et gérer les relations avec ses utilisateurs. C'est une première compilation de l'API assemblée et gérée par l'équipe de soutien d'entreprise de DADI.\n\nLa première priorité a été la présentation - le site a été planifié, conçu et construit pour plonger l'utilisateur dans les détails de la propriété - mais la plate-forme DADI permet également un contrôle souple de la façon dont le contenu est présenté, de sorte que l'équipe peut créer des modèles individuels sans intervention du développeur.\n\nDans les coulisses, un magasin de données utilisateur unique mélange les informations provenant de plusieurs sources et fournit une seule version de la vérité - indispensable pour accorder une stratégie de contact client pour une démographie exigeante.",
          "quote": {
            "body": "DADI est devenue une partie essentielle de notre stratégie de croissance, construisant non seulement notre site Web de « vitrine d'entreprise », mais aussi nous aidant à gérer les données de nos clients de manière plus intelligente",
            "cite": "Responsable de marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "Un système de conception unique qui s'adapte à chacune des neuf propriétés.",
            "Les petites additions interatives sont dispersées dans tout le site.",
            "Les galeries d'images à haute résolution présentent les expériences de luxe.",
            "Le blog Virgin Limited Edition permet aux visiteurs d'apprendre la personnalité de chaque lieu."
          ]
        },    
        {
          "lang": "fr",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "Un projet ambitieux pour combiner plusieurs titres et équipes éditoriales en une solution unique avec des flux de revenus améliorés.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Les magazines Grazia, Closer et Heat étaient un portfolio numérique disjoint utilisant de multiples systèmes de gestion de contenu et de distribution de publicité. Lifestyle.one a cherché à réunir ces produits dans un seul ensemble simplifié.",
          "results": "La technologie DADI génère les trois titres à partir d'une base de code unique, ce qui fait de petits ajustements de présentation pour chaque exigence de la marque. Des années de contenu ont été migrées dans un seul endroit, avec des flux de travail publicitaires et éditoriaux améliorés de manière significative.",
          "detail": "Une autre construction de bout en bout à l'aide de la gamme de la technologie DADI, Lifestyle.one est une présentation unique qui répond à diverses exigences commerciales et éditoriales dans un mélange de titres et renforce les exigences de flux de travail dans plusieurs équipes éditoriaux.\n\nLa construction a étendu la solution de gestion de contenu Publish pour le magazine Empire, apportant des avantages dans les versions combinées et les mises à jour sur quatre titres dans le plus large portefeuille.\n\nLe résultat est un produit numérique plus souple qui a besoin de moins de ressources pour la maintenance technique, commerciale et éditoriale. Il favorise la promotion croisée et rassemble un public autour du portefeuille de contenu avec une plus grande opportunité de revenus.",
          "quote": {
            "body": "Les produits fabriqués avec DADI sont livrés en des jours et des semaines, pas en des semaines et des mois",
            "cite": "Responsable de technologie, **Bauer Media**"
          },
          "captions": [
            "Chaque site de magazine est dérivé d'une base de code unifiée. (Grazia)",
            "Heat World.",
            "Closer.",
            "Base de données intersite intégrée de recherche, de marquage et de célébrités"
          ]
        },
        {
          "lang": "es",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "Reconstrucción de extremo a extremo con tecnología DADI para optimizar el flujo de trabajo, mejorar el compromiso y apoyar nuevas oportunidades comerciales.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? fue creada sobre una vieja plataforma heredada que presentaba una frágil experiencia de usuario solo de sobremesa con múltiples corrientes de trabajo editoriales desconectadas. Se requerían nuevos sistemas para que los escritores pudieran dedicar más tiempo al contenido que la administración, y los usuarios podrían tener una experiencia sin fisuras entre los dispositivos.",
          "results": "La tecnología DADI ofrece una solución de plataforma API-first que abstrae el contenido de la presentación, lo que significa que un conjunto de contenido y un flujo de trabajo editorial pueden hacer funcionar múltiples productos digitales a través del ordenador de sobremesa, la tableta y el móvil.",
          "detail": "El grupo Haymarket Media optó por utilizar la tecnología DADI para entregar una reconstrucción de whatcar.com, que utiliza una mezcla de tecnología de envejecimiento que puso excesivas demandas en recursos editoriales y proporcionó una mala experiencia de usuario.\n\nLos desarrolladores internos trabajaron en colaboración con los ingenieros y estrategas de DADI en contra de una nueva hoja de ruta itinerante iterativa, que solucionó las numerosas deficiencias de la plataforma heredada y extendió el sitio web de \"comentarios\" a un servicio de venta al por menor completo.\n\nSe desarrolló una nueva interfaz de administración y almacén de contenido, adaptada a los requerimientos de flujo de trabajo editorial y capaz de hacer funcionar productos de sobremesa, tableta, móviles y futuros de una sola fuente. A continuación, se integró con un \"front-end\" actualizado y totalmente responsable diseñado con la futura personalización de contenido en función de los datos de uso recopilados por la plataforma DADI. Es una curva modelo del contenido y del comercio.",
          "quote": {
            "body": "El traslado de whatcar.com a DADI redujo significativamente nuestros costos de infraestructura",
            "cite": "Jefe de producto, **Haymarket Consumer Media**"
          },
          "captions": [
            "Página de inicio de Whatcar.com.",
            "Combinar múltiples fuentes de datos para revelar nuevas ideas.",
            "Las galerías de imágenes a pantalla completa muestran la gran fotografía editorial.",
            "Trabajo de diseño para los muy respetados premios What Car? al coche del año."
          ]
        },
        {
          "lang": "es",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "Una nueva plataforma construida en favor del usuario único y las visitas de los suscriptores, y para hacer funcionar un conjunto completo de productos digitales desde el navegador hasta la aplicación.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Los productos digitales de Monocle fueron impulsados ​​por una plataforma desconectada, sin correlación entre los suscriptores de las revistas, los clientes de las tiendas y los usuarios de sitios web. Se necesitaba una nueva solución para facilitar la visualización de suscriptores individuales a través de la web y el móvil, y dirigir una estrategia de CRM centrada.",
          "results": "La plataforma DADI respalda una nueva estrategia impulsada por datos que identifica al individuo y optimiza la experiencia del usuario, logrando un aumento del 88 % en los visitantes, un 49 % más de usuarios registrados, un 25 % más de ventas en la tienda y un incremento del 44 % en el número de suscriptores de pago; en seis meses.",
          "detail": "Monocle utiliza la tecnología DADI para impulsar una estrategia de CRM mejorada a través de la impresión, digital, radio y venta al por menor. Toma todos los datos de usuario de un solo conjunto y trabaja para proporcionar una experiencia de datos sin fisuras para competir con el servicio de primera categoría que se encuentra en las tiendas físicas Monocle.\n\nUn registro de usuario único admite el registro con productos digitales, la suscripción a boletines de correo electrónico, las compras realizadas en la tienda de Monocle más las suscripciones digitales y a revistas. Esto ha permitido una mensajería más específica, lo cual es más efectivo tanto para la marca como para los usuarios.\n\nLa plataforma DADI también gestiona contenido editorial a través de sitios de navegador y aplicaciones, mientras que nuestro equipo de asistencia de empresa ha trabajado en desarrollo conjunto con ingenieros de Monocle que ofrecen asistencia que va desde la elevación tecnológica pesada hasta la experiencia de usuario y el diseño. Una asociación que ha recompensado a Monocle.com con varios premios por su producto digital.",
          "quote": {
            "body": "La tecnología DADI dio sentido a nuestros datos de usuario y permitió una experiencia en línea de calidad superior a la que nuestros lectores encuentran impresa",
            "cite": "Jefe de digital, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Solución para todo el sitio: desde la página principal hasta el carrito de compra.",
            "Aplicación para iOS diseñada y construida, tirando de una sola API.",
            "Distribución entre dispositivos de contenido de audio, tanto en tiempo real como bajo demanda",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "es",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Sitio web y gestión de contenidos reconstruidos para agilizar la experiencia del usuario y el flujo de trabajo editorial: todos entregados contra reloj.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire sufría con la mala experiencia de usuario y daba dolores de cabeza a su equipo editorial. Se necesitaba una actualización de diseño y reinicio de la administración de contenido, y solo había 12 semanas para hacerlo.",
          "results": "Una mezcla de microservicios de DADI ofrece rápidamente un nuevo sitio web de respuesta móvil impulsado por interfaces de gestión de contenido fáciles de usar. Establece el terreno para la evolución iterativa en el codesarrollo.",
          "detail": "Bauer eligió la tecnología DADI para su refresco Empire en el verano de 2015 y entregó un sitio totalmente reconstruido antes de que las hojas se volvieran amarillas en otoño.\n\nEl nuevo producto es una API construida primero en apoyo del flujo de trabajo editorial reducido, la experiencia de usuario sin problemas en varios dispositivos y la funcionalidad de SEO mejorada. El proyecto se definió inicialmente como un producto mínimo viable y después de la fase de lanzamiento se trasladó en iteración continua medida en función de los datos de uso.\n\nDADI ahora trabaja con Empire en un lanzamiento para incluir la última versión de Publish y despliega la tecnología de la plataforma a través de otros títulos de la gama de Bauer. Un solo registro de usuario apoya el registro con productos digitales, suscripciones a boletines de correo electrónico, compras realizadas en la tienda Monocle más suscripciones digitales y revistas. Esto ha permitido una mensajería más específica, que es más efectiva tanto para la marca como para los usuarios.",
          "quote": {
            "body": "La plataforma DADI proporciona una funcionalidad SEO única y líder del mercado",
            "cite": "Jefe de búsqueda, **Bauer Media**"
          },
          "captions": [
            "Página de inicio totalmente sensible.",
            "Trabajo en concepto de diseño temprano.",
            "La integración con Themoviedb.org permite a los editores seleccionar imágenes de alta calidad fácilmente.",
            "Las páginas centrales permiten que el contenido se organice en torno a los títulos."
          ]
        },
        {
          "lang": "es",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "Un producto digital de primera categoría digno de  exclusivas islas de vacaciones de lujo y propiedades seleccionadas personalmente por Richard Branson.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition necesitaba más que un sitio de folleto para representar su mezcla única de islas privadas, emocionantes safaris y propiedades de lujo. Necesitaba una experiencia de usuario inmersiva y una CRM transparente.",
          "results": "La tecnología DADI ofrece una gestión de contenidos flexible y una experiencia de usuario de primera categoría, además de un CRM ligero que actúa como el pegamento entre el motor de reservas, la comunicación digital y el servicio de atención al cliente cara a cara.",
          "detail": "Virgin Limited Edition utiliza la tecnología DADI para impulsar la gestión de contenidos y gestionar las relaciones con sus usuarios, es una compilación de primera API montada y administrada por el equipo de soporte empresarial de DADI.\n\nLa primera prioridad fue la presentación –el sitio fue planeado, diseñado y construido para sumergir al usuario en los detalles de la propiedad– pero la plataforma DADI también permite un control flexible sobre la forma en que se presenta el contenido, para que el equipo pueda construir plantillas individuales sin intervención del desarrollador.\n\nDetrás de las escenas, una sola tienda de datos de usuario mezcla la información de múltiples fuentes y proporciona una única versión de la verdad: vital para poder ajustar una estrategia de contacto con el cliente para una demografía exigente.",
          "quote": {
            "body": "DADI se ha convertido en una parte esencial de nuestra estrategia de crecimiento, construyendo no solo nuestro sitio web de \"escaparate\", sino también ayudándonos a administrar nuestros datos de clientes de manera más inteligente",
            "cite": "Director de marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "Un sistema de diseño único que se adapta a cada una de las nueve propiedades",
            "Las pequeñas adiciones interativas están dispersas por el sitio.",
            "Las galerías de imágenes de alta resolución muestran las experiencias de lujo.",
            "El blog de edición limitada de Virgin permite a los visitantes conocer la personalidad de cada ubicación."
          ]
        },
        {
          "lang": "es",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "Un proyecto ambicioso para combinar múltiples títulos y equipos editoriales en una sola solución con flujos de ingresos mejorados.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Las revistas Grazia, Closer y Heat eran una cartera digital discontinua que utilizaba múltiples sistemas de gestión de contenidos y publicidad. Lifestyle.one buscó reunir estos productos en un solo paquete racionalizado.",
          "results": "La tecnología DADI impulsa los tres títulos a partir de una sola base de código, haciendo pequeños ajustes de presentación para cada requisito de marca. Años de contenido se migraron a un solo lugar, tanto con tendencias publicitarias como editoriales mejoradas significativamente.",
          "detail": "Otra construcción de extremo a extremo que utiliza el conjunto de tecnología DADI, Lifestyle.one es una presentación única que adapta diversos requisitos comerciales y editoriales a través de una combinación de títulos y combina requisitos de flujo de trabajo en varios equipos de redacción.\n\nLa compilación amplió la solución de gestión de contenido de publicación creada para la revista Empire, con ventajas en versiones combinadas y actualizaciones en cuatro títulos de la cartera más amplia.\n\nEl resultado es un producto digital más reducido que necesita menos recursos de mantenimiento técnico, comercial y editorial. Promueve la promoción cruzada y reúne a una audiencia alrededor de la cartera de contenidos con mayores oportunidades de ingresos.",
          "quote": {
            "body": "Los productos construidos con DADI se entregan en días y semanas, no semanas y meses",
            "cite": "Director de tecnología, **Bauer Media**"
          },
          "captions": [
            "Cada sitio de revista se deriva de una base de código unificada. (Grazia)",
            "Heat World.",
            "Closer.",
            "Búsqueda integrada, etiquetado y base de datos de celebridades a través del sitio."
          ]
        },
        {
          "lang": "ru",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "Комплексная реконструкция на базе технологий DADI для оптимизации рабочего процесса, улучшения системы взаимодействия и поддержки новых коммерческих возможностей.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? был построен на устаревшей платформе, которая представляла собой хрупкий, ориентированный только на пользователей ПК интерфейс, с несколькими, не связанными друг с другом, потоками рабочих задач. Необходимы были новые системы, чтобы авторы могли проводить больше времени, работая над контентом, чем админ, а пользователи могли бы беспрепятственно пользоваться ресурсом на разных устройствах.",
          "results": "С помощью технологий DADI создается решение в виде платформы API-first, которая разделяет контент и презентацию, в результате чего рабочие процессы создания контента и редактирования могут использоваться в нескольких цифровых продуктах на ПК, планшетах и мобильных устройствах.",
          "detail": "Haymarket Media Group решила использовать технологии DADI для реконструкции сайта whatcar.com, который был разработан на основе устаревших технологий с чрезмерными требованиями к ресурсам редактирования и обеспечивал негативный пользовательский опыт.\n\nВнутренняя команда разработчиков работала совместно с инженерами и стратегами DADI над новой, итеративной технологической картой, устраняя многочисленные недостатки старой платформы и расширяя сайт с отзывами до полноценного сервиса по розничной продаже автомобилей.\n\nБыл разработан новый интерфейс магазина и системы управления новым контентом, с учетом требований редакционных рабочих процессов, и позволяющий обеспечивать работу версий для ПК, планшетов, мобильных устройств и других продуктов в будущем из единого источника. Затем он был интегрирован с обновленным, полностью отзывчивым внешним интерфейсом, разработанным с учетом персонализации будущего контента на базе данных об использовании, собранных платформой DADI. Это модель сочетания контента и коммерции.",
          "quote": {
            "body": "Перемещение whatcar.com на DADI значительно сократило наши затраты на инфраструктуру",
            "cite": "Руководитель продукта, **Haymarket Consumer Media**"
          },
          "captions": [
            "Отзывчивая домашняя страница Whatcar.com.",
            "Комбинирование нескольких источников данных для выявления новых идей.",
            "Полноэкранная галерея изображений демонстрирует отличные редакционные снимки.",
            "Дизайн для глубоко уважаемой премии What Car? Car of the Year Awards."
          ]
        },
        {
          "lang": "ru",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "Новая платформа, разработанная с единым режимом просмотра для пользователя и подписчика, представляет собой полный комплект цифрового продукта — от браузера до приложения.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Цифровые продукты Monocle управлялись с помощью несвязанной платформы, где отсутствовала корреляция между подписчиками журнала, покупателями магазина и пользователями сайта. Необходимо было решение для упрощения единого просмотра для подписчиков на ПК и на мобильных устройствах, а также для внедрения целенаправленной CRM-стратегии.",
          "results": "DADI укрепляет новую стратегию, основанную на данных, которая идентифицирует индивидуальный и оптимизирует пользовательский опыт, обеспечивая увеличение количества посетителей на 88%, количества зарегистрированных пользователей на 49%, увеличение количества продаж на 25% и количества платных подписчиков на 44%, и все это в течение шести месяцев.",
          "detail": "Monocle использует технологии DADI для обеспечения работы расширенной CRM-стратегии в печати, цифровом издательстве, радио и розничной торговле. Они направляют все пользовательские данные в единое хранилище и обеспечивают плавный пользовательский опыт на основе данных для конкурирования с премиум-сервисом в физических магазинах Monocle.\n\nЕдиная запись пользователя включает в себя регистрацию в цифровом продукте, подписку на электронную новостную рассылку, покупки, совершенные в магазине Monocle, а также цифровую подписку и подписку на журнал. Данное решение позволило отправлять более целенаправленные сообщения, что гораздо эффективнее как для бренда, так и для пользователей.\n\nПлатформа DADI также управляет редакционным контентом на сайте и в приложениях, в то время как наша команда службы поддержки для предприятий занимается разработкой совместно с инженерами Monocle, предлагая поддержку от высокотехнологичных процессов до UX и дизайна. Данное партнерство позволило Monocle.com получить несколько наград за их цифровые продукты.",
          "quote": {
            "body": "Технологии DADI проанализировали наши пользовательские данные и позволили обеспечить премиальный онлайн опыт, соответствующий качеству нашей печатной продукции",
            "cite": "Руководитель отдела цифровых технологий, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Решение для всего сайта: от домашней страницы до корзины.",
            "Приложение для iOS, разработанное на базе одного API",
            "Передача аудиоконтента между несколькими устройствами в режиме реального времени и по запросу",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "ru",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Обновленный сайт и система управления контентом для оптимизации пользовательского опыта и рабочих процессов редактирования — и все в кратчайшие сроки.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire страдал от плохого пользовательского опыта и доставлял головную боль команде редакции. На сайте необходимо было обновить дизайн и произвести перезагрузку системы управления контентом, и все это всего за 12 недель.",
          "results": "Комбинация микросервисов DADI быстро обеспечивает новый совместимый с мобильными устройствами сайт, базирующийся на простых в использовании интерфейсах системы управления контентом. Это закладывает основу для итеративной эволюции в процессе совместной разработки.",
          "detail": "Компания Bauer выбрала технологии DADI для обновления Empire летом 2015 года, и полностью обновленный сайт был готов еще до того, как осенью пожелтели листья.\n\nНовый продукт был создан на базе API-first для обеспечения сдержанных рабочих процессов редактирования, пользовательского опыта без излишеств и расширенной функциональности модуля SEO. Первоначально проект был определен как минимально жизнеспособный продукт, а после этапа запуска перешел в режим непрерывной итерации, будучи сравниваемым с данными об использовании.\n\nСейчас DADI работает с Empire над релизом, с которым будет включена последняя версия Publish, а также внедряет технологии платформы в других названиях из портфолио Bauer.",
          "quote": {
            "body": "Платформа DADI обеспечивает уникальную, лидирующую на рынке функциональность модуля SEO",
            "cite": "Руководитель поискового отдела, **Bauer Media**"
          },
          "captions": [
            "Максимально отзывчивая домашняя страница.",
            "Ранняя концепция дизайна.",
            "Интеграция с Themoviedb.org позволяет редакторам с легкостью выбирать изображения высокого качества.",
            "Хаб-страницы позволяют организовывать контент по названиям."
          ]
        },
        {
          "lang": "ru",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "Премиальный цифровой продукт, достойный эксклюзивных роскошных островов и недвижимости, выбранной лично Ричардом Брэнсоном.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition нужно было нечто большее, чем сайт-брошюра, чтобы представить уникальные частные острова, захватывающее сафари и роскошную недвижимость. Необходим был захватывающий UX и плавная CRM-система.",
          "results": "Технологии DADI обеспечивают гибкую систему управления контентом и премиальный пользовательский опыт, а также легковесную CRM-систему, которая выступает в качестве клеевого материала между механизмом бронирования, цифровой связью и личным обслуживанием клиентов.",
          "detail": "Virgin Limited Edition использует технологии DADI для обеспечения работы системы управления контентом и управления взаимоотношениями с пользователями. Это сборка API-first, подготовленная и управляемая службой поддержки для предприятий от DADI.\n\nГлавным приоритетом была презентация, так как сайт планировался и разрабатывался с целью погружения пользователя в подробности об объекте, но платформа DADI также предоставляет возможность гибкого контроля за способом презентации контента, таким образом члены команды могут создавать индивидуальные шаблоны без вмешательства разработчиков.\n\nЗа кулисами единое хранилище данных пользователей собирает информацию из разных источников и предоставляет единую правдивую картину, что жизненно важно для настройки стратегии взаимодействия с клиентами в условиях наличия требовательной аудитории.",
          "quote": {
            "body": "DADI стала неотъемлемой частью нашей стратегии развития, разработав не только \"витрину\" сайта, но и оказав нам помощь в более разумном управлении нашими данными о клиентах",
            "cite": "Директор по маркетингу, **Virgin Limited Edition**"
          },
          "captions": [
            "Единая дизайн-система, адаптированная к каждому из девяти объектов.",
            "По всему сайту расположены небольшие интерактивные дополнения.",
            "Галереи изображений с высоким разрешением демонстрируют роскошь.",
            "Блог Virgin Limited Edition позволяет посетителям узнать об индивидуальности каждого места."
          ]
        },
        {
          "lang": "ru",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "Амбициозный проект по совмещению нескольких продуктов и редакций в единое решение с расширенными потоками доходов.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Журналы Grazia, Closer и Heat представляли собой несвязанные элементы цифрового портфолио с несколькими системами управления контентом и передачи рекламы. Lifestyle.one решила объединить эти продукты в единый оптимизированный пакет.",
          "results": "Технологии DADI обеспечивают работу всех трех продуктов на единой кодовой базе с небольшими презентационными корректировками в соответствии с требованиями каждого бренда. Годы контента были перемещены в единое хранилище со значительно улучшенными рекламными потоками и потоками рабочих задач.",
          "detail": "Будучи еще одним комплексным продуктом, созданным при помощи технологий DADI, Lifestyle.one является единой front-end платформой-презентацией, которая согласовывает различные коммерческие и редакционные требования разных продуктов и подгоняет требования к рабочим процессам у разных редакционных команд.\n\nДанная сборка расширила решение для управления контентом Publish, созданное для журнала Empire, добавив преимущества в виде комбинированных релизов и обновлений во всех четырех наименованиях более широкого портфолио.\n\nВ результате получился более компактный цифровой продукт, который нуждается в значительно меньшем объеме технического, коммерческого и редакционного обслуживания. Он способствует перекрестному продвижению и собирает аудиторию вокруг портфолио контента с большим количеством возможностей для получения доходов.",
          "quote": {
            "body": "С DADI на создание продуктов уходят не недели и месяцы, а недели и дни",
            "cite": "Главный технический директор, **Bauer Media**"
          },
          "captions": [
            "Каждый сайт журнала основан на единой кодовой базе. (Grazia)",
            "Heat World.",
            "Closer.",
            "Интегрированный поиск по всему сайте, теги и база данных знаменитостей."
          ]
        },
        {
          "lang": "pt",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "Reconstrução completa usando a tecnologia DADI para optimizar o processo de trabalho, melhorar interacções e suportar novas oportunidades comerciais.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? foi construído sobre uma plataforma antiga e obsoleta que proporcionava experiências frágeis, suportadas apenas por clientes desktop, com vários processos editoriais desligados uns dos outros. Eram necessários novos sistemas que permitissem aos editores passarem mais tempo com os seus conteúdos e menos em tarefas administrativas - e aos utilizadores terem experiências impecáveis em vários dispositivos.",
          "results": "A tecnologia DADI implementa uma plataforma API-first que abstrai conteúdos da apresentação, o que significa que uma única fonte de conteúdos e um único processo editorial pode alimentar vários produtos digitais presentes em dispositivos desktop, tablets ou telemóveis.",
          "detail": "O grupo Haymarket Media escolheu a tecnologia DADI para uma reconstrução do whatcar.com, que usava uma combinação de tecnologias antigas que exigiam demasiado dos recursos editoriais e proporcionavam uma experiência pobre.\n\nOs programadores internos trabalharam em colaboração com engenheiros e estrategistas da DADI seguindo um plano para um produto novo e iterativo - colmatando as muitas limitações da plataforma antiga e estendendo o website de \"reviews\" para se tornar um completo serviço de venda de carros.\n\nUma nova central de conteúdos e um interface de gestão de conteúdos foram criados, feitos à medida para os requisitos do processo editorial e capazes de alimentar produtos em computadores, tablets, telemóveis e outros dispositivos futuros, tudo a partir de uma única fonte. O produto foi então integrado com um front-end responsive actualizado, desenhado com a futura personalização de conteúdos em mente - baseada em dados de utilização recolhidos pela plataforma DADI. É uma mistura perfeita de conteúdo editoriais e retalho.",
          "quote": {
            "body": "Mudar o whatcar.com para DADI reduziu significativamente os custos com a infra-estrutura.",
            "cite": "Product Lead, **Haymarket Consumer Media**"
          },
          "captions": [
            "Página inicial responsive do Whatcar.com.",
            "Combinar várias fontes de dados para revelar novas visões.",
            "Galerias de imagem de ecrã inteiro demonstram a fantástica fotografia editorial.",
            "Trabalho de design para os respeitados prémios What Car? Car of the Year."
          ]
        },
        {
          "lang": "pt",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "Uma nova plataforma construída em suporte de uma vista única para utilizadores e subscritores - que alimenta todo um conjunto de produtos digitais, desde browsers a aplicações.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Os produtos digitais da Monocle eram conduzidos por uma plataforma desconectada sem correlação entre assinantes da revista, clientes da loja e utilizadores do site. Era necessária uma nova solução que permitisse uma única visão para a web e ambientes móveis – e que alimentasse uma estratégia focada no CRM.",
          "results": "A plataforma DADI alicerça uma nova estratégia orientada a dados que identifica indivíduos e optimiza a experiência dos utilizadores, levando a um aumento de 88% em visitas, 49% em utilizadores registados. 25% em vendas da loja e uma subida de 44% em assinantes pagos – tudo em seis meses.",
          "detail": "A Monocle utiliza tecnologia DADI para alimentar uma estratégia CRM melhorada para print, digital, rádio e loja. Consome e concentra dados numa única fonte e proporciona uma experiência orientada a dados ao nível dos serviços premium encontrados em lojas físicas da Monocle.\n\nUm único registo de utilizador armazena o registo com o produto digital, subscrições a newsletters, compras feitas na Monocle Shop além de subscrições digitais e físicas da revista. Esta abordagem permitiu comunicações mais personalizadas e relevantes, o que é mais eficaz tanto para a marca como para os utilizadores.\n\nA plataforma DADI também gere os conteúdos editoriais do site e das aplicações móveis, sendo que a nossa equipa de soluções trabalhou em co-desenvolvimento com engenheiros da Monocle oferecendo suporte, desde complexas operações tecnológicas até UX e design – uma parceria que deu à Monocle vários prémios pelo seu produto digital.",
          "quote": {
            "body": "A tecnologia DADI percebeu os nossos dados de utilizadores e permitiu uma experiência online premium com a qualidade que os nossos leitores encontram na revista física.",
            "cite": "Head of Digital, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Uma solução abrangente: desde a página inicial até ao carrinho de compras.",
            "Aplicação iOS desenhada e desenvolvida, alimentada por uma única API.",
            "Serviço de conteúdos áudio para vários dispositivos, tanto em tempo real como on-demand.",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "pt",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Reconstrução de website e gestor de conteúdos para melhorar a experiência do utilizador e o processo editorial - tudo entregue em contra-relógio.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "A Empire sofria com experiências de utilizador pobres, causando dores de cabeça à equipa editorial. Era necessário um design refrescado e um reboot à gestão de conteúdos – tínhamos 12 semanas para o fazer.",
          "results": "Um conjunto de microservices DADI rapidamente criam um novo website móvel responsive, alimentado por interfaces de gestão de conteúdos de simples utilização. Cria as fundações que permitem uma evolução iterativa em co-desenvolvimento.",
          "detail": "A Bauer escolheu tecnologia DADI para o redesenvolvimento da Empire no Verão de 2015 e viram um site completamente novo antes que as folhas ficassem castanhas nesse Outono.\n\nO novo produto é API-first e foi construído em suporte de um processo editorial ágil, uma experiência sem distracções nos vários dispositivos e com funcionalidades SEO melhoradas. O projecto foi inicialmente definido como um produto mínimo viável e após a fase de lançamento transitou para um plano de iteração contínua, baseado em dados de uso reais.\n\nA DADI trabalha agora com a Empire num novo lançamento que inclui a última versão do Publish e está a alargar a utilização da plataforma a outros títulos no portfólio da Bauer.",
          "quote": {
            "body": "The DADI platform provides unique and market-leading SEO functionality",
            "cite": "Head of Search, **Bauer Media**"
          },
          "captions": [
            "Homepage responsive.",
            "Primeiros trabalhos de design.",
            "A integração com Themoviedb.org permite aos editores escolherem imagens de alta qualidade sem esforço.",
            "As páginas dos hubs permitem que o conteúdo seja organizado por títulos."
          ]
        },
        {
          "lang": "pt",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "Um produto digital premium, digno de ilhas de férias exclusivas e propriedades seleccionadas pessoalmente por Richard Branson.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "A Virgin Limited Edition precisava de mais do que um site-brochura que representasse a sua mistura única de ilhas privadas, safaris excitantes e propriedades de luxo. Era necessário um UX imersivo e um CRM unificado.",
          "results": "A tecnologia DADI oferece uma gestão de conteúdos flexível e uma experiência de utilizador premium, para além de um CRM leve que funciona como a cola entre o motor de reservas, comunicação digital e serviço de clientes físico.",
          "detail": "A Virgin Limited Edition utiliza tecnologia DADI para alimentar a gestão de conteúdos e gerir a relação com os seus utilizadores. É uma solução API-first desenvolvida e mantida pela equipa de suporte empresarial da DADI.\n\nA prioridade principal foi a apresentação – o site foi planeado, desenhado e construído para imergir o utilizador nos detalhes das propriedades – mas a plataforma DADI permite também um controlo flexível sobre a maneira como os conteúdos são apresentados, para que as equipas possam construir templates individuais sem requerer a intervenção dos engenheiros.\n\nNos bastidores, um único registo de utilizador combina informação de múltiplas fontes e oferece uma única fonte de verdade – essencial para ajustar a estratégia de contacto com o cliente a um público exigente",
          "quote": {
            "body": "A DADI tornou-se uma parte essencial da nossa estratégia de crescimento, construindo não só o nosso website 'montra de loja', mas também ajudando-nos a gerir os nossos dados de clientes de uma forma mais inteligente",
            "cite": "Director of Marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "Um único sistema de design que se adapta a cada uma das nove propriedades.",
            "Pequenos acrescentos iterativos estão espalhados pelo site.",
            "Galerias de imagens de alta resolução demonstram as experiências de luxo.",
            "O blog Virgin Limited Edition dá a conhecer aos visitantes a personalidade de cada uma das localizações."
          ]
        },
        {
          "lang": "pt",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "Um projecto ambicioso que combina vários títulos e equipas editoriais numa única solução com fontes de receita melhoradas.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia, Closer and Heat magazines were a disjointed digital portfolio using multiple content management and advertising delivery systems. Lifestyle.one sought to bring together these products into a single streamlined package.",
          "results": "A tecnologia DADI alimenta os três títulos a partir de uma única base de código, fazendo pequenos ajustes visuais de acordo com os requisitos de cada marca. Conteúdos de anos foram migrados para uma única localização, melhorando tanto o processo de trabalho das equipas de publicidade e editorial.",
          "detail": "Mais uma solução completa usando a suite de tecnologia DADI, Lifestyle.one é um único front-end que acomoda vários requisitos comerciais e editoriais de um conjunto de títulos – e une requisitos do processo editorial de várias equipas.\n\nO produto estendeu a solução de gestão de conteúdos Publish usada para a revista Empire, trazendo vantagens em lançamentos conjuntos e actualizações de quatro títulos do portfolio.\n\nO resultado é um produto digital ágil que é menos sedento de recursos no que toca à manutenção técnica, comercial e editorial. Estimula a promoção entre os títulos e liga o público a um portfólio de conteúdos com melhores oportunidades de receita",
          "quote": {
            "body": "Produtos construídos com DADI são entregues em dias e semanas, não em semanas e meses",
            "cite": "Chief Technology Officer, **Bauer Media**"
          },
          "captions": [
            "Cada site de revista é criado a partir de uma base de código unificada. (Grazia)",
            "Heat World.",
            "Closer.",
            "Função de procura integrada através dos vários sites, tagging e base de dados de celebridades."
          ]
        },
        {
          "lang": "zh_hant",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "以 DADI 技術來重建的端到端流程架構可優化工作流程、改善互動及支援新的商業機會。",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "「What Car?」是架構在一座日漸老舊、使用者經驗設計薄弱且限定桌面版本，並設有多個斷線編輯工作流的的「遺產平台」(legacy platform t)。需要全面更新系統來讓作者能擁有更多時間在編輯內容上而不是管理，同時也能提供使用者一個無縫連接的跨裝置體驗。",
          "results": "DADI 技術傳遞一種可從展示摘要內容的 API 優先網路平台解決方案，代表著只要一份內容和一種編輯工作流程就能跨桌面、平板及行動裝置滿足多種數位產品。",
          "detail": "Haymarket 媒體集團選擇使用 DADI 技術來傳遞 Whatcar.com 的改造工程；由於原本的網站內容使用了混合的老舊技術，使得編輯資源的需求過重及使用者體驗不良。\n\n於是內部開發人員與 DADI 工程師及策略師群透過共同協作設計了一個全新的反覆式產品藍圖，不但修正許多老舊遺產平台的缺點，也將「評論」網站拓展成一項完整的汽車買賣零售服務。\n\n成功開發出一個針對編輯工作流程需求並能以單一來源支援桌面、平板、行動裝置和未來產品的全新數位內容商店和管理介面。接著將其與一個以未來內容個人化概念設計的最新完全響應式前端進行整合——以 DADI 平台所收集的使用數據為基礎；是一座結合了內容與商務的模型。",
          "quote": {
            "body": "將 Whatcar.com 轉移到 DADI 大幅減低了我們的基礎建設花費",
            "cite": "Haymarket 消費者媒體 產品經理"
          },
          "captions": [
            "Whatcar.com 響應式首頁",
            "結合多個資料來源來揭露新洞見。",
            "全螢幕影像庫展示最佳編輯照片",
            "負責為備受尊崇的「What Car? 年度汽車獎」設計"
          ]
        },
        {
          "lang": "zh_hant",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "為支援單一使用者與訂閱者瀏覽所創建的全新平台——以及支援從瀏覽器到應用程式的完整數位產品組合。",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocle 數位產品是由一個與雜誌訂閱者、商店顧客和網站使用者並無相關的斷線平台所驅動。需要一個新的解決方案來促進跨網路和行動裝置的單一訂閱者瀏覽——及推動一個重點的顧客關係管理經營策略。",
          "results": "DADI 平台支援一個能辨識個人與優化使用者經驗的全新數據驅動策略——在六個月內即增加 88% 的訪客、超過 49% 以上的註冊用戶、25% 的商店銷售及 44% 的付費訂閱人數。",
          "detail": "Monocle 使用 DADI 技術來啟動一個跨紙本、數位、廣播和零售的強化顧客關係管理策略，這將所有使用者資料拖曳進同一地方來提供無縫連接的數據驅動體驗與 Monocle 實體商店的優質服務競爭。\n\n單一使用者紀錄可支援數位產品註冊、郵件訊息訂閱、Monocle 商店購物加上數位與紙本雜誌訂閱。這促進了更多目標客群的訊息傳送，讓品牌和相關使用者都能更有效率。\n\nDADI 平台也負責管理跨瀏覽器網站與應用程式的編輯內容，同時我們的企業支援團隊也持續與 Monocle 的內部工程師一起共同進行開發，提供從大數據深度學習演算 (heavy-lfiting) 到使用者經驗設計的支援服務——這樣的合作關係也讓  Monocle.com 獲得了多個關於數位產品的獎項殊榮。",
          "quote": {
            "body": "DADI 技術了解我們的使用者資料並啟動具備我們讀者對紙本品質相同需求的優質網路體驗",
            "cite": "Monocle 數位長"
          },
          "vimeo": "66093926",
          "captions": [
            "全站優化解決方案：從首頁到購物車",
            "專為 iOS 應用程式製作設計，由單一 API 驅動",
            "兼具即時性和隨選服務的跨裝置語音內容傳遞",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "zh_hant",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "重建網站及內容管理來精簡使用者經驗和編輯工作流程——全部都可異步傳遞",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire 欠佳的使用者經驗問題為有關編輯團隊帶來相當程度的困擾。整體設計需要全面更新，也需要重新啟動內容管理——並且只有 12 週可以進行",
          "results": "DADI 混合的微服務成功傳遞了一座由使用簡易的內容管理介面所驅動的全新行動響應式網站。這為共同開發中的反覆式演進奠定了穩固的基礎",
          "detail": "鮑爾媒體集團 (Bauer Media Group) 在 2015 年夏天選擇使用 DADI 技術來為旗下品牌 Empire 進行全面改造，並且在秋天之前就順利呈現出一座全面改造的網站服務。\n\n這是以 API 優先來支援精簡編輯工作流程的全新產品，可呈現簡明的跨多裝置使用者體驗設計及強化的搜尋引擎優化功能。此專案原先被定義為最小可行性的產品，但在上市階段後即蛻變成可根據使用數據測量、持續反覆式開發模式的產品。\n\nDADI 目前正與 Empire 共同為一款將包含 Publish 最新版本的新發佈努力，並且推出同時橫跨鮑爾產品組合內其他標題的平台技術。另有可支援數位產品註冊、郵件訊息訂閱、Monocle 商店購物加上數位與紙本雜誌訂閱的單一使用者紀錄。這促進了更多目標客群的訊息傳送，讓品牌和相關使用者都能更有效率。\n\nDADI 平台也負責管理跨瀏覽器網站與應用程式的編輯內容，同時我們的企業支援團隊也持續與 Monocle 的內部工程師一起共同進行開發，提供從大數據深度學習演算 (heavy-lfiting) 到使用者經驗設計的支援服務——這樣的合作關係也讓  Monocle.com 獲得了多個關於數位產品的獎項殊榮。",
          "quote": {
            "body": "DADI 平台提供獨特且市場領先的搜尋引擎優化功能",
            "cite": "鮑爾媒體 搜尋導覽長"
          },
          "captions": [
            "全面響應式首頁",
            "早期設計概念作品",
            "與 Themoviedb.org 的整合能讓編輯輕鬆選擇高畫質的影像",
            "中樞頁面 (hub pages) 能允許將內容組織在標題四周"
          ]
        },
        {
          "lang": "zh_hant",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "一項由創辦人理查德·布蘭森爵士精選豪華渡假島嶼和房產的頂級數位產品",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "維珍限量版 (Virgin Limited Edition) 需要架設一個以上的型錄網站來呈現該品牌獨家精選的私人島嶼、刺激冒險和豪華房產。網站需要以沉浸式的使用者經驗設計和無縫連結的客戶關係管理系統來設計",
          "results": "DADI 技術不僅成功傳遞了彈性靈活的內容管理及頂級的使用者體驗，也提供可緊密結合預訂搜尋引擎、數位通訊和面對面客戶服務三方的輕量級顧客關係管理系統 ",
          "detail": "維珍限量版用 DADI 技術來啟動內容管理和管理使用者關係。這是一個使用 API 優先架構組合並由 DADI 企業支援團隊負責管理的網站。\n\n首要優先考量是呈現方式——網站以讓使用者可身歷其境房屋細節為目標來規劃、設計和架設——而由於 DADI 平台可彈性控制內容的呈現方式，DADI 團隊可因此排除開發者的介入建立個人範本。\n\n在網站幕後設有一座單一使用者的資料儲存庫可融合來自多個來源的資訊並提供單一事實——這對從不同需求的客戶群協調出適合的顧客接觸策略十分重要",
          "quote": {
            "body": "DADI 已成為我們企業成長策略中的重要一環，不僅為我們建立了如同「商店展示窗」的網站，也幫我們更聰明地管理客戶資料",
            "cite": "維珍限量版 行銷總監"
          },
          "captions": [
            "可適用每種九項產品屬性的單一設計系統",
            "遍佈全網站的互動式附加元件",
            "展示奢華體驗的高解析影像中心",
            "維珍限量版部落格讓訪客可了解關於每個地方的獨特性"
          ]
        },
        {
          "lang": "zh_hant",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "一個意欲將多個標題和編輯團隊整合為一個具強化收益流解決方案的雄心計畫",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia、Closer 和 Heat Magazine 是一個使用多種內容管理和廣告傳遞系統的分離數位專案組合。Lifestyle.one 所尋求的是讓這些產品轉化成一個精簡的套裝組合",
          "results": "DADI 技術由同一編碼庫來驅動全部三種標題，並為各個品牌需求進行展示上的微調整。累積多年的內容皆統一轉移至同一地方，使得廣告宣傳和編輯工作流程大幅提升",
          "detail": "另一個也選擇採用 DADI 技術套件的端到端模式網站是 Lifestyle.one：一個可支援跨混合標題下各種商務和編輯需求的單一前端展示建置——並且可配合跨編輯團隊的工作流程需求。\n\n此建置擴展了為 Empire Magazine 所建立的 Publish 內容管理解決方案，為合併發行帶來更多優勢、也為這項跨四種標題的廣大專案組合提供更新。\n\n最終所產生的成果是一項較不過度需要技術、商務和編輯維護相關資源的更精簡數位產品。不但可促進交叉宣傳，也因聚集內容組合四周的客群而帶來更大的收益機會",
          "quote": {
            "body": "使用 DADI 技術所建立的產品可在幾天和幾週內就達成，而非數週到數個月。",
            "cite": "鮑爾媒體首席技術長 "
          },
          "captions": [
            "每個雜誌網站皆是從一座統一的程式碼庫所衍生。(Grazia)",
            "Heat World.",
            "Closer.",
            "跨站整合搜尋、標籤和名人資料庫"
          ]
        },
        {
          "lang": "zh_hans",
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "基于 DADI 技术全程重建，可以优化工作流程、提高参与度以及支持新的商机。",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? 建在一个陈旧的平台上，仅提供脆弱的桌面用户体验，多个编辑工作流程之间互不关联。他们需要一个新系统，以便让写作者将更多时间用于内容而不是管理，并且用户可以获得流畅的跨设备体验。",
          "results": "DADI 技术提供了一个 API 优先平台解决方案，可以从演示文稿中提取内容；也就是说，一组内容和一个编辑工作流程可以跨桌面、平板电脑和手机馈送多个数字产品。",
          "detail": "Haymarket Media 集团选择使用 DADI 技术来重建 whatcar.com；该网络原来采用了各种陈旧的技术，给编辑资源带来了额外的负担，并且用户体验不佳。\n\n内部开发人员与 DADI 工程师及策略师按新的迭代产品路线图合作：修复了旧平台的许多缺点，并将一个“评论”网站扩展成拥有全套购车零售服务。\n\n开发了一个按编辑工作流程要求定制的新内容存储库和管理界面，可以从单个来源支持桌面、平板电脑、手机和将来的产品。然后，根据 DADI 平台收集的使用数据，将此界面与更新后的全速响应前端集成（该前端在设计时就已考虑将来的内容个性化功能）。这是内容和商务模式的大变化。",
          "quote": {
            "body": "将 whatcar.com 迁移到 DADI 后，极大地降低了我们的基础设施成本",
            "cite": "Haymarket 消费者媒体部门产品主管"
          },
          "captions": [
            "Whatcar.com 快速响应主页",
            "结合多个数据源来发现新的见解。",
            "全屏图像图库展示了出色的编辑摄影技术",
            "为备受推崇的 What Car 设计作品？年度汽车奖"
          ]
        },
        {
          "lang": "zh_hans",
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "一个新平台，支持单用户和订阅者视图，可以支持从浏览器到应用程序在内的全套数字产品。",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocle 数字产品由不联网的平台驱动，杂志订户、商店顾客和网站用户之间没有关联。需要新解决方案来简化 Web 和手机上的单订户视图，并推动重点 CRM 策略。",
          "results": "DADI 平台巩固了新的数据驱动型策略，可以标识个人与优化用户体验，从而在 6 个月内实现了 88% 的访问量增长、49% 的注册用户增长、25% 的商店销售额增长以及 44% 的付费订户增长。",
          "detail": "Monocle 采用 DADI 技术支持强化的 CRM 策略，涉及印刷、数字媒体、无线电广播和零售。它将所有用户数据拉取到单个容器中，并设法提供流畅的数据驱动型体验，与实体 Monocle 存储库中的优质服务相媲美。\n\n单用户记录支持数字产品注册、电子邮件公告注册、在 Monocle Shop 中购买以及数字内容订阅和杂志订阅。这样可实现更具针对性的消息传送，可为品牌和用户等带来更好的效果。\n\nDADI 还可管理浏览器站点和应用程序中的编辑内容，而我们的企业支持团队一直与 Monocle 的工程师们合作开发，提供从技术提升到用户体验和设计在内的系列支持：这种合作关系为 Monocle.com 带来了数字产品方面的多种好处。",
          "quote": {
            "body": "DADI 技术理顺了我们用户数据的价值，让我们的读者获得了与印刷品相同的优质在线体验",
            "cite": "Monocle 数字媒体主管"
          },
          "vimeo": "66093926",
          "captions": [
            "全网站解决方案：从主页到购物车",
            "设计和构建的 iOS 应用程序从单个 API 拉取数据",
            "以实时及点播方式跨设备提供音频内容",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "lang": "zh_hans",
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "重建网站和内容管理以精简用户体验和编辑工作流程 — 一切均按时交付",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire 以前一直饱受用户体验差之苦，也给其编辑团队带来麻烦。它需要重建一个设计精良的刷新和内容管理系统，并且仅有 12 周的时间完成这个任务",
          "results": "一套 DADI 微服务迅速实现了一个新的快速响应移动网站，并采用了易于使用的内容管理界面驱动。它为合作开发过程中的迭代式演变奠定了基础",
          "detail": "Bauer 选择了 DADI 技术支持其 2015 年夏季的 Empire 休闲活动，并在秋季树叶转黄之前交付了完全重建的网站。\n\n新产品是一种 API 优先的内置支持，支持精益编辑工作流程、有条理的跨设备用户体验以及增强的 SEO 功能。该项目最初定为最低程度可行产品，在推出后阶段根据使用数据继续采取迭代措施。\n\nDADI 目前正与 Empire 合作推出一个版本，将纳入最新版本的 Publish，并在 Bauer 产品组合的其他出版物中部署平台技术。单用户记录支持数字产品注册、电子邮件公告注册、在 Monocle Shop 中购买以及数字内容订阅和杂志订阅。这样可实现更具针对性的消息传送，可为品牌和用户等带来更好的效果。\n\nDADI 还可管理浏览器站点和应用程序中的编辑内容，而我们的企业支持团队一直与 Monocle 的工程师们合作开发，提供从技术提升到用户体验和设计在内的系列支持：这种合作关系为 Monocle.com 带来了数字产品方面的多种好处。",
          "quote": {
            "body": "DADI 平台提供市场主导的独特 SEO 功能",
            "cite": "Bauer Media 搜索主管"
          },
          "captions": [
            "全速响应主页",
            "早期设计概念工作",
            "与 Themoviedb.org 集成后，编辑人员可以轻松选择高品质图像",
            "利用中心页面，可以围绕出版物来组织内容"
          ]
        },
        {
          "lang": "zh_hans",
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "一种高端数字产品，与 Richard Branson 亲自选择的独占豪华度假岛和物业价值相当",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition 需要宣传册网站之外的手段来展示其独特的私家岛屿、精彩探险和豪华物业组合。它需要沉浸式用户体验和流畅的 CRM",
          "results": "DADI 技术可提供灵活的内容管理和优质用户体验，其提供的轻量型 CRM 可以将预订引擎、数字通信和面对面客户服务关联起来",
          "detail": "Virgin Limited Edition 使用 DADI 技术支持内容管理，以及管理与其用户的关系。这是一种 API 优先构造，由 DADI 企业支持团队装配和管理。\n\n最重要的是演示（该网站当初的规划、设计和建设都是为了让用户沉浸于物业的细节），但 DADI 平台还支持灵活控制内容的演示方式，因此团队可以构建个别模板而无需开发人员介入。\n\n在后台，单个用户数据存储库会混合多个来源的信息，提供唯一的真实信息：这对微调要求苛刻的人群的客户联系策略至关重要",
          "quote": {
            "body": "DADI 已成为我们成长战略的必要部分，不仅构建我们的“店前窗口”网站，还帮助我们更加智能地管理客户数据",
            "cite": "Virgin Limited Edition 营销主管"
          },
          "captions": [
            "单一设计系统，可分别适应九处物业",
            "少量互动添加内容散落在整个网站",
            "高分辨率图像图库展示奢华体验",
            "通过 Virgin Limited Edition 博客，访问者可以了解每个地方的特色"
          ]
        },
        {
          "lang": "zh_hans",
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "这是一个宏大的项目，要将多个出版物和编辑团队组合到一个解决方案中，增强收入能力",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "《Grazia》、《Closer》和《Heat》杂志曾是不相关的数字内容组合，采用多个内容管理和广告交付系统。Lifestyle.one 希望将这些产品集中成一个精简的产品包",
          "results": "DADI 技术通过一个代码库来促成全部三个出版物，针对各个品牌的要求做了少量的表现形式的调整。多年的内容迁移到一个地方，广告和编辑工作流程都得到了显著的改进",
          "detail": "Lifestyle.one 是采用成套 DADI 技术的另一个全程构造项目；这是单一的前端展示，可以满足各种出版物的各种商业和编辑要求，可满足多个编辑团队的工作流程要求。\n\n该构造项目扩展了为 Empire 杂志构建的 Publish 内容管理解决方案，在更广泛的组合中实现了四种出版物的组合发布和更新。\n\n结果是提高了数字产品的精益水平，在技术、商业和编辑维护方面减少了资源需求。它促成了交叉推广，围绕内容组合汇聚受众，增加了创收机会",
          "quote": {
            "body": "采用 DADI 技术构建的产品的交付时间按天或周算，而不是按月算",
            "cite": "Bauer Media 首席技术官"
          },
          "captions": [
            "每个杂志网站都派生于一个统一的代码库。(Grazia)",
            "Heat World.",
            "Closer.",
            "跨站点集成式搜索、标记和名人数据库"
          ]
        }
      ]
    }
  }
}
