{
  "datasource": {
    "key": "successes",
    "name": "DADI platform case studies",
    "requestParams": [{
      "param": "client", "field": "handle"
    }],
    "source": {
      "type": "static",
      "data": [
        {
          "handle": "whatcar",
          "title": "What Car?",
          "color": "#e32116",
          "summary": "End-to-end rebuild on DADI technology to optimize workflow, improve engagement and support new commercial opportunity.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "What Car? was built on an ageing legacy platform that presented a brittle, desktop-only user experience with multiple disconnected editorial workstreams. New systems were required so that writers could spend more time on content than admin – and users could have a seamless experience across devices.",
          "results": "DADI technology delivers an API-first platform solution that abstracts content from presentation, meaning one pot of content and one editorial workflow can feed multiple digital products across desktop, tablet and mobile.",
          "detail": "Haymarket Media group chose to use DADI technology to deliver a rebuild of whatcar.com, which used a mix of ageing technology that placed excessive demands on editorial resource and provided a poor user experience.\n\nIn-house developers worked in collaboration with DADI engineers and strategists against a new, iterative product roadmap – fixing the many shortcomings of the legacy platform and extending a 'reviews' website into a full car-buying retail service.\n\nA new content store and management interface was developed, tailored to editorial workflow requirement and capable of powering desktop, tablet, mobile and future products from a single source. This was then integrated with an updated fully responsive front-end designed with future content personalisation in mind – based on usage data collected by the DADI platform. It is a model bend of content and commerce.",
          "quote": {
            "body": "Moving whatcar.com to DADI significantly reduced our infrastructure costs",
            "cite": "Product Lead, **Haymarket Consumer Media**"
          },
          "captions": [
            "Whatcar.com responsive homepage.",
            "Combining multiple data sources to reveal new insights.",
            "Full screen image galleries showcase the great editorial photography.",
            "Design work for the much respected What Car? Car of the Year Awards."
          ]
        },
        {
          "handle": "monocle",
          "title": "Monocle",
          "color": "#fc0",
          "text-color": "#000",
          "summary": "A new platform built in support of single user and subscriber view – and to power a full suite of digital product from browser to app.",
          "components": [
            "User data management",
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Monocle digital products were driven by a disconnected platform with no correlation between magazine subscribers, shop customers and website users. A new solution was needed to facilitate single subscriber view across web and mobile – and drive a focussed CRM strategy.",
          "results": "The DADI platform underpins a new data driven strategy that identifies the individual and optimizes user experience, delivering an 88% increase in visitors, 49% more registered users, 25% greater shop sales and a 44% increase in paid subscribers – and inside six months.",
          "detail": "Monocle uses DADI technology to power an enhanced CRM strategy across print, digital, radio and retail. It pulls all user data into a single pot and works to provide a seamless data driven experience to rival the premium service found in physical Monocle stores.\n\nA single user record supports registration with digital product, sign up to email bulletins, purchases made in the Monocle Shop plus both digital and magazine subscriptions. This has allowed for more targeted messaging which is more effective for both brand and users alike.\n\nThe DADI platform also manages editorial content across browser site and apps, while our enterprise support team has been working in co-development with engineers at Monocle offering support ranging from tech heavy lifting to UX and design – a partnership that has rewarded Monocle.com with several awards for its digital product.",
          "quote": {
            "body": "DADI technology made sense of our user data and enabled a premium online experience of the quality our readers find in print.",
            "cite": "Head of Digital, **Monocle**"
          },
          "vimeo": "66093926",
          "captions": [
            "Site-wide solution: from the homepage to the shopping cart.",
            "iOS app designed and built, pulling from a single API.",
            "Cross-device delivery of audio content, both real-time and on-demand.",
            "Integration with Vimeo.com allows uploading of video content from the editorial interface."
          ]
        },
        {
          "handle": "empire",
          "title": "Empire",
          "color": "#ff0000",
          "summary": "Rebuilt website and content management to streamline user experience and editorial workflow – all delivered against the clock.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Empire was suffering with poor user experience and bringing headaches to its editorial team. It needed a design refresh and content management reboot – and there was only 12 weeks to do it.",
          "results": "A mix of DADI microservices rapidly delivers a new mobile responsive website driven by easy-to-use content management interfaces. It lays the ground for iterative evolution in co-development.",
          "detail": "Bauer chose DADI technology for its Empire refresh in Summer 2015 and delivered a fully rebuilt site before the leaves turned yellow in Autumn.\n\nThe new product is an API-first built in support of lean editorial workflow, clutter-free user experience across multiple devices and enhanced SEO functionality. The project was initially defined as a minimum viable product and after the launch phase moved into continuous iteration measured against usage data.\n\nDADI is now working with Empire on a release to include the latest version of Publish and is rolling out platform technology across other titles in the Bauer portfolio.",
          "quote": {
            "body": "The DADI platform provides unique and market-leading SEO functionality",
            "cite": "Head of Search, **Bauer Media**"
          },
          "captions": [
            "Fully responsive homepage.",
            "Early design concept work.",
            "Integration with Themoviedb.org allows editors to select high quality images easily.",
            "Hub pages allow content to be organised around titles."
          ]
        },
        {
          "handle": "virgin",
          "title": "Virgin Limited Edition",
          "color": "#333",
          "summary": "A premium digital product worthy of exclusive luxury holiday islands and properties selected personally by Richard Branson.",
          "components": [
            "Content management",
            "User data management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Virgin Limited Edition needed more than a brochure site to represent its unique mix of private islands, thrilling safaris and luxury properties. It needed immersive UX and seamless CRM.",
          "results": "DADI technology delivers flexible content management and premium user experience, plus a lightweight CRM  that acts as the glue between booking engine, digital communication and face-to-face customer service.",
          "detail": "Virgin Limited Edition uses DADI technology to power content management and manage relationships with its users. It's an API-first build assembled and managed by the DADI enterprise support team.\n\nFirst priority was presentation – the site was planned, designed and built to immerse the user in property detail – but the DADI platform also allows flexible control over the way the content is presented, so the team can build individual templates without developer intervention.\n\nBehind the scenes, a single user data store mixes information from multiple sources and provides a single version of the truth – vital for being able to tune a customer contact strategy for a demanding demographic.",
          "quote": {
            "body": "DADI has become an essential part of our growth strategy, building not only our ‘shop-front window’ website, but also helping us manage our customer data more intelligently",
            "cite": "Director of Marketing, **Virgin Limited Edition**"
          },
          "captions": [
            "A single design system which adapts to each of the nine properties.",
            "Small interative additions are scattered throughout the site.",
            "High-resolution image galleries showcase the luxury experiences.",
            "The Virgin Limited Edition blog lets vistors learn about the personality of each location."
          ]
        },
        {
          "handle": "lifestyle-one",
          "title": "Lifestyle.one",
          "color": "#9530bd",
          "summary": "An ambitious project to combine multiple titles and editorial teams into a single solution with enhanced revenue streams.",
          "components": [
            "Content management",
            "API first",
            "Create Once Publish Anywhere"
          ],
          "requirements": "Grazia, Closer and Heat magazines were a disjointed digital portfolio using multiple content management and advertising delivery systems. Lifestyle.one sought to bring together these products into a single streamlined package.",
          "results": "DADI technology drives all three titles from a single codebase, making small presentational adjustments for each brand requirement. Years of content was migrated into a single location with both advertising and editorial workstreams significantly enhanced.",
          "detail": "Another end-to-end build using the suite of DADI technology, Lifestyle.one is a single front-end presentation that accommodates various commercial and editorial requirements across a mix of titles – and dovetails workflow requirements across multiple editorial teams.\n\nThe build extended the Publish content management solution built for Empire magazine, bringing advantages in combined releases and updates across four titles in the wider portfolio.\n\nThe result is a leaner digital product that is less hungry for resource in technical, commercial and editorial maintenance. It fosters cross-promotion and gathers an audience around the content portfolio with greater revenue opportunity.",
          "quote": {
            "body": "Products built with DADI are delivered in days and weeks, not weeks and months",
            "cite": "Chief Technology Officer, **Bauer Media**"
          },
          "captions": [
            "Each magazine site is derived from a unified codebase. (Grazia)",
            "Heat World.",
            "Closer.",
            "Cross-site integrated search, tagging and celebrity database."
          ]
        }
      ]
    }
  }
}
