{
  "datasource": {
    "key": "supporting",
    "name": "Supporting content for the DADI site",
    "requestParams": [{
      "param": "section", "field": "handle"
    }],
    "source": {
      "type": "static",
      "data": [
        {
          "title": "Privacy information",
          "handle": "privacy",
          "body": "Here's how DADI+ uses data collected from the Internet and other electronic communications networks.\n\nIf you have questions about this policy, or about your personal information, our data controller will help: [dc@dadi.co](mailto:dc@dadi.co).\n\nWe abide by the rules of the **Data Protection Act 1998**.\n## When we collect data\nWe take down your details when:\n* You email us with an enquiry\n* You sign up for our newsletter\n\nWe gather information about your visit to our site:\n* Automatically\n* Using standard web analytics tools\n\n## What we do with it\nHelpful things. We use data to:\n\n* Provide and personalize our services\n* Offer useful information about these services\n* Answer questions and requests\n* Keep our membership records up-to-date\n\n## What we send you\nOnly what you asked for when signing up:\n* Information\n* Details of products and services likely to be of interest\n\nTo change what we send you, how we send it (email, post) or to opt out, please contact:\n\n[dc@dadi.co](mailto:dc@dadi.co)\n+44 (0) 20 7205 2900\n\n**Data Controller**,\n DADI+, 7 Marylebone Lane,\nLondon W1U 1DF\n\n## What we share with others\nWe don't share data with third parties unless:\n* We're obliged to by law: for national security, taxation or criminal investigation\n* You tell us we can\n## Other websites\nOur site links to other company's websites that aren't covered by this policy.\n\nThey might collect and use data too. Look at their policies to find out how.\n## Find out what we know about you\nThis is called a 'subject access request' and it's your right.\nFor a copy of the personal data we hold about you, please write to us:\n\n**Data Controller**,\n DADI+, 7 Marylebone Lane,\nLondon W1U 1DF\n\nWe may charge a fee of up to £10.\n## What we send abroad\nCollecting and processing data using the internet entails sending it between countries.\n\nIt's nothing to worry about, though. The UK's Data Protection Act still applies. Information might be processed outside Europe, for instance, but that information is always secure.\n\nBy communicating with us electronically, you agree to the above.\n## Cookies\nCookies are bits of information that servers send to browsers to allow data collection.\n\nYou can turn them off in most browsers. Look in the 'preferences' menu. For more detailed instructions – and more on cookies in general – try [www.allaboutcookies.org](http://www.allaboutcookies.org).\n\nHowever: turning them off might mean our site (and others) won't work as well.\n## Amendments\nThis privacy policy changes from time-to-time. We last updated it in October 2016."
        }
      ]
    }
  }
}
